const quranData = {
    "1": {
        "name": "Juz 1",
        "surahs": [
            {
                "surah": "Al-Fatihah",
                "number": 1,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "بِسۡمِ اللهِ الرَّحۡمٰنِ الرَّحِيۡمِ"
                    },
                    {
                        "num": 2,
                        "text": "اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "الرَّحۡمٰنِ الرَّحِيۡمِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "مٰلِكِ يَوۡمِ الدِّيۡنِؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "اِيَّاكَ نَعۡبُدُ وَاِيَّاكَ نَسۡتَعِيۡنُؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِهۡدِنَا الصِّرَاطَ الۡمُسۡتَقِيۡمَۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "صِرَاطَ الَّذِيۡنَ اَنۡعَمۡتَ عَلَيۡهِمۡ ۙ‏ غَيۡرِ الۡمَغۡضُوۡبِ عَلَيۡهِمۡ وَلَا الضَّآلِّيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Baqarah",
                "number": 2,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "الٓمّٓۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَۤا اُنۡزِلَ اِلَيۡكَ وَمَاۤ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 7,
                        "text": "خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ​ؕ وَعَلٰىٓ اَبۡصَارِهِمۡ غِشَاوَةٌ  وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ​ۘ‏"
                    },
                    {
                        "num": 9,
                        "text": "يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا ​ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا ​ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢبِمَا كَانُوۡا يَكۡذِبُوۡنَ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡاۤ اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ‏"
                    },
                    {
                        "num": 12,
                        "text": "اَلَا ۤ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَاۤ اٰمَنَ النَّاسُ قَالُوۡاۤ اَنُؤۡمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡاۤ اٰمَنَّا ۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡاۤ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 15,
                        "text": "اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 16,
                        "text": "اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ‏"
                    },
                    {
                        "num": 17,
                        "text": "مَثَلُهُمۡ كَمَثَلِ الَّذِى اسۡتَوۡقَدَ نَارًا ​ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 18,
                        "text": "صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَ ۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ​ ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ​ؕ وَاللّٰهُ مُحِيۡطٌ​ۢ بِالۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 20,
                        "text": "يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ​ؕ كُلَّمَاۤ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَاۤ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا​ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 21,
                        "text": "يٰۤاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَ ۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ​ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡـتُمۡ تَعۡلَمُوۡنَ ‏"
                    },
                    {
                        "num": 23,
                        "text": "وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 24,
                        "text": "فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ  ۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 25,
                        "text": "وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا ​ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا ​ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ ​ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 26,
                        "text": "اِنَّ اللّٰهَ لَا يَسۡتَحۡـىٖۤ اَنۡ يَّضۡرِبَ مَثَلًا مَّا ​بَعُوۡضَةً فَمَا فَوۡقَهَا ​ؕ فَاَمَّا ​الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا ​ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ ‏"
                    },
                    {
                        "num": 27,
                        "text": "الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِى الۡاَرۡضِ​ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ‏"
                    },
                    {
                        "num": 28,
                        "text": "كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ​ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ‏"
                    },
                    {
                        "num": 29,
                        "text": "هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِى الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ​ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 30,
                        "text": "وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِى الۡاَرۡضِ خَلِيۡفَةً ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ​ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 31,
                        "text": "وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 32,
                        "text": "قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 33,
                        "text": "قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ​ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَؕ اَبٰى وَاسۡتَكۡبَرَ  وَكَانَ مِنَ الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 35,
                        "text": "وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 36,
                        "text": "فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ​ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَلَـكُمۡ فِى الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ‏"
                    },
                    {
                        "num": 37,
                        "text": "فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ‏"
                    },
                    {
                        "num": 38,
                        "text": "قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا ​​ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏"
                    },
                    {
                        "num": 39,
                        "text": "وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 40,
                        "text": "يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيَّاىَ فَارۡهَبُوۡنِ‏"
                    },
                    {
                        "num": 41,
                        "text": "وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ​ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ‏"
                    },
                    {
                        "num": 42,
                        "text": "وَلَا تَلۡبِسُوا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 43,
                        "text": "وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 44,
                        "text": "اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ​ؕ اَفَلَا تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 45,
                        "text": "وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ​ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ‏"
                    },
                    {
                        "num": 47,
                        "text": "يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ​ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ‏"
                    },
                    {
                        "num": 50,
                        "text": "وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ‏"
                    },
                    {
                        "num": 51,
                        "text": "وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 52,
                        "text": "ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ‏"
                    },
                    {
                        "num": 53,
                        "text": "وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 54,
                        "text": "وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ‏"
                    },
                    {
                        "num": 55,
                        "text": "وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ‏"
                    },
                    {
                        "num": 56,
                        "text": "ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 57,
                        "text": "وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى​ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ​ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 58,
                        "text": "وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ​ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ‏"
                    },
                    {
                        "num": 59,
                        "text": "فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 60,
                        "text": "وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ​ؕ فَانۡفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا​ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ​ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 61,
                        "text": "وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا​ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ​ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ​ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ​ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ‏"
                    },
                    {
                        "num": 62,
                        "text": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏"
                    },
                    {
                        "num": 63,
                        "text": "وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ‏"
                    },
                    {
                        "num": 64,
                        "text": "ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ​​ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ‏"
                    },
                    {
                        "num": 65,
                        "text": "وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ ​ۚ‏"
                    },
                    {
                        "num": 66,
                        "text": "فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ‏"
                    },
                    {
                        "num": 67,
                        "text": "وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً ​ ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا ​ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ‏"
                    },
                    {
                        "num": 68,
                        "text": "قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ​ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ‏"
                    },
                    {
                        "num": 69,
                        "text": "قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 70,
                        "text": "قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَا ؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ‏"
                    },
                    {
                        "num": 71,
                        "text": "قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِى الۡحَـرۡثَ ​ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا ​ؕ قَالُوا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ​ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ‏"
                    },
                    {
                        "num": 72,
                        "text": "وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا ​ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ‏"
                    },
                    {
                        "num": 73,
                        "text": "فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا ​ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰى ۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 74,
                        "text": "ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً ​ ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 75,
                        "text": "اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 76,
                        "text": "وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّا  ۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَ تُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ​ؕ اَفَلَا تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 77,
                        "text": "اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 78,
                        "text": "وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ‏"
                    },
                    {
                        "num": 79,
                        "text": "فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًا ؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ‏"
                    },
                    {
                        "num": 80,
                        "text": "وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً ​ ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ​ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 81,
                        "text": "بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيْۤـــَٔتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 82,
                        "text": "وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَـنَّةِ ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 83,
                        "text": "وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ ؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡـتُمۡ مُّعۡرِضُوۡنَ‏"
                    },
                    {
                        "num": 84,
                        "text": "وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ‏"
                    },
                    {
                        "num": 85,
                        "text": "ثُمَّ اَنۡـتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ​​ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ​ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِى الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 86,
                        "text": "اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ​ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ‏"
                    },
                    {
                        "num": 87,
                        "text": "وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ​ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ​ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ‏"
                    },
                    {
                        "num": 88,
                        "text": "وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ​ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلًا مَّا يُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 89,
                        "text": "وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا  ​ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ​ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 90,
                        "text": "بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ​ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ‏ ﻿﻿"
                    },
                    {
                        "num": 91,
                        "text": "وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ​ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡـــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 92,
                        "text": "وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 93,
                        "text": "وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا ​ ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا  وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ ​ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 94,
                        "text": "قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 95,
                        "text": "وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 96,
                        "text": "وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍ  ۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا​​  ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَ لۡفَ سَنَةٍ ۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ ‏"
                    },
                    {
                        "num": 97,
                        "text": "قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 98,
                        "text": "مَنۡ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 99,
                        "text": "وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ​​ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ‏"
                    },
                    {
                        "num": 100,
                        "text": "اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ​ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 101,
                        "text": "وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 102,
                        "text": "وَاتَّبَعُوۡا مَا تَتۡلُوا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ​​ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ​ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ​ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ​ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ​ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ​ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ​ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 103,
                        "text": "وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌ ؕ​ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 104,
                        "text": "يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَاسۡمَعُوۡا ​ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ‏"
                    },
                    {
                        "num": 105,
                        "text": "مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ​ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ‏"
                    },
                    {
                        "num": 106,
                        "text": "مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا ​ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 107,
                        "text": "اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ‏"
                    },
                    {
                        "num": 108,
                        "text": "اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ​ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ‏ ﻿﻿"
                    },
                    {
                        "num": 109,
                        "text": "وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًا ۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ​ ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ ​ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 110,
                        "text": "وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ  ​ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 111,
                        "text": "وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى​ؕ تِلۡكَ اَمَانِيُّهُمۡ​ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 112,
                        "text": "بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏"
                    },
                    {
                        "num": 113,
                        "text": "وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕ كَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ​ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ‏"
                    },
                    {
                        "num": 114,
                        "text": "وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰـى فِىۡ خَرَابِهَا ​ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ ؕ لَهُمۡ فِى الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِى الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ‏"
                    },
                    {
                        "num": 115,
                        "text": "وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ​ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ​ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 116,
                        "text": "وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ​ سُبۡحٰنَهٗ ​ؕ بَل لَّهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلٌّ لَّهٗ قَانِتُوۡنَ‏"
                    },
                    {
                        "num": 117,
                        "text": "بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ‏"
                    },
                    {
                        "num": 118,
                        "text": "وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ ​ ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ​ تَشَابَهَتۡ قُلُوۡبُهُمۡ​ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ‏"
                    },
                    {
                        "num": 119,
                        "text": "اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًا ۙ​ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ‏"
                    },
                    {
                        "num": 120,
                        "text": "وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ​ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى​ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ​ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ‏ ﻿﻿"
                    },
                    {
                        "num": 121,
                        "text": "اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ​ ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ‏"
                    },
                    {
                        "num": 122,
                        "text": "يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 123,
                        "text": "وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ‏"
                    },
                    {
                        "num": 124,
                        "text": "وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ ​ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا ​ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ ​ؕ قَالَ لَا يَنَالُ عَهۡدِى الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 125,
                        "text": "وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًا ؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى​ ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ‏ ﻿﻿"
                    },
                    {
                        "num": 126,
                        "text": "وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ​ؕ وَبِئۡسَ الۡمَصِيۡرُ‏‏"
                    },
                    {
                        "num": 127,
                        "text": "وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا ​ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ‏"
                    },
                    {
                        "num": 128,
                        "text": "رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَا ۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ‏ ﻿﻿"
                    },
                    {
                        "num": 129,
                        "text": "رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ​ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 130,
                        "text": "وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ ​ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِى الدُّنۡيَا ​ۚ وَاِنَّهٗ فِى الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 131,
                        "text": "اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ​ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 132,
                        "text": "وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَؕ‏‏ ﻿﻿"
                    },
                    {
                        "num": 133,
                        "text": "اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًا ۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 134,
                        "text": "تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 135,
                        "text": "وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا ​ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا ​ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ‏"
                    },
                    {
                        "num": 136,
                        "text": "قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسٰى وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ​ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 137,
                        "text": "فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ​ ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ ​ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ‏"
                    },
                    {
                        "num": 138,
                        "text": "صِبۡغَةَ اللّٰهِ ​ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً  وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ‏"
                    },
                    {
                        "num": 139,
                        "text": "قُلۡ اَ تُحَآجُّوۡنَـنَا فِى اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ‏"
                    },
                    {
                        "num": 140,
                        "text": "اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى​ؕ قُلۡ ءَاَنۡـتُمۡ اَعۡلَمُ اَمِ اللّٰهُ​ ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 141,
                        "text": "تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ‏"
                    }
                ]
            }
        ]
    },
    "2": {
        "name": "Juz 2",
        "surahs": [
            {
                "surah": "Al-Baqarah",
                "number": 2,
                "ayahs": [
                    {
                        "num": 142,
                        "text": "سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا ​ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ ؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ‏"
                    },
                    {
                        "num": 143,
                        "text": "وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًا ؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ ​ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُ ؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ​ ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 144,
                        "text": "قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِى السَّمَآءِ​​ۚ فَلَـنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا​ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ ​ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ لَيَـعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 145,
                        "text": "وَلَٮِٕنۡ اَ تَيۡتَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ​ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ​ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ​ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ​ۘ‏"
                    },
                    {
                        "num": 146,
                        "text": "اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 147,
                        "text": "اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ‏"
                    },
                    {
                        "num": 148,
                        "text": "وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا ​ۚ فَاسۡتَبِقُوا الۡخَيۡرٰتِؕ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًا ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 149,
                        "text": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 150,
                        "text": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗ ۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَ ۙ​ۛ‏"
                    },
                    {
                        "num": 151,
                        "text": "كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ ؕ​ۛ‏"
                    },
                    {
                        "num": 152,
                        "text": "فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ‏"
                    },
                    {
                        "num": 153,
                        "text": "يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ‏"
                    },
                    {
                        "num": 154,
                        "text": "وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتٌ ؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ‏"
                    },
                    {
                        "num": 155,
                        "text": "وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ‏"
                    },
                    {
                        "num": 156,
                        "text": "الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌ  ۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ‏"
                    },
                    {
                        "num": 157,
                        "text": "اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ‏"
                    },
                    {
                        "num": 158,
                        "text": "اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَا ؕ وَمَنۡ تَطَوَّعَ خَيۡرًا ۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 159,
                        "text": "اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِى الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ‏"
                    },
                    {
                        "num": 160,
                        "text": "اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّـنُوۡا فَاُولٰٓٮِٕكَ اَ تُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ‏"
                    },
                    {
                        "num": 161,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ‏"
                    },
                    {
                        "num": 162,
                        "text": "خٰلِدِيۡنَ فِيۡهَا ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 163,
                        "text": "وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌ  ۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ‏ ﻿﻿"
                    },
                    {
                        "num": 164,
                        "text": "اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِى الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآ بَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 165,
                        "text": "وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلّٰهِ ؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًا ۙ وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ‏"
                    },
                    {
                        "num": 166,
                        "text": "اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ‏"
                    },
                    {
                        "num": 167,
                        "text": "وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّا ؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخٰرِجِيۡنَ مِنَ النَّارِ‏"
                    },
                    {
                        "num": 168,
                        "text": "يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِى الۡاَرۡضِ حَلٰلًا طَيِّبًا  ۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ‏"
                    },
                    {
                        "num": 169,
                        "text": "اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 170,
                        "text": "وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَـتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ‏"
                    },
                    {
                        "num": 171,
                        "text": "وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءً ؕ صُمٌّۢ بُكۡمٌ عُمۡـىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 172,
                        "text": "يٰٓاَ يُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ‏"
                    },
                    {
                        "num": 173,
                        "text": "اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ​ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 174,
                        "text": "اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًا ۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡ ۖۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ‏"
                    },
                    {
                        "num": 175,
                        "text": "اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ​ ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ‏"
                    },
                    {
                        "num": 176,
                        "text": "ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِى الۡكِتٰبِ لَفِىۡ شِقَاقٍۢ بَعِيۡدٍ‏"
                    },
                    {
                        "num": 177,
                        "text": "لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ​ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِى الرِّقَابِ​ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ ​ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡا ۚ وَالصّٰبِرِيۡنَ فِى الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡا ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ‏"
                    },
                    {
                        "num": 178,
                        "text": "يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِى الۡقَتۡلٰى  ؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌ  ؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ‏"
                    },
                    {
                        "num": 179,
                        "text": "وَ لَـكُمۡ فِى الۡقِصَاصِ حَيٰوةٌ يّٰٓـاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 180,
                        "text": "كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَا  ۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَؕ‏ ﻿﻿"
                    },
                    {
                        "num": 181,
                        "text": "فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ‏"
                    },
                    {
                        "num": 182,
                        "text": "فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 183,
                        "text": "يٰٓـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ‏"
                    },
                    {
                        "num": 184,
                        "text": "اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ​ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗ ؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 185,
                        "text": "شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَـصُمۡهُ ؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوا الۡعِدَّةَ وَلِتُکَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ‏"
                    },
                    {
                        "num": 186,
                        "text": "وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ‏"
                    },
                    {
                        "num": 187,
                        "text": "اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ​ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡـتُمۡ لِبَاسٌ لَّهُنَّ ؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـــٰٔنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ​ؕ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيۡلِ​ۚ وَلَا تُبَاشِرُوۡهُنَّ وَاَنۡـتُمۡ عٰكِفُوۡنَ فِى الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَا ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ‏"
                    },
                    {
                        "num": 188,
                        "text": "وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُـکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 189,
                        "text": "يَسۡـــَٔلُوۡنَكَ عَنِ الۡاَهِلَّةِ ​ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى​ۚ وَاۡتُوا الۡبُيُوۡتَ مِنۡ اَبۡوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ‏‏‏"
                    },
                    {
                        "num": 190,
                        "text": "وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ‏"
                    },
                    {
                        "num": 191,
                        "text": "وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ​ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ​ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 192,
                        "text": "فَاِنِ انۡـتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 193,
                        "text": "وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ​ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 194,
                        "text": "اَلشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ​ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ‏"
                    },
                    {
                        "num": 195,
                        "text": "وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ ۖ  ۛۚ وَاَحۡسِنُوۡا  ۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ‏"
                    },
                    {
                        "num": 196,
                        "text": "وَاَتِمُّوا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗ ؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِى الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌ  ؕ ذٰ لِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ‏"
                    },
                    {
                        "num": 197,
                        "text": "اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ ​ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِى الۡحَجِّ ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ ​ؕ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِى الۡاَلۡبَابِ‏"
                    },
                    {
                        "num": 198,
                        "text": "​لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ​ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآ لِّيۡنَ‏"
                    },
                    {
                        "num": 199,
                        "text": "ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 200,
                        "text": " فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا وَمَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ‏"
                    },
                    {
                        "num": 201,
                        "text": "وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا حَسَنَةً وَّفِى الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ‏"
                    },
                    {
                        "num": 202,
                        "text": "اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ‏ ﻿﻿"
                    },
                    {
                        "num": 203,
                        "text": "وَاذۡكُرُوا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ​ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِ ۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه​ِ ۙ لِمَنِ اتَّقٰى ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ‏"
                    },
                    {
                        "num": 204,
                        "text": "وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِى الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ‏"
                    },
                    {
                        "num": 205,
                        "text": "وَاِذَا تَوَلّٰى سَعٰى فِى الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ​ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ‏"
                    },
                    {
                        "num": 206,
                        "text": "وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ​ فَحَسۡبُهٗ جَهَنَّمُ​ؕ وَلَبِئۡسَ الۡمِهَادُ‏"
                    },
                    {
                        "num": 207,
                        "text": "وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ​ؕ وَ اللّٰهُ رَءُوۡفٌ ۢ بِالۡعِبَادِ‏"
                    },
                    {
                        "num": 208,
                        "text": "يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا ادۡخُلُوۡا فِى السِّلۡمِ کَآفَّةً  وَلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ​ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ‏"
                    },
                    {
                        "num": 209,
                        "text": "فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ‏"
                    },
                    {
                        "num": 210,
                        "text": "هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ‏"
                    },
                    {
                        "num": 211,
                        "text": "سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ ​ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ‏"
                    },
                    {
                        "num": 212,
                        "text": "زُيِّنَ لِلَّذِيۡنَ كَفَرُوا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا ​ ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِ ؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ‏"
                    },
                    {
                        "num": 213,
                        "text": "كَانَ النَّاسُ اُمَّةً وَّاحِدَةً  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ ​ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًا ۢ بَيۡنَهُمۡ​ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ​ ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ‏"
                    },
                    {
                        "num": 214,
                        "text": "اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ‏"
                    },
                    {
                        "num": 215,
                        "text": "يَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَ ؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ​ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 216,
                        "text": "كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ​ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـــًٔا وَّهُوَ خَيۡرٌ لَّـکُمۡ​ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـــًٔا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 217,
                        "text": "يَسۡـــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ​ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ ​ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌ ۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ ​​ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ​ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡـنِکُمۡ اِنِ اسۡتَطَاعُوۡا ​ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡـنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ ​​ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 218,
                        "text": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 219,
                        "text": "يَسۡـــَٔلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ​ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَا ؕ وَيَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ  قُلِ الۡعَفۡوَ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ‏"
                    },
                    {
                        "num": 220,
                        "text": "فِى الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـــَٔلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌ ؕ وَاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ​ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ​ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ‏"
                    },
                    {
                        "num": 221,
                        "text": "وَلَا تَنۡكِحُوا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ​ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ​ۚ وَلَا تُنۡكِحُوا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا ​ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡؕ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِ  ۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ​ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ ‏"
                    },
                    {
                        "num": 222,
                        "text": "وَ يَسۡـــَٔلُوۡنَكَ عَنِ الۡمَحِيۡضِ​ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِى الۡمَحِيۡضِ​ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ​​ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ​ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ‏"
                    },
                    {
                        "num": 223,
                        "text": "نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ​  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ ​ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 224,
                        "text": "وَلَا تَجۡعَلُوا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 225,
                        "text": "لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ‏"
                    },
                    {
                        "num": 226,
                        "text": "لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ​​ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 227,
                        "text": "وَاِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 228,
                        "text": "وَالۡمُطَلَّقٰتُ يَتَرَ بَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ ​ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰ لِكَ اِنۡ اَرَادُوۡٓا اِصۡلَاحًا ​ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ​ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ ​ ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 229,
                        "text": "اَلطَّلَاقُ مَرَّتٰنِ​ فَاِمۡسَاكٌ ۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌ ۢ بِاِحۡسَانٍ​ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـــًٔا اِلَّاۤ اَنۡ يَّخَافَآ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ فَاِنۡ خِفۡتُمۡ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ​ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا ​ۚ​ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 230,
                        "text": "فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ ​ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 231,
                        "text": "وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ​ وَلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا​ ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ ​ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا​ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 232,
                        "text": "وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَاضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ​ؕ ذٰ لِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰ لِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ​ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 233,
                        "text": "وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ​ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ ​ ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ​ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَا ۚ لَا تُضَآرَّ وَالِدَةٌ ۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰ لِكَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا ​ؕ وَاِنۡ اَرَدْتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 234,
                        "text": "وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا ​​ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 235,
                        "text": "وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ​ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا ​ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ‏"
                    },
                    {
                        "num": 236,
                        "text": "لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةً  ۖۚ وَّمَتِّعُوۡهُنَّ ​ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ ​ۚ مَتَاعًا ۢ بِالۡمَعۡرُوۡفِ​​ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 237,
                        "text": "وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ ​ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى​ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 238,
                        "text": "حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ‏"
                    },
                    {
                        "num": 239,
                        "text": "فَاِنۡ خِفۡتُمۡ فَرِجَالًا اَوۡ رُكۡبَانًا ​​ ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 240,
                        "text": "وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا  ۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ​​ ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ‏"
                    },
                    {
                        "num": 241,
                        "text": "وَلِلۡمُطَلَّقٰتِ مَتَاعٌ ۢ بِالۡمَعۡرُوۡفِ ​ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 242,
                        "text": "كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 243,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ​ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ‏"
                    },
                    {
                        "num": 244,
                        "text": "وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 245,
                        "text": "مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً  ​ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ‏"
                    },
                    {
                        "num": 246,
                        "text": "اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى​ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ​ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا ​ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 247,
                        "text": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا ​ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ​ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِى الۡعِلۡمِ وَ الۡجِسۡمِ​ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 248,
                        "text": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ​ ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 249,
                        "text": "فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ​ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ​ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةً ۢ بِيَدِهٖ​​ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ ۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ​ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةً ۢ بِاِذۡنِ اللّٰهِ​ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ‏"
                    },
                    {
                        "num": 250,
                        "text": "وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ‏"
                    },
                    {
                        "num": 251,
                        "text": "فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِ ۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ ​ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 252,
                        "text": "تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ‏"
                    }
                ]
            }
        ]
    },
    "3": {
        "name": "Juz 3",
        "surahs": [
            {
                "surah": "Al-Baqarah",
                "number": 2,
                "ayahs": [
                    {
                        "num": 253,
                        "text": "تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ​ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ​ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ​ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ‏"
                    },
                    {
                        "num": 254,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ ​ ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 255,
                        "text": "اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ​ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ​ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ​ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ​​ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ​ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ‏"
                    },
                    {
                        "num": 256,
                        "text": "لَاۤ اِكۡرَاهَ فِى الدِّيۡنِ​ۙ  قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ​ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا​​ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 257,
                        "text": "اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ  وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓـــُٔهُمُ الطَّاغُوۡتُۙ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ​ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 258,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ​ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ​ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 259,
                        "text": "اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا ​ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا ​ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ​ؕ قَالَ كَمۡ لَبِثۡتَ​ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ​ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَةَ عَامٍ فَانۡظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ​ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ​ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا ​ؕ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 260,
                        "text": "وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰى ؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ​ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ​ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا ​ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ‏"
                    },
                    {
                        "num": 261,
                        "text": "مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 262,
                        "text": "اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏"
                    },
                    {
                        "num": 263,
                        "text": "قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ‏"
                    },
                    {
                        "num": 264,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 265,
                        "text": "وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 266,
                        "text": "اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُ ۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ‏"
                    },
                    {
                        "num": 267,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ​ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ‏"
                    },
                    {
                        "num": 268,
                        "text": "اَلشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ​ ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًا ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌۚ  ۙۖ‏"
                    },
                    {
                        "num": 269,
                        "text": "يُؤۡتِى الۡحِكۡمَةَ مَنۡ يَّشَآءُ​​ ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا​ ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ‏"
                    },
                    {
                        "num": 270,
                        "text": "وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ‏"
                    },
                    {
                        "num": 271,
                        "text": "اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 272,
                        "text": "لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 273,
                        "text": "لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 274,
                        "text": "اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 275,
                        "text": "اَلَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا​ ۘ​ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا​ ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَؕ وَاَمۡرُهٗۤ اِلَى اللّٰهِ​ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 276,
                        "text": "يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ‏"
                    },
                    {
                        "num": 277,
                        "text": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ‏"
                    },
                    {
                        "num": 278,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 279,
                        "text": "فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ​ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ​ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 280,
                        "text": "وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 281,
                        "text": "وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 282,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ ​ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ​ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ​ فَلۡيَكۡتُبۡ ​ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـــًٔا ​ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ​ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ​ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى​ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا ​ؕ وَلَا تَسۡـــَٔمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ​ؕ ذٰ لِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهَادَةِ وَاَدۡنٰۤى اَلَّا تَرۡتَابُوۡٓا اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا ​ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ  ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌ ۢ بِكُمۡ ؕ وَ اتَّقُوا اللّٰهَ​ ؕ وَيُعَلِّمُكُمُ اللّٰهُ​ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 283,
                        "text": "وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ ​ ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِى اؤۡتُمِنَ اَمَانَـتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ​ؕ وَلَا تَكۡتُمُوا الشَّهَادَةَ ​ ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 284,
                        "text": "لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ​ؕ فَيَـغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 285,
                        "text": "اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ​ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ​ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا​ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 286,
                        "text": "لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ​ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ​ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ​ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ​​ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ​ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "Ali 'Imran",
                "number": 3,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "الٓمّٓ ۚۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَۙ الۡحَىُّ الۡقَيُّوۡمُؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "نَزَّلَ عَلَيۡكَ الۡـكِتٰبَ بِالۡحَقِّ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَاَنۡزَلَ التَّوۡرٰٮةَ وَالۡاِنۡجِيۡلَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "مِنۡ قَبۡلُ هُدًى لِّلنَّاسِ وَاَنۡزَلَ الۡفُرۡقَانَ  ؕ​ اِنَّ الَّذِيۡنَ كَفَرُوۡا بِاٰيٰتِ اللّٰهِ لَهُمۡ عَذَابٌ شَدِيۡدٌ  ​ؕ وَاللّٰهُ عَزِيۡزٌ ذُو انۡتِقَامٍؕ‏ ﻿﻿"
                    },
                    {
                        "num": 5,
                        "text": "اِنَّ اللّٰهَ لَا يَخۡفٰى عَلَيۡهِ شَىۡءٌ فِى الۡاَرۡضِ وَلَا فِى السَّمَآءِ ؕ‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "هُوَ الَّذِىۡ يُصَوِّرُكُمۡ فِى الۡاَرۡحَامِ كَيۡفَ يَشَآءُ ​ؕ لَاۤ اِلٰهَ اِلَّا هُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 7,
                        "text": "هُوَ الَّذِىۡۤ اَنۡزَلَ عَلَيۡكَ الۡكِتٰبَ مِنۡهُ اٰيٰتٌ مُّحۡكَمٰتٌ هُنَّ اُمُّ الۡكِتٰبِ وَاُخَرُ مُتَشٰبِهٰتٌ​ؕ فَاَمَّا الَّذِيۡنَ فِىۡ قُلُوۡبِهِمۡ زَيۡغٌ فَيَتَّبِعُوۡنَ مَا تَشَابَهَ مِنۡهُ ابۡتِغَآءَ الۡفِتۡنَةِ وَابۡتِغَآءَ تَاۡوِيۡلِهٖۚ وَمَا يَعۡلَمُ تَاۡوِيۡلَهٗۤ اِلَّا اللّٰهُ ​ۘ وَ الرّٰسِخُوۡنَ فِى الۡعِلۡمِ يَقُوۡلُوۡنَ اٰمَنَّا بِهٖۙ كُلٌّ مِّنۡ عِنۡدِ رَبِّنَا ​ۚ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ‏ ﻿﻿"
                    },
                    {
                        "num": 8,
                        "text": "رَبَّنَا لَا تُزِغۡ قُلُوۡبَنَا بَعۡدَ اِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِنۡ لَّدُنۡكَ رَحۡمَةً ​ ۚ اِنَّكَ اَنۡتَ الۡوَهَّابُ‏"
                    },
                    {
                        "num": 9,
                        "text": "رَبَّنَاۤ اِنَّكَ جَامِعُ النَّاسِ لِيَوۡمٍ لَّا رَيۡبَ فِيۡهِ​ؕ اِنَّ اللّٰهَ لَا يُخۡلِفُ الۡمِيۡعَادَ‏"
                    },
                    {
                        "num": 10,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا لَنۡ تُغۡنِىَ عَنۡهُمۡ اَمۡوَالُهُمۡ وَلَاۤ اَوۡلَادُهُمۡ مِّنَ اللّٰهِ شَيۡـــًٔا​ ؕ وَاُولٰٓٮِٕكَ هُمۡ وَقُوۡدُ النَّارِۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "كَدَاۡبِ اٰلِ فِرۡعَوۡنَۙ وَالَّذِيۡنَ مِنۡ قَبۡلِهِمۡ​ؕ كَذَّبُوۡا بِاٰيٰتِنَا ​ۚ فَاَخَذَهُمُ اللّٰهُ بِذُنُوۡبِهِمۡ​ؕ وَاللّٰهُ شَدِيۡدُ الۡعِقَابِ‏"
                    },
                    {
                        "num": 12,
                        "text": "قُلۡ لِّلَّذِيۡنَ كَفَرُوۡا سَتُغۡلَبُوۡنَ وَتُحۡشَرُوۡنَ اِلٰى جَهَنَّمَ​ؕ وَبِئۡسَ الۡمِهَادُ‏"
                    },
                    {
                        "num": 13,
                        "text": "قَدۡ كَانَ لَـكُمۡ اٰيَةٌ فِىۡ فِئَتَيۡنِ الۡتَقَتَا ؕ فِئَةٌ تُقَاتِلُ فِىۡ سَبِيۡلِ اللّٰهِ وَاُخۡرٰى كَافِرَةٌ يَّرَوۡنَهُمۡ مِّثۡلَيۡهِمۡ رَاۡىَ الۡعَيۡنِ​ؕ وَاللّٰهُ يُؤَيِّدُ بِنَصۡرِهٖ مَنۡ يَّشَآءُ  ​ؕ اِنَّ فِىۡ ذٰ لِكَ لَعِبۡرَةً لِّاُولِى الۡاَبۡصَارِ‏"
                    },
                    {
                        "num": 14,
                        "text": "زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوٰتِ مِنَ النِّسَآءِ وَالۡبَـنِيۡنَ وَالۡقَنَاطِيۡرِ الۡمُقَنۡطَرَةِ مِنَ الذَّهَبِ وَالۡفِضَّةِ وَالۡخَـيۡلِ الۡمُسَوَّمَةِ وَالۡاَنۡعَامِ وَالۡحَـرۡثِ​ؕ ذٰ لِكَ مَتَاعُ الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَاللّٰهُ عِنۡدَهٗ حُسۡنُ الۡمَاٰبِ‏"
                    },
                    {
                        "num": 15,
                        "text": "قُلۡ اَؤُنَبِّئُكُمۡ بِخَيۡرٍ مِّنۡ ذٰ لِكُمۡ​ؕ لِلَّذِيۡنَ اتَّقَوۡا عِنۡدَ رَبِّهِمۡ جَنّٰتٌ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا وَاَزۡوَاجٌ مُّطَهَّرَةٌ وَّرِضۡوَانٌ مِّنَ اللّٰهِ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِالۡعِبَادِ​ۚ‏"
                    },
                    {
                        "num": 16,
                        "text": "اَلَّذِيۡنَ يَقُوۡلُوۡنَ رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَقِنَا عَذَابَ النَّارِ​ۚ‏"
                    },
                    {
                        "num": 17,
                        "text": "اَلصّٰــبِرِيۡنَ وَالصّٰدِقِــيۡنَ وَالۡقٰنِتِــيۡنَ وَالۡمُنۡفِقِيۡنَ وَالۡمُسۡتَغۡفِرِيۡنَ بِالۡاَسۡحَارِ‏"
                    },
                    {
                        "num": 18,
                        "text": "شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَۙ وَالۡمَلٰٓٮِٕكَةُ وَاُولُوا الۡعِلۡمِ قَآٮِٕمًا ۢ بِالۡقِسۡطِ​ؕ لَاۤ اِلٰهَ اِلَّا هُوَ الۡعَزِيۡزُ الۡحَكِيۡمُؕ‏ ﻿﻿"
                    },
                    {
                        "num": 19,
                        "text": "اِنَّ الدِّيۡنَ عِنۡدَ اللّٰهِ الۡاِسۡلَامُ وَمَا اخۡتَلَفَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ اِلَّا مِنۡۢ بَعۡدِ مَا جَآءَهُمُ الۡعِلۡمُ بَغۡيًا ۢ بَيۡنَهُمۡ​ؕ وَمَنۡ يَّكۡفُرۡ بِاٰيٰتِ اللّٰهِ فَاِنَّ اللّٰهَ سَرِيۡعُ الۡحِسَابِ‏"
                    },
                    {
                        "num": 20,
                        "text": "فَاِنۡ حَآجُّوۡكَ فَقُلۡ اَسۡلَمۡتُ وَجۡهِىَ لِلّٰهِ وَمَنِ اتَّبَعَنِ​ؕ وَقُل لِّلَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ وَالۡاُمِّيّٖنَ ءَاَسۡلَمۡتُمۡ​ؕ فَاِنۡ اَسۡلَمُوۡا فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا عَلَيۡكَ الۡبَلٰغُ ​ ؕ وَاللّٰهُ بَصِيۡرٌۢ بِالۡعِبَادِ‏"
                    },
                    {
                        "num": 21,
                        "text": "اِنَّ الَّذِيۡنَ يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ حَقٍّۙ وَّيَقۡتُلُوۡنَ الَّذِيۡنَ يَاۡمُرُوۡنَ بِالۡقِسۡطِ مِنَ النَّاسِۙ فَبَشِّرۡهُمۡ بِعَذَابٍ اَ لِيۡمٍ‏"
                    },
                    {
                        "num": 22,
                        "text": "اُولٰٓٮِٕكَ الَّذِيۡنَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ وَمَا لَهُمۡ مِّنۡ نّٰصِرِيۡنَ‏"
                    },
                    {
                        "num": 23,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِيۡنَ اُوۡتُوۡا نَصِيۡبًا مِّنَ الۡكِتٰبِ يُدۡعَوۡنَ اِلٰى كِتٰبِ اللّٰهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلّٰى فَرِيۡقٌ مِّنۡهُمۡ وَهُمۡ مُّعۡرِضُوۡنَ‏"
                    },
                    {
                        "num": 24,
                        "text": "ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدٰتٍ​ وَغَرَّهُمۡ فِىۡ دِيۡنِهِمۡ مَّا كَانُوۡا يَفۡتَرُوۡنَ‏"
                    },
                    {
                        "num": 25,
                        "text": "فَكَيۡفَ اِذَا جَمَعۡنٰهُمۡ لِيَوۡمٍ لَّا رَيۡبَ فِيۡهِ وَوُفِّيَتۡ كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 26,
                        "text": "قُلِ اللّٰهُمَّ مٰلِكَ الۡمُلۡكِ تُؤۡتِى الۡمُلۡكَ مَنۡ تَشَآءُ وَتَنۡزِعُ الۡمُلۡكَ مِمَّنۡ تَشَآءُ وَتُعِزُّ مَنۡ تَشَآءُ وَتُذِلُّ مَنۡ تَشَآءُ​ ؕ بِيَدِكَ الۡخَيۡرُ​ؕ اِنَّكَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 27,
                        "text": "تُوۡلِجُ الَّيۡلَ فِى النَّهَارِ وَتُوۡلِجُ النَّهَارَ فِى الَّيۡلِ​ وَتُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَتُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ​ وَتَرۡزُقُ مَنۡ تَشَآءُ بِغَيۡرِ حِسَابٍ‏"
                    },
                    {
                        "num": 28,
                        "text": "لَا يَتَّخِذِ الۡمُؤۡمِنُوۡنَ الۡكٰفِرِيۡنَ اَوۡلِيَآءَ مِنۡ دُوۡنِ الۡمُؤۡمِنِيۡنَ​ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَلَيۡسَ مِنَ اللّٰهِ فِىۡ شَىۡءٍ اِلَّاۤ اَنۡ تَتَّقُوۡا مِنۡهُمۡ تُقٰٮةً  ؕ وَيُحَذِّرُكُمُ اللّٰهُ نَفۡسَهٗ​ ؕوَاِلَى اللّٰهِ الۡمَصِيۡرُ‏ ﻿﻿"
                    },
                    {
                        "num": 29,
                        "text": "قُلۡ اِنۡ تُخۡفُوۡا مَا فِىۡ صُدُوۡرِكُمۡ اَوۡ تُبۡدُوۡهُ يَعۡلَمۡهُ اللّٰهُ​ؕ وَيَعۡلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِؕ​ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 30,
                        "text": "يَوۡمَ تَجِدُ كُلُّ نَفۡسٍ مَّا عَمِلَتۡ مِنۡ خَيۡرٍ مُّحۡضَرًا ۖۚ ۛ وَّمَا عَمِلَتۡ مِنۡ سُوۡٓءٍ ۚۛ  تَوَدُّ لَوۡ اَنَّ بَيۡنَهَا وَبَيۡنَهٗۤ اَمَدًاۢ بَعِيۡدًا ​ؕ وَيُحَذِّرُكُمُ اللّٰهُ نَفۡسَهٗ​ؕ وَاللّٰهُ رَءُوۡفٌۢ بِالۡعِبَادِ ‏"
                    },
                    {
                        "num": 31,
                        "text": "قُلۡ اِنۡ كُنۡتُمۡ تُحِبُّوۡنَ اللّٰهَ فَاتَّبِعُوۡنِىۡ يُحۡبِبۡكُمُ اللّٰهُ وَيَغۡفِرۡ لَـكُمۡ ذُنُوۡبَكُمۡؕ​ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 32,
                        "text": "قُلۡ اَطِيۡعُوا اللّٰهَ وَالرَّسُوۡلَ​​ ۚ فَاِنۡ تَوَلَّوۡا فَاِنَّ اللّٰهَ لَا يُحِبُّ الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 33,
                        "text": "اِنَّ اللّٰهَ اصۡطَفٰۤى اٰدَمَ وَنُوۡحًا وَّاٰلَ اِبۡرٰهِيۡمَ وَاٰلَ عِمۡرٰنَ عَلَى الۡعٰلَمِيۡنَۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "ذُرِّيَّةًۢ بَعۡضُهَا مِنۡۢ بَعۡضٍ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ​ۚ‏"
                    },
                    {
                        "num": 35,
                        "text": "اِذۡ قَالَتِ امۡرَاَتُ عِمۡرٰنَ رَبِّ اِنِّىۡ نَذَرۡتُ لَـكَ مَا فِىۡ بَطۡنِىۡ مُحَرَّرًا فَتَقَبَّلۡ مِنِّىۡ ۚ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ​‏"
                    },
                    {
                        "num": 36,
                        "text": "فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ اِنِّىۡ وَضَعۡتُهَاۤ اُنۡثٰىؕ وَاللّٰهُ اَعۡلَمُ بِمَا وَضَعَتۡؕ وَ لَيۡسَ الذَّكَرُ كَالۡاُنۡثٰى​​ۚ وَاِنِّىۡ سَمَّيۡتُهَا مَرۡيَمَ وَاِنِّىۡۤ اُعِيۡذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيۡطٰنِ الرَّجِيۡمِ‏ ﻿﻿"
                    },
                    {
                        "num": 37,
                        "text": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُوۡلٍ حَسَنٍ وَّاَنۡۢبَتَهَا نَبَاتًا حَسَنًا ۙ وَّكَفَّلَهَا زَكَرِيَّا ​ؕ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا الۡمِحۡرَابَۙ وَجَدَ عِنۡدَهَا رِزۡقًا ​ۚ​ قَالَ يٰمَرۡيَمُ اَنّٰى لَـكِ هٰذَا ؕ​ قَالَتۡ هُوَ مِنۡ عِنۡدِ اللّٰهِ​ؕ اِنَّ اللّٰهَ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ‏"
                    },
                    {
                        "num": 38,
                        "text": "هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهٗ​ ​ۚ قَالَ رَبِّ هَبۡ لِىۡ مِنۡ لَّدُنۡكَ ذُرِّيَّةً طَيِّبَةً​ ​ ۚ اِنَّكَ سَمِيۡعُ الدُّعَآءِ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَنَادَتۡهُ الۡمَلٰٓٮِٕكَةُ وَهُوَ قَآٮِٕمٌ يُّصَلِّىۡ فِى الۡمِحۡرَابِۙ اَنَّ اللّٰهَ يُبَشِّرُكَ بِيَحۡيٰى مُصَدِّقًۢا بِكَلِمَةٍ مِّنَ اللّٰهِ وَسَيِّدًا وَّحَصُوۡرًا وَّنَبِيًّا مِّنَ الصّٰلِحِيۡنَ‏"
                    },
                    {
                        "num": 40,
                        "text": "قَالَ رَبِّ اَنّٰى يَكُوۡنُ لِىۡ غُلٰمٌ وَّقَدۡ بَلَغَنِىَ الۡكِبَرُ وَامۡرَاَتِىۡ عَاقِرٌ​ؕ قَالَ كَذٰلِكَ اللّٰهُ يَفۡعَلُ مَا يَشَآءُ‏"
                    },
                    {
                        "num": 41,
                        "text": "قَالَ رَبِّ اجۡعَلۡ لِّىۡۤ اٰيَةً ​ؕ قَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَةَ اَيَّامٍ اِلَّا رَمۡزًا ؕ​ وَاذۡكُرْ رَّبَّكَ كَثِيۡرًا وَّسَبِّحۡ بِالۡعَشِىِّ وَالۡاِبۡكَارِ‏"
                    },
                    {
                        "num": 42,
                        "text": "وَاِذۡ قَالَتِ الۡمَلٰٓٮِٕكَةُ يٰمَرۡيَمُ اِنَّ اللّٰهَ اصۡطَفٰٮكِ وَطَهَّرَكِ وَاصۡطَفٰٮكِ عَلٰى نِسَآءِ الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 43,
                        "text": "يٰمَرۡيَمُ اقۡنُتِىۡ لِرَبِّكِ وَاسۡجُدِىۡ وَارۡكَعِىۡ مَعَ الرّٰكِعِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 44,
                        "text": "ذٰ لِكَ مِنۡ اَنۡۢـبَآءِ الۡغَيۡبِ نُوۡحِيۡهِ اِلَيۡكَ​ؕ وَمَا كُنۡتَ لَدَيۡهِمۡ اِذۡ يُلۡقُوۡنَ اَقۡلَامَهُمۡ اَيُّهُمۡ يَكۡفُلُ مَرۡيَمَ وَمَا كُنۡتَ لَدَيۡهِمۡ اِذۡ يَخۡتَصِمُوۡنَ‏"
                    },
                    {
                        "num": 45,
                        "text": "اِذۡ قَالَتِ الۡمَلٰٓٮِٕكَةُ يٰمَرۡيَمُ اِنَّ اللّٰهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنۡهُ ۖ اسۡمُهُ الۡمَسِيۡحُ عِيۡسَى ابۡنُ مَرۡيَمَ وَجِيۡهًا فِى الدُّنۡيَا وَالۡاٰخِرَةِ وَمِنَ الۡمُقَرَّبِيۡنَۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "وَيُكَلِّمُ النَّاسَ فِى الۡمَهۡدِ وَكَهۡلًا وَّمِنَ الصّٰلِحِيۡنَ‏"
                    },
                    {
                        "num": 47,
                        "text": "قَالَتۡ رَبِّ اَنّٰى يَكُوۡنُ لِىۡ وَلَدٌ وَّلَمۡ يَمۡسَسۡنِىۡ بَشَرٌ ​ؕ قَالَ كَذٰلِكِ اللّٰهُ يَخۡلُقُ مَا يَشَآءُ​ ؕ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَيُعَلِّمُهُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَالتَّوۡرٰٮةَ وَالۡاِنۡجِيۡلَ​ۚ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَرَسُوۡلًا اِلٰى بَنِىۡۤ اِسۡرٰٓءِيۡلَ ۙ اَنِّىۡ قَدۡ جِئۡتُكُمۡ بِاٰيَةٍ مِّنۡ رَّبِّكُمۡ ۙۚ اَنِّىۡۤ  اَخۡلُقُ لَـكُمۡ مِّنَ الطِّيۡنِ كَهَیْـــَٔةِ الطَّيۡرِ فَاَنۡفُخُ فِيۡهِ فَيَكُوۡنُ طَيۡرًاۢ بِاِذۡنِ اللّٰهِ​​ۚ وَاُبۡرِئُ الۡاَكۡمَهَ وَالۡاَبۡرَصَ وَاُحۡىِ الۡمَوۡتٰى بِاِذۡنِ اللّٰهِ​ۚ وَ اُنَبِّئُكُمۡ بِمَا تَاۡكُلُوۡنَ وَمَا تَدَّخِرُوۡنَۙ فِىۡ بُيُوۡتِكُمۡ​ؕ اِنَّ فِىۡ ذٰ لِكَ لَاٰيَةً لَّـكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَۚ‏"
                    },
                    {
                        "num": 50,
                        "text": "وَمُصَدِّقًا لِّمَا بَيۡنَ يَدَىَّ مِنَ التَّوۡرٰٮةِ وَلِاُحِلَّ لَـكُمۡ بَعۡضَ الَّذِىۡ حُرِّمَ عَلَيۡكُمۡ​وَجِئۡتُكُمۡ بِاٰيَةٍ مِّنۡ رَّبِّكُمۡ فَاتَّقُوۡا اللّٰهَ وَاَطِيۡعُوۡنِ‏"
                    },
                    {
                        "num": 51,
                        "text": "اِنَّ اللّٰهَ رَبِّىۡ وَرَبُّكُمۡ فَاعۡبُدُوۡهُ​ ؕ هٰذَا صِرَاطٌ مُّسۡتَقِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 52,
                        "text": "فَلَمَّاۤ اَحَسَّ عِيۡسٰى مِنۡهُمُ الۡكُفۡرَ قَالَ مَنۡ اَنۡصَارِىۡۤ اِلَى اللّٰهِ​ؕ قَالَ الۡحَـوَارِيُّوۡنَ نَحۡنُ اَنۡصَارُ اللّٰهِ​ۚ اٰمَنَّا بِاللّٰهِ​ۚ وَاشۡهَدۡ بِاَنَّا مُسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 53,
                        "text": "رَبَّنَاۤ اٰمَنَّا بِمَاۤ اَنۡزَلۡتَ وَاتَّبَعۡنَا الرَّسُوۡلَ فَاكۡتُبۡنَا مَعَ الشّٰهِدِيۡنَ‏"
                    },
                    {
                        "num": 54,
                        "text": "وَمَكَرُوۡا وَمَكَرَاللّٰهُ ​ؕ وَاللّٰهُ خَيۡرُ الۡمَاكِرِيۡنَ‏"
                    },
                    {
                        "num": 55,
                        "text": "اِذۡ قَالَ اللّٰهُ يٰعِيۡسٰۤى اِنِّىۡ مُتَوَفِّيۡكَ وَرَافِعُكَ اِلَىَّ وَمُطَهِّرُكَ مِنَ الَّذِيۡنَ كَفَرُوۡا وَجَاعِلُ الَّذِيۡنَ اتَّبَعُوۡكَ فَوۡقَ الَّذِيۡنَ كَفَرُوۡۤا اِلٰى يَوۡمِ الۡقِيٰمَةِ ​​ۚ ثُمَّ اِلَىَّ مَرۡجِعُكُمۡ فَاَحۡكُمُ بَيۡنَكُمۡ فِيۡمَا كُنۡتُمۡ فِيۡهِ تَخۡتَلِفُوۡنَ‏"
                    },
                    {
                        "num": 56,
                        "text": "فَاَمَّا الَّذِيۡنَ كَفَرُوۡا فَاُعَذِّبُهُمۡ عَذَابًا شَدِيۡدًا فِى الدُّنۡيَا وَالۡاٰخِرَةِ وَمَا لَهُمۡ مِّنۡ نّٰصِرِيۡنَ‏"
                    },
                    {
                        "num": 57,
                        "text": "وَاَمَّا الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ فَيُوَفِّيۡهِمۡ اُجُوۡرَهُمۡ​ؕ وَ اللّٰهُ لَا يُحِبُّ الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 58,
                        "text": "ذٰ لِكَ نَـتۡلُوۡهُ عَلَيۡكَ مِنَ الۡاٰيٰتِ وَ الذِّكۡرِ الۡحَكِيۡمِ‏"
                    },
                    {
                        "num": 59,
                        "text": "اِنَّ مَثَلَ عِيۡسٰى عِنۡدَ اللّٰهِ كَمَثَلِ اٰدَمَ​ؕ خَلَقَهٗ مِنۡ تُرَابٍ ثُمَّ قَالَ لَهٗ كُنۡ فَيَكُوۡنُ‏"
                    },
                    {
                        "num": 60,
                        "text": "اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُنۡ مِّنَ الۡمُمۡتَرِيۡنَ‏"
                    },
                    {
                        "num": 61,
                        "text": "فَمَنۡ حَآجَّكَ فِيۡهِ مِنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ فَقُلۡ تَعَالَوۡا نَدۡعُ اَبۡنَآءَنَا وَاَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَاَنۡفُسَنَا وَاَنۡفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ اللّٰهِ عَلَى الۡكٰذِبِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 62,
                        "text": "اِنَّ هٰذَا لَهُوَ الۡقَصَصُ الۡحَـقُّ ​​ۚ وَمَا مِنۡ اِلٰهٍ اِلَّا اللّٰهُ​ؕ وَاِنَّ اللّٰهَ لَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 63,
                        "text": "فَاِنۡ تَوَلَّوۡا فَاِنَّ اللّٰهَ عَلِيۡمٌۢ بِالۡمُفۡسِدِيۡنَ‏"
                    },
                    {
                        "num": 64,
                        "text": "قُلۡ يٰۤـاَهۡلَ الۡكِتٰبِ تَعَالَوۡا اِلٰى كَلِمَةٍ سَوَآءٍۢ بَيۡنَـنَا وَبَيۡنَكُمۡ اَلَّا نَـعۡبُدَ اِلَّا اللّٰهَ وَلَا نُشۡرِكَ بِهٖ شَيۡـــًٔا وَّلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا اَرۡبَابًا مِّنۡ دُوۡنِ اللّٰهِ​ؕ فَاِنۡ تَوَلَّوۡا فَقُوۡلُوا اشۡهَدُوۡا بِاَنَّا مُسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 65,
                        "text": "يٰۤـاَهۡلَ الۡكِتٰبِ لِمَ تُحَآجُّوۡنَ فِىۡۤ اِبۡرٰهِيۡمَ وَمَاۤ اُنۡزِلَتِ التَّوۡرٰٮةُ وَالۡاِنۡجِيۡلُ اِلَّا مِنۡۢ بَعۡدِهٖؕ اَفَلَا تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 66,
                        "text": "هٰۤاَنۡـتُمۡ هٰٓؤُلَآءِ حٰجَجۡتُمۡ فِيۡمَا لَـكُمۡ بِهٖ عِلۡمٌ فَلِمَ تُحَآجُّوۡنَ فِيۡمَا لَـيۡسَ لَـكُمۡ بِهٖ عِلۡمٌ​ؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 67,
                        "text": "مَا كَانَ اِبۡرٰهِيۡمُ يَهُوۡدِيًّا وَّلَا نَصۡرَانِيًّا وَّ لٰكِنۡ كَانَ حَنِيۡفًا مُّسۡلِمًا ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ‏"
                    },
                    {
                        "num": 68,
                        "text": "اِنَّ اَوۡلَى النَّاسِ بِاِبۡرٰهِيۡمَ لَـلَّذِيۡنَ اتَّبَعُوۡهُ وَهٰذَا النَّبِىُّ وَالَّذِيۡنَ اٰمَنُوۡا ​ؕ وَاللّٰهُ وَلِىُّ الۡمُؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 69,
                        "text": "وَدَّتۡ طَّآٮِٕفَةٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يُضِلُّوۡنَكُمؕۡ وَمَا يُضِلُّوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَ‏"
                    },
                    {
                        "num": 70,
                        "text": "يٰۤـاَهۡلَ الۡكِتٰبِ لِمَ تَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 71,
                        "text": "يٰۤـاَهۡلَ الۡكِتٰبِ لِمَ تَلۡبِسُوۡنَ الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوۡنَ الۡحَـقَّ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 72,
                        "text": "وَقَالَتۡ طَّآٮِٕفَةٌ مِّنۡ اَهۡلِ الۡكِتٰبِ اٰمِنُوۡا بِالَّذِىۡۤ اُنۡزِلَ عَلَى الَّذِيۡنَ اٰمَنُوۡا وَجۡهَ النَّهَارِ وَاكۡفُرُوۡۤا اٰخِرَهٗ لَعَلَّهُمۡ يَرۡجِعُوۡنَ​​ۚ​ ۖ‏"
                    },
                    {
                        "num": 73,
                        "text": "وَلَا تُؤۡمِنُوۡۤا اِلَّا لِمَنۡ تَبِعَ دِيۡنَكُمۡؕ قُلۡ اِنَّ الۡهُدٰى هُدَى اللّٰهِۙ اَنۡ يُّؤۡتٰٓى اَحَدٌ مِّثۡلَ مَاۤ اُوۡتِيۡتُمۡ اَوۡ يُحَآجُّوۡكُمۡ عِنۡدَ رَبِّكُمۡ​ؕ قُلۡ اِنَّ الۡفَضۡلَ بِيَدِ اللّٰهِۚ يُؤۡتِيۡهِ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ ۚۙ‏"
                    },
                    {
                        "num": 74,
                        "text": "يَّخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ‏ ﻿﻿"
                    },
                    {
                        "num": 75,
                        "text": "وَمِنۡ اَهۡلِ الۡكِتٰبِ مَنۡ اِنۡ تَاۡمَنۡهُ بِقِنۡطَارٍ يُّؤَدِّهٖۤ اِلَيۡكَ​ۚ وَمِنۡهُمۡ مَّنۡ اِنۡ تَاۡمَنۡهُ بِدِيۡنَارٍ لَّا يُؤَدِّهٖۤ اِلَيۡكَ اِلَّا مَا دُمۡتَ عَلَيۡهِ قَآٮِٕمًا ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡا لَيۡسَ عَلَيۡنَا فِىۡ الۡاُمِّيّٖنَ سَبِيۡلٌۚ وَيَقُوۡلُوۡنَ عَلَى اللّٰهِ الۡكَذِبَ وَ هُمۡ يَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 76,
                        "text": "بَلٰى مَنۡ اَوۡفٰى بِعَهۡدِهٖ وَاتَّقٰى فَاِنَّ اللّٰهَ يُحِبُّ الۡمُتَّقِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 77,
                        "text": "اِنَّ الَّذِيۡنَ يَشۡتَرُوۡنَ بِعَهۡدِ اللّٰهِ وَاَيۡمَانِهِمۡ ثَمَنًا قَلِيۡلًا اُولٰٓٮِٕكَ لَا خَلَاقَ لَهُمۡ فِى الۡاٰخِرَةِ وَلَا يُكَلِّمُهُمُ اللّٰهُ وَلَا يَنۡظُرُ اِلَيۡهِمۡ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَكِّيۡهِمۡ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ‏"
                    },
                    {
                        "num": 78,
                        "text": "وَاِنَّ مِنۡهُمۡ لَـفَرِيۡقًا يَّلۡوٗنَ اَلۡسِنَتَهُمۡ بِالۡكِتٰبِ لِتَحۡسَبُوۡهُ مِنَ الۡكِتٰبِ​ وَمَا هُوَ مِنَ الۡكِتٰبِۚ وَيَقُوۡلُوۡنَ هُوَ مِنۡ عِنۡدِ اللّٰهِ وَمَا هُوَ مِنۡ عِنۡدِ اللّٰهِ​ۚ وَيَقُوۡلُوۡنَ عَلَى اللّٰهِ الۡكَذِبَ وَ هُمۡ يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 79,
                        "text": "مَا كَانَ لِبَشَرٍ اَنۡ يُّؤۡتِيَهُ اللّٰهُ الۡكِتٰبَ وَالۡحُكۡمَ وَالنُّبُوَّةَ ثُمَّ يَقُوۡلَ لِلنَّاسِ كُوۡنُوۡا عِبَادًا لِّىۡ مِنۡ دُوۡنِ اللّٰهِ وَلٰـكِنۡ كُوۡنُوۡا رَبَّانِيّٖنَ بِمَا كُنۡتُمۡ تُعَلِّمُوۡنَ الۡكِتٰبَ وَبِمَا كُنۡتُمۡ تَدۡرُسُوۡنَۙ‏"
                    },
                    {
                        "num": 80,
                        "text": "وَلَا يَاۡمُرَكُمۡ اَنۡ تَتَّخِذُوا الۡمَلٰٓٮِٕكَةَ وَالنَّبِيّٖنَ اَرۡبَابًا​ ؕ اَيَاۡمُرُكُمۡ بِالۡكُفۡرِ بَعۡدَ اِذۡ اَنۡـتُمۡ مُّسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 81,
                        "text": "وَاِذۡ اَخَذَ اللّٰهُ مِيۡثَاقَ النَّبِيّٖنَ لَمَاۤ اٰتَيۡتُكُمۡ مِّنۡ كِتٰبٍ وَّحِكۡمَةٍ ثُمَّ جَآءَكُمۡ رَسُوۡلٌ مُّصَدِّقٌ لِّمَا مَعَكُمۡ لَـتُؤۡمِنُنَّ بِهٖ وَلَـتَـنۡصُرُنَّهٗ ​ؕ قَالَ ءَاَقۡرَرۡتُمۡ وَاَخَذۡتُمۡ عَلٰى ذٰ لِكُمۡ اِصۡرِىۡ​ؕ قَالُوۡۤا اَقۡرَرۡنَا ​ؕ قَالَ فَاشۡهَدُوۡا وَاَنَا مَعَكُمۡ مِّنَ الشّٰهِدِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 82,
                        "text": "فَمَنۡ تَوَلّٰى بَعۡدَ ذٰ لِكَ فَاُولٰٓٮِٕكَ هُمُ الۡفٰسِقُوۡنَ‏"
                    },
                    {
                        "num": 83,
                        "text": "اَفَغَيۡرَ دِيۡنِ اللّٰهِ يَبۡغُوۡنَ وَلَهٗۤ اَسۡلَمَ مَنۡ فِى السَّمٰوٰتِ وَالۡاَرۡضِ طَوۡعًا وَّكَرۡهًا وَّاِلَيۡهِ يُرۡجَعُوۡنَ‏"
                    },
                    {
                        "num": 84,
                        "text": "قُلۡ اٰمَنَّا بِاللّٰهِ وَمَاۤ اُنۡزِلَ عَلَيۡنَا وَمَاۤ اُنۡزِلَ عَلٰٓى اِبۡرٰهِيۡمَ وَ اِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطِ وَمَاۤ اُوۡتِىَ مُوۡسٰى وَ عِيۡسٰى وَالنَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 85,
                        "text": "وَمَنۡ يَّبۡتَغِ غَيۡرَ الۡاِسۡلَامِ دِيۡنًا فَلَنۡ يُّقۡبَلَ مِنۡهُ​ ۚ وَهُوَ فِى الۡاٰخِرَةِ مِنَ الۡخٰسِرِيۡنَ‏"
                    },
                    {
                        "num": 86,
                        "text": "كَيۡفَ يَهۡدِى اللّٰهُ قَوۡمًا كَفَرُوۡا بَعۡدَ اِيۡمَانِهِمۡ وَشَهِدُوۡۤا اَنَّ الرَّسُوۡلَ حَقٌّ وَّجَآءَهُمُ الۡبَيِّنٰتُ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 87,
                        "text": "اُولٰٓٮِٕكَ جَزَآؤُهُمۡ اَنَّ عَلَيۡهِمۡ لَعۡنَةَ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ‏"
                    },
                    {
                        "num": 88,
                        "text": "خٰلِدِيۡنَ فِيۡهَا ​ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَۙ‏ ﻿﻿"
                    },
                    {
                        "num": 89,
                        "text": "اِلَّا الَّذِيۡنَ تَابُوۡا مِنۡۢ بَعۡدِ ذٰ لِكَ وَاَصۡلَحُوۡا  فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 90,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا بَعۡدَ اِيۡمَانِهِمۡ ثُمَّ ازۡدَادُوۡا كُفۡرًا لَّنۡ تُقۡبَلَ تَوۡبَتُهُمۡ​ۚ وَاُولٰٓٮِٕكَ هُمُ الضَّآ لُّوۡنَ‏"
                    },
                    {
                        "num": 91,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ فَلَنۡ يُّقۡبَلَ مِنۡ اَحَدِهِمۡ مِّلۡءُ الۡاَرۡضِ ذَهَبًا وَّلَوِ افۡتَدٰى بِهٖ ؕ اُولٰٓٮِٕكَ لَـهُمۡ عَذَابٌ اَلِـيۡمٌۙ وَّمَا لَـهُمۡ مِّــنۡ نّٰصِــرِيۡنَ‏"
                    },
                    {
                        "num": 92,
                        "text": "لَنۡ تَنَالُوا الۡبِرَّ حَتّٰى تُنۡفِقُوۡا مِمَّا تُحِبُّوۡنَ ؕ  وَمَا تُنۡفِقُوۡا مِنۡ شَىۡءٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ‏"
                    }
                ]
            }
        ]
    },
    "4": {
        "name": "Juz 4",
        "surahs": [
            {
                "surah": "Ali 'Imran",
                "number": 3,
                "ayahs": [
                    {
                        "num": 93,
                        "text": "كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِىۡۤ اِسۡرَآءِيۡلَ اِلَّا مَا حَرَّمَ اِسۡرَآءِيۡلُ عَلٰى نَفۡسِهٖ مِنۡ قَبۡلِ اَنۡ تُنَزَّلَ التَّوۡرٰٮةُ ​ؕ قُلۡ فَاۡتُوۡا بِالتَّوۡرٰٮةِ فَاتۡلُوۡهَاۤ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 94,
                        "text": "فَمَنِ افۡتَرٰى عَلَى اللّٰهِ الۡكَذِبَ مِنۡۢ بَعۡدِ ذٰ لِكَ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 95,
                        "text": "قُلۡ صَدَقَ اللّٰهُ​ فَاتَّبِعُوۡا مِلَّةَ اِبۡرٰهِيۡمَ حَنِيۡفًا ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ‏"
                    },
                    {
                        "num": 96,
                        "text": "اِنَّ اَوَّلَ بَيۡتٍ وُّضِعَ لِلنَّاسِ لَـلَّذِىۡ بِبَكَّةَ مُبٰرَكًا وَّهُدًى لِّلۡعٰلَمِيۡنَ​​ۚ‏"
                    },
                    {
                        "num": 97,
                        "text": "فِيۡهِ اٰيٰتٌ ۢ بَيِّنٰتٌ مَّقَامُ اِبۡرٰهِيۡمَۚ  وَمَنۡ دَخَلَهٗ كَانَ اٰمِنًا ​ؕ وَلِلّٰهِ عَلَى النَّاسِ حِجُّ الۡبَيۡتِ مَنِ اسۡتَطَاعَ اِلَيۡهِ سَبِيۡلًا ​ؕ وَمَنۡ كَفَرَ فَاِنَّ اللّٰهَ غَنِىٌّ عَنِ الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 98,
                        "text": "قُلۡ يٰۤـاَهۡلَ الۡكِتٰبِ لِمَ تَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ ۖ وَاللّٰهُ شَهِيۡدٌ عَلٰى مَا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 99,
                        "text": "قُلۡ يٰۤـاَهۡلَ الۡكِتٰبِ لِمَ تَصُدُّوۡنَ عَنۡ سَبِيۡلِ اللّٰهِ مَنۡ اٰمَنَ تَبۡغُوۡنَهَا عِوَجًا وَّاَنۡتُمۡ شُهَدَآءُ ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 100,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِنۡ تُطِيۡعُوۡا فَرِيۡقًا مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ يَرُدُّوۡكُمۡ بَعۡدَ اِيۡمَانِكُمۡ كٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 101,
                        "text": "وَكَيۡفَ تَكۡفُرُوۡنَ وَاَنۡـتُمۡ تُتۡلٰى عَلَيۡكُمۡ اٰيٰتُ اللّٰهِ وَفِيۡكُمۡ رَسُوۡلُهٗ ​ؕ وَمَنۡ يَّعۡتَصِمۡ بِاللّٰهِ فَقَدۡ هُدِىَ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ‏ ﻿﻿"
                    },
                    {
                        "num": 102,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اتَّقُوا اللّٰهَ حَقَّ تُقٰتِهٖ وَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 103,
                        "text": "وَاعۡتَصِمُوۡا بِحَبۡلِ اللّٰهِ جَمِيۡعًا وَّلَا تَفَرَّقُوۡا​ وَاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ اِذۡ كُنۡتُمۡ اَعۡدَآءً فَاَ لَّفَ بَيۡنَ قُلُوۡبِكُمۡ فَاَصۡبَحۡتُمۡ بِنِعۡمَتِهٖۤ اِخۡوَانًا ۚ وَكُنۡتُمۡ عَلٰى شَفَا حُفۡرَةٍ مِّنَ النَّارِ فَاَنۡقَذَكُمۡ مِّنۡهَا ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَهۡتَدُوۡنَ‏"
                    },
                    {
                        "num": 104,
                        "text": "وَلۡتَكُنۡ مِّنۡكُمۡ اُمَّةٌ يَّدۡعُوۡنَ اِلَى الۡخَيۡرِ وَيَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَيَنۡهَوۡنَ عَنِ الۡمُنۡكَرِ​ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ‏"
                    },
                    {
                        "num": 105,
                        "text": "وَلَا تَكُوۡنُوۡا كَالَّذِيۡنَ تَفَرَّقُوۡا وَاخۡتَلَفُوۡا مِنۡۢ بَعۡدِ مَا جَآءَهُمُ الۡبَيِّنٰتُ​ؕ وَاُولٰٓٮِٕكَ لَهُمۡ عَذَابٌ عَظِيۡمٌۙ‏"
                    },
                    {
                        "num": 106,
                        "text": "يَّوۡمَ تَبۡيَضُّ وُجُوۡهٌ وَّتَسۡوَدُّ وُجُوۡهٌ  ؕ فَاَمَّا الَّذِيۡنَ اسۡوَدَّتۡ وُجُوۡهُهُمۡ اَكَفَرۡتُمۡ بَعۡدَ اِيۡمَانِكُمۡ فَذُوۡقُوا الۡعَذَابَ بِمَا كُنۡتُمۡ تَكۡفُرُوۡنَ‏"
                    },
                    {
                        "num": 107,
                        "text": "وَاَمَّا الَّذِيۡنَ ابۡيَـضَّتۡ وُجُوۡهُهُمۡ فَفِىۡ رَحۡمَةِ اللّٰهِ ؕ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 108,
                        "text": "تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَمَا اللّٰهُ يُرِيۡدُ ظُلۡمًا لِّلۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 109,
                        "text": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ‏"
                    },
                    {
                        "num": 110,
                        "text": "كُنۡتُمۡ خَيۡرَ اُمَّةٍ اُخۡرِجَتۡ لِلنَّاسِ تَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَتَنۡهَوۡنَ عَنِ الۡمُنۡكَرِ وَتُؤۡمِنُوۡنَ بِاللّٰهِ​ؕ وَلَوۡ اٰمَنَ اَهۡلُ الۡكِتٰبِ لَڪَانَ خَيۡرًا لَّهُمۡ​ؕ مِنۡهُمُ الۡمُؤۡمِنُوۡنَ وَاَكۡثَرُهُمُ الۡفٰسِقُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 111,
                        "text": "لَنۡ يَّضُرُّوۡكُمۡ اِلَّاۤ اَذًى​ؕ وَاِنۡ يُّقَاتِلُوۡكُمۡ يُوَلُّوۡكُمُ الۡاَدۡبَارَ ثُمَّ لَا يُنۡصَرُوۡنَ‏"
                    },
                    {
                        "num": 112,
                        "text": "ضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ اَيۡنَ مَا ثُقِفُوۡۤا اِلَّا بِحَبۡلٍ مِّنَ اللّٰهِ وَحَبۡلٍ مِّنَ النَّاسِ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ وَضُرِبَتۡ عَلَيۡهِمُ الۡمَسۡكَنَةُ  ؕ ذٰ لِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ الۡاَنۡۢبِيَآءَ بِغَيۡرِ حَقٍّ​ؕ ذٰ لِكَ بِمَا عَصَوۡا وَّكَانُوۡا يَعۡتَدُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 113,
                        "text": "لَـيۡسُوۡا سَوَآءً ​ؕ مِنۡ اَهۡلِ الۡكِتٰبِ اُمَّةٌ قَآٮِٕمَةٌ يَّتۡلُوۡنَ اٰيٰتِ اللّٰهِ اٰنَآءَ الَّيۡلِ وَ هُمۡ يَسۡجُدُوۡنَ‏"
                    },
                    {
                        "num": 114,
                        "text": "يُؤۡمِنُوۡنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَ يَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَيَنۡهَوۡنَ عَنِ الۡمُنۡكَرِ وَيُسَارِعُوۡنَ فِىۡ الۡخَيۡرٰتِ ؕ وَاُولٰٓٮِٕكَ مِنَ الصّٰلِحِيۡنَ‏"
                    },
                    {
                        "num": 115,
                        "text": "وَمَا يَفۡعَلُوۡا مِنۡ خَيۡرٍ فَلَنۡ يُّكۡفَرُوۡهُ ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالۡمُتَّقِيۡنَ‏"
                    },
                    {
                        "num": 116,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا لَنۡ تُغۡنِىَ عَنۡهُمۡ اَمۡوَالُهُمۡ وَلَاۤ اَوۡلَادُهُمۡ مِّنَ اللّٰهِ شَيۡـــًٔا  ؕ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 117,
                        "text": "مَثَلُ مَا يُنۡفِقُوۡنَ فِىۡ هٰذِهِ الۡحَيٰوةِ الدُّنۡيَا كَمَثَلِ رِيۡحٍ فِيۡهَا صِرٌّ اَصَابَتۡ حَرۡثَ قَوۡمٍ ظَلَمُوۡۤا اَنۡفُسَهُمۡ فَاَهۡلَكَتۡهُ ​ؕ وَمَا ظَلَمَهُمُ اللّٰهُ وَلٰـكِنۡ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ‏"
                    },
                    {
                        "num": 118,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡا بِطَانَةً مِّنۡ دُوۡنِكُمۡ لَا يَاۡلُوۡنَكُمۡ خَبَالًا ؕ وَدُّوۡا مَا عَنِتُّمۡ​ۚ قَدۡ بَدَتِ الۡبَغۡضَآءُ مِنۡ اَفۡوَاهِهِمۡ  ۖۚ وَمَا تُخۡفِىۡ صُدُوۡرُهُمۡ اَكۡبَرُ​ؕ قَدۡ بَيَّنَّا لَـكُمُ الۡاٰيٰتِ​ اِنۡ كُنۡتُمۡ تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 119,
                        "text": "هٰۤاَنۡتُمۡ اُولَاۤءِ تُحِبُّوۡنَهُمۡ وَلَا يُحِبُّوۡنَكُمۡ وَتُؤۡمِنُوۡنَ بِالۡكِتٰبِ كُلِّهٖ ​ۚ وَاِذَا لَقُوۡكُمۡ قَالُوۡۤا اٰمَنَّا  ۖۚ وَاِذَا خَلَوۡا عَضُّوۡا عَلَيۡكُمُ الۡاَنَامِلَ مِنَ الۡغَيۡظِ​ؕ قُلۡ مُوۡتُوۡا بِغَيۡظِكُمۡؕ​ اِنَّ اللّٰهَ عَلِيۡمٌ ۢ بِذَاتِ الصُّدُوۡرِ‏"
                    },
                    {
                        "num": 120,
                        "text": "اِنۡ تَمۡسَسۡكُمۡ حَسَنَةٌ تَسُؤۡهُمۡ وَاِنۡ تُصِبۡكُمۡ سَيِّئَةٌ يَّفۡرَحُوۡا بِهَا ​ۚ وَاِنۡ تَصۡبِرُوۡا وَتَتَّقُوۡا لَا يَضُرُّكُمۡ كَيۡدُهُمۡ شَيۡـــًٔا ؕ اِنَّ اللّٰهَ بِمَا يَعۡمَلُوۡنَ مُحِيۡطٌ‏"
                    },
                    {
                        "num": 121,
                        "text": "وَاِذۡ غَدَوۡتَ مِنۡ اَهۡلِكَ تُبَوِّئُ الۡمُؤۡمِنِيۡنَ مَقَاعِدَ لِلۡقِتَالِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌۙ‏"
                    },
                    {
                        "num": 122,
                        "text": "اِذۡ هَمَّتۡ طَّآٮِٕفَتٰنِ مِنۡكُمۡ اَنۡ تَفۡشَلَا ۙ وَاللّٰهُ وَلِيُّهُمَا​ ؕ وَعَلَى اللّٰهِ فَلۡيَتَوَكَّلِ الۡمُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 123,
                        "text": "وَلَقَدۡ نَصَرَكُمُ اللّٰهُ بِبَدۡرٍ وَّاَنۡـتُمۡ اَذِلَّةٌ  ۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ‏"
                    },
                    {
                        "num": 124,
                        "text": "اِذۡ تَقُوۡلُ لِلۡمُؤۡمِنِيۡنَ اَلَنۡ يَّكۡفِيَكُمۡ اَنۡ يُّمِدَّكُمۡ رَبُّكُمۡ بِثَلٰثَةِ اٰلَافٍ مِّنَ الۡمَلٰٓٮِٕكَةِ مُنۡزَلِيۡنَؕ‏"
                    },
                    {
                        "num": 125,
                        "text": "بَلٰٓى ۙ اِنۡ تَصۡبِرُوۡا وَتَتَّقُوۡا وَيَاۡتُوۡكُمۡ مِّنۡ فَوۡرِهِمۡ هٰذَا يُمۡدِدۡكُمۡ رَبُّكُمۡ بِخَمۡسَةِ اٰلَافٍ مِّنَ الۡمَلٰٓٮِٕكَةِ مُسَوِّمِيۡنَ‏"
                    },
                    {
                        "num": 126,
                        "text": "وَمَا جَعَلَهُ اللّٰهُ اِلَّا بُشۡرٰى لَـكُمۡ وَلِتَطۡمَٮِٕنَّ قُلُوۡبُكُمۡ بِهٖ​ؕ وَمَا النَّصۡرُ اِلَّا مِنۡ عِنۡدِ اللّٰهِ الۡعَزِيۡزِ الۡحَكِيۡمِۙ‏"
                    },
                    {
                        "num": 127,
                        "text": "لِيَقۡطَعَ طَرَفًا مِّنَ الَّذِيۡنَ كَفَرُوۡۤا اَوۡ يَكۡبِتَهُمۡ فَيَنۡقَلِبُوۡا خَآٮِٕبِيۡنَ‏"
                    },
                    {
                        "num": 128,
                        "text": "لَيۡسَ لَكَ مِنَ الۡاَمۡرِ شَىۡءٌ اَوۡ يَتُوۡبَ عَلَيۡهِمۡ اَوۡ يُعَذِّبَهُمۡ فَاِنَّهُمۡ ظٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 129,
                        "text": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ يَغۡفِرُ لِمَنۡ يَّشَآءُ وَ يُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 130,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَاۡكُلُوا الرِّبٰٓوا اَضۡعَافًا مُّضٰعَفَةً ​ وَاتَّقُوا اللّٰهَ لَعَلَّكُمۡ تُفۡلِحُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 131,
                        "text": "وَاتَّقُوا النَّارَ الَّتِىۡۤ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 132,
                        "text": "وَاَطِيۡعُوا اللّٰهَ وَالرَّسُوۡلَ لَعَلَّكُمۡ تُرۡحَمُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 133,
                        "text": "وَسَارِعُوۡۤا اِلٰى مَغۡفِرَةٍ مِّنۡ رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا السَّمٰوٰتُ وَالۡاَرۡضُۙ اُعِدَّتۡ لِلۡمُتَّقِيۡنَۙ‏"
                    },
                    {
                        "num": 134,
                        "text": "الَّذِيۡنَ يُنۡفِقُوۡنَ فِى السَّرَّآءِ وَالضَّرَّآءِ وَالۡكٰظِمِيۡنَ الۡغَيۡظَ وَالۡعَافِيۡنَ عَنِ النَّاسِ​ؕ وَاللّٰهُ يُحِبُّ الۡمُحۡسِنِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 135,
                        "text": "وَالَّذِيۡنَ اِذَا فَعَلُوۡا فَاحِشَةً اَوۡ ظَلَمُوۡۤا اَنۡفُسَهُمۡ ذَكَرُوا اللّٰهَ فَاسۡتَغۡفَرُوۡا لِذُنُوۡبِهِمۡ وَمَنۡ يَّغۡفِرُ الذُّنُوۡبَ اِلَّا اللّٰهُ  وَلَمۡ يُصِرُّوۡا عَلٰى مَا فَعَلُوۡا وَهُمۡ يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 136,
                        "text": "اُولٰٓٮِٕكَ جَزَآؤُهُمۡ مَّغۡفِرَةٌ مِّنۡ رَّبِّهِمۡ وَ جَنّٰتٌ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا​ ؕ وَنِعۡمَ اَجۡرُ الۡعٰمِلِيۡنَؕ‏ ﻿﻿"
                    },
                    {
                        "num": 137,
                        "text": "قَدۡ خَلَتۡ مِنۡ قَبۡلِكُمۡ سُنَنٌ ۙ فَسِيۡرُوۡا فِى الۡاَرۡضِ فَانۡظُرُوۡا كَيۡفَ كَانَ عَاقِبَةُ الۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 138,
                        "text": "هٰذَا بَيَانٌ لِّلنَّاسِ وَهُدًى وَّمَوۡعِظَةٌ لِّلۡمُتَّقِيۡنَ‏"
                    },
                    {
                        "num": 139,
                        "text": "وَلَا تَهِنُوۡا وَ لَا تَحۡزَنُوۡا وَاَنۡتُمُ الۡاَعۡلَوۡنَ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 140,
                        "text": "اِنۡ يَّمۡسَسۡكُمۡ قَرۡحٌ فَقَدۡ مَسَّ الۡقَوۡمَ قَرۡحٌ مِّثۡلُهٗ ​ؕ وَتِلۡكَ الۡاَيَّامُ نُدَاوِلُهَا بَيۡنَ النَّاسِۚ وَلِيَـعۡلَمَ اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا وَيَتَّخِذَ مِنۡكُمۡ شُهَدَآءَ​ؕ وَاللّٰهُ لَا يُحِبُّ الظّٰلِمِيۡنَۙ‏"
                    },
                    {
                        "num": 141,
                        "text": "وَلِيُمَحِّصَ اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا وَيَمۡحَقَ الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 142,
                        "text": "اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَلَمَّا يَعۡلَمِ اللّٰهُ الَّذِيۡنَ جَاهَدُوۡا مِنۡكُمۡ وَيَعۡلَمَ الصّٰبِرِيۡنَ‏"
                    },
                    {
                        "num": 143,
                        "text": "وَلَقَدۡ كُنۡتُمۡ تَمَنَّوۡنَ الۡمَوۡتَ مِنۡ قَبۡلِ اَنۡ تَلۡقَوۡهُ فَقَدۡ رَاَيۡتُمُوۡهُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ‏"
                    },
                    {
                        "num": 144,
                        "text": "وَمَا مُحَمَّدٌ اِلَّا رَسُوۡلٌ  ۚ قَدۡ خَلَتۡ مِنۡ قَبۡلِهِ الرُّسُلُ​ؕ اَفَا۟ٮِٕنْ مَّاتَ اَوۡ قُتِلَ انْقَلَبۡتُمۡ عَلٰٓى اَعۡقَابِكُمۡ​ؕ وَمَنۡ يَّنۡقَلِبۡ عَلٰى عَقِبَيۡهِ فَلَنۡ يَّضُرَّ اللّٰهَ شَيۡـــًٔا​ ؕ وَسَيَجۡزِى اللّٰهُ الشّٰكِرِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 145,
                        "text": "وَمَا كَانَ لِنَفۡسٍ اَنۡ تَمُوۡتَ اِلَّا بِاِذۡنِ اللّٰهِ كِتٰبًا مُّؤَجَّلًا ؕ وَ مَنۡ يُّرِدۡ ثَوَابَ الدُّنۡيَا نُؤۡتِهٖ مِنۡهَا ​ۚ وَمَنۡ يُّرِدۡ ثَوَابَ الۡاٰخِرَةِ نُؤۡتِهٖ مِنۡهَا ​ؕ وَسَنَجۡزِى الشّٰكِرِيۡنَ‏"
                    },
                    {
                        "num": 146,
                        "text": "وَكَاَيِّنۡ مِّنۡ نَّبِىٍّ قٰتَلَ ۙ مَعَهٗ رِبِّيُّوۡنَ كَثِيۡرٌ ۚ فَمَا وَهَنُوۡا لِمَاۤ اَصَابَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ وَمَا ضَعُفُوۡا وَمَا اسۡتَكَانُوۡا ​ؕ وَاللّٰهُ يُحِبُّ الصّٰبِرِيۡنَ‏"
                    },
                    {
                        "num": 147,
                        "text": "وَمَا كَانَ قَوۡلَهُمۡ اِلَّاۤ اَنۡ قَالُوۡا رَبَّنَا اغۡفِرۡ لَنَا ذُنُوۡبَنَا وَاِسۡرَافَنَا فِىۡۤ اَمۡرِنَا وَ ثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 148,
                        "text": "فَاٰتٰٮهُمُ اللّٰهُ ثَوَابَ الدُّنۡيَا وَحُسۡنَ ثَوَابِ الۡاٰخِرَةِ​ ؕ وَاللّٰهُ يُحِبُّ الۡمُحۡسِنِيۡنَ‏"
                    },
                    {
                        "num": 149,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِنۡ تُطِيۡعُوا الَّذِيۡنَ كَفَرُوۡا يَرُدُّوۡكُمۡ عَلٰٓى اَعۡقَابِكُمۡ فَتَـنۡقَلِبُوۡا خٰسِرِيۡنَ‏"
                    },
                    {
                        "num": 150,
                        "text": "بَلِ اللّٰهُ مَوۡلٰٮكُمۡ​ۚ وَهُوَ خَيۡرُ النّٰصِرِيۡنَ‏"
                    },
                    {
                        "num": 151,
                        "text": "سَنُلۡقِىۡ فِىۡ قُلُوۡبِ الَّذِيۡنَ كَفَرُوا الرُّعۡبَ بِمَاۤ اَشۡرَكُوۡا بِاللّٰهِ مَا لَمۡ يُنَزِّلۡ بِهٖ سُلۡطٰنًا ​​ۚ وَمَاۡوٰٮهُمُ النَّارُ​ؕ وَ بِئۡسَ مَثۡوَى الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 152,
                        "text": "وَلَقَدۡ صَدَقَكُمُ اللّٰهُ وَعۡدَهٗۤ اِذۡ تَحُسُّوۡنَهُمۡ بِاِذۡنِهٖ​ۚ حَتّٰۤی اِذَا فَشِلۡتُمۡ وَتَـنَازَعۡتُمۡ فِى الۡاَمۡرِ وَعَصَيۡتُمۡ مِّنۡۢ بَعۡدِ مَاۤ اَرٰٮكُمۡ مَّا تُحِبُّوۡنَ​ؕ مِنۡكُمۡ مَّنۡ يُّرِيۡدُ الدُّنۡيَا وَمِنۡكُمۡ مَّنۡ يُّرِيۡدُ الۡاٰخِرَةَ  ​​​ۚ ثُمَّ صَرَفَكُمۡ عَنۡهُمۡ لِيَبۡتَلِيَكُمۡ​ۚ وَلَقَدۡ عَفَا عَنۡكُمۡ​ؕ وَ اللّٰهُ ذُوۡ فَضۡلٍ عَلَى الۡمُؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 153,
                        "text": "اِذۡ تُصۡعِدُوۡنَ وَلَا تَلۡوٗنَ عَلٰٓى اَحَدٍ وَّالرَّسُوۡلُ يَدۡعُوۡكُمۡ فِىۡۤ اُخۡرٰٮكُمۡ فَاَثَابَكُمۡ غَمًّا ۢ بِغَمٍّ لِّـكَيۡلَا تَحۡزَنُوۡا عَلٰى مَا فَاتَكُمۡ وَلَا مَاۤ اَصَابَكُمۡ​ؕ وَاللّٰهُ خَبِيۡرٌۢ بِمَا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 154,
                        "text": "ثُمَّ اَنۡزَلَ عَلَيۡكُمۡ مِّنۡۢ بَعۡدِ الۡغَمِّ اَمَنَةً نُّعَاسًا يَّغۡشٰى طَآٮِٕفَةً مِّنۡكُمۡ​ۙ وَطَآٮِٕفَةٌ قَدۡ اَهَمَّتۡهُمۡ اَنۡفُسُهُمۡ يَظُنُّوۡنَ بِاللّٰهِ غَيۡرَ الۡحَـقِّ ظَنَّ الۡجَـاهِلِيَّةِ​ؕ يَقُوۡلُوۡنَ هَلۡ لَّنَا مِنَ الۡاَمۡرِ مِنۡ شَىۡءٍ​ؕ قُلۡ اِنَّ الۡاَمۡرَ كُلَّهٗ لِلّٰهِ​ؕ يُخۡفُوۡنَ فِىۡۤ اَنۡفُسِهِمۡ مَّا لَا يُبۡدُوۡنَ لَكَ​ؕ يَقُوۡلُوۡنَ لَوۡ كَانَ لَنَا مِنَ الۡاَمۡرِ شَىۡءٌ مَّا قُتِلۡنَا هٰهُنَا ​ؕ قُلۡ لَّوۡ كُنۡتُمۡ فِىۡ بُيُوۡتِكُمۡ لَبَرَزَ الَّذِيۡنَ كُتِبَ عَلَيۡهِمُ الۡقَتۡلُ اِلٰى مَضَاجِعِهِمۡ​ۚ وَلِيَبۡتَلِىَ اللّٰهُ مَا فِىۡ صُدُوۡرِكُمۡ وَلِيُمَحِّصَ مَا فِىۡ قُلُوۡبِكُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏"
                    },
                    {
                        "num": 155,
                        "text": "اِنَّ الَّذِيۡنَ تَوَلَّوۡا مِنۡكُمۡ يَوۡمَ الۡتَقَى الۡجَمۡعٰنِۙ اِنَّمَا اسۡتَزَلَّهُمُ الشَّيۡطٰنُ بِبَعۡضِ مَا كَسَبُوۡا ​ۚ وَلَقَدۡ عَفَا اللّٰهُ عَنۡهُمۡ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ‏"
                    },
                    {
                        "num": 156,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَكُوۡنُوۡا كَالَّذِيۡنَ كَفَرُوۡا وَقَالُوۡا لِاِخۡوَانِهِمۡ اِذَا ضَرَبُوۡا فِى الۡاَرۡضِ اَوۡ كَانُوۡا غُزًّى لَّوۡ كَانُوۡا عِنۡدَنَا مَا مَاتُوۡا وَمَا قُتِلُوۡا ۚ لِيَجۡعَلَ اللّٰهُ ذٰ لِكَ حَسۡرَةً فِىۡ قُلُوۡبِهِمۡ​ؕ وَاللّٰهُ يُحۡىٖ وَيُمِيۡتُ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 157,
                        "text": "وَلَٮِٕنۡ قُتِلۡتُمۡ فِىۡ سَبِيۡلِ اللّٰهِ اَوۡ مُتُّمۡ لَمَغۡفِرَةٌ مِّنَ اللّٰهِ وَرَحۡمَةٌ خَيۡرٌ مِّمَّا يَجۡمَعُوۡنَ‏"
                    },
                    {
                        "num": 158,
                        "text": "وَلَٮِٕنۡ مُّتُّمۡ اَوۡ قُتِلۡتُمۡ لَا اِلَى اللّٰهِ تُحۡشَرُوۡنَ‏"
                    },
                    {
                        "num": 159,
                        "text": "فَبِمَا رَحۡمَةٍ مِّنَ اللّٰهِ لِنۡتَ لَهُمۡ​ۚ وَلَوۡ كُنۡتَ فَظًّا غَلِيۡظَ الۡقَلۡبِ لَانْفَضُّوۡا مِنۡ حَوۡلِكَ​ فَاعۡفُ عَنۡهُمۡ وَاسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِى الۡاَمۡرِ​ۚ فَاِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى اللّٰهِ​ؕ اِنَّ اللّٰهَ يُحِبُّ الۡمُتَوَكِّلِيۡنَ‏"
                    },
                    {
                        "num": 160,
                        "text": "اِنۡ يَّنۡصُرۡكُمُ اللّٰهُ فَلَا غَالِبَ لَـكُمۡ​ۚ وَاِنۡ يَّخۡذُلۡكُمۡ فَمَنۡ ذَا الَّذِىۡ يَنۡصُرُكُمۡ مِّنۡۢ بَعۡدِهٖ ​ؕ وَعَلَى اللّٰهِ فَلۡيَتَوَكَّلِ الۡمُؤۡمِنُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 161,
                        "text": "وَمَا كَانَ لِنَبِىٍّ اَنۡ يَّغُلَّ​ؕ وَمَنۡ يَّغۡلُلۡ يَاۡتِ بِمَا غَلَّ يَوۡمَ الۡقِيٰمَةِ​ ۚ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 162,
                        "text": "اَفَمَنِ اتَّبَعَ رِضۡوَانَ اللّٰهِ كَمَنۡۢ بَآءَ بِسَخَطٍ مِّنَ اللّٰهِ وَمَاۡوٰٮهُ جَهَنَّمُ​ؕ وَ بِئۡسَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 163,
                        "text": "هُمۡ دَرَجٰتٌ عِنۡدَ اللّٰهِ ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 164,
                        "text": "لَقَدۡ مَنَّ اللّٰهُ عَلَى الۡمُؤۡمِنِيۡنَ اِذۡ بَعَثَ فِيۡهِمۡ رَسُوۡلًا مِّنۡ اَنۡفُسِهِمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِهٖ وَيُزَكِّيۡهِمۡ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ  ۚ وَاِنۡ كَانُوۡا مِنۡ قَبۡلُ لَفِىۡ ضَلٰلٍ مُّبِيۡنٍ‏ ﻿﻿"
                    },
                    {
                        "num": 165,
                        "text": "اَوَلَمَّاۤ اَصَابَتۡكُمۡ مُّصِيۡبَةٌ قَدۡ اَصَبۡتُمۡ مِّثۡلَيۡهَا ۙ قُلۡتُمۡ اَنّٰى هٰذَا​ؕ قُلۡ هُوَ مِنۡ عِنۡدِ اَنۡفُسِكُمۡ ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 166,
                        "text": "وَمَاۤ اَصَابَكُمۡ يَوۡمَ الۡتَقَى الۡجَمۡعٰنِ فَبِاِذۡنِ اللّٰهِ وَلِيَعۡلَمَ الۡمُؤۡمِنِيۡنَۙ‏"
                    },
                    {
                        "num": 167,
                        "text": "​وَلِيَعۡلَمَ الَّذِيۡنَ نَافَقُوۡا  ۖۚ وَقِيۡلَ لَهُمۡ تَعَالَوۡا قَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ اَوِ ادۡفَعُوۡا ​ۚ قَالُوۡا لَوۡ نَعۡلَمُ قِتَالًا لَّا تَّبَعۡنٰكُمۡ​ؕ هُمۡ لِلۡكُفۡرِ يَوۡمَٮِٕذٍ اَقۡرَبُ مِنۡهُمۡ لِلۡاِيۡمَانِ​ۚ يَقُوۡلُوۡنَ بِاَفۡوَاهِهِمۡ مَّا لَيۡسَ فِىۡ قُلُوۡبِهِمۡ​ؕ وَاللّٰهُ اَعۡلَمُ بِمَا يَكۡتُمُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 168,
                        "text": "اَلَّذِيۡنَ قَالُوۡا لِاِخۡوَانِهِمۡ وَقَعَدُوۡا لَوۡ اَطَاعُوۡنَا مَا قُتِلُوۡا ​ؕ قُلۡ فَادۡرَءُوۡا عَنۡ اَنۡفُسِكُمُ الۡمَوۡتَ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 169,
                        "text": "وَلَا تَحۡسَبَنَّ الَّذِيۡنَ قُتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتًا ​ؕ بَلۡ اَحۡيَآءٌ عِنۡدَ رَبِّهِمۡ يُرۡزَقُوۡنَۙ‏"
                    },
                    {
                        "num": 170,
                        "text": "فَرِحِيۡنَ بِمَاۤ اٰتٰٮهُمُ اللّٰهُ مِنۡ فَضۡلِهٖ ۙ وَيَسۡتَبۡشِرُوۡنَ بِالَّذِيۡنَ لَمۡ يَلۡحَقُوۡا بِهِمۡ مِّنۡ خَلۡفِهِمۡۙ اَ لَّا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ​ۘ‏ ﻿﻿"
                    },
                    {
                        "num": 171,
                        "text": "يَسۡتَبۡشِرُوۡنَ بِنِعۡمَةٍ مِّنَ اللّٰهِ وَفَضۡلٍۙ وَّاَنَّ اللّٰهَ لَا يُضِيۡعُ اَجۡرَ الۡمُؤۡمِنِيۡنَ  ۛۚ‏"
                    },
                    {
                        "num": 172,
                        "text": "اَلَّذِيۡنَ اسۡتَجَابُوۡا لِلّٰهِ وَالرَّسُوۡلِ مِنۡۢ بَعۡدِ مَاۤ اَصَابَهُمُ الۡقَرۡحُ  ۛؕ لِلَّذِيۡنَ اَحۡسَنُوۡا مِنۡهُمۡ وَاتَّقَوۡا اَجۡرٌ عَظِيۡمٌ​ۚ‏"
                    },
                    {
                        "num": 173,
                        "text": "اَلَّذِيۡنَ قَالَ لَهُمُ النَّاسُ اِنَّ النَّاسَ قَدۡ جَمَعُوۡا لَـكُمۡ فَاخۡشَوۡهُمۡ فَزَادَهُمۡ اِيۡمَانًا  ۖ وَّقَالُوۡا حَسۡبُنَا اللّٰهُ وَنِعۡمَ الۡوَكِيۡلُ‏"
                    },
                    {
                        "num": 174,
                        "text": "فَانْقَلَبُوۡا بِنِعۡمَةٍ مِّنَ اللّٰهِ وَفَضۡلٍ لَّمۡ يَمۡسَسۡهُمۡ سُوۡٓءٌ ۙ وَّاتَّبَعُوۡا رِضۡوَانَ اللّٰهِ ​ؕ وَاللّٰهُ ذُوۡ فَضۡلٍ عَظِيۡمٍ‏"
                    },
                    {
                        "num": 175,
                        "text": "اِنَّمَا ذٰلِكُمُ الشَّيۡطٰنُ يُخَوِّفُ اَوۡلِيَآءَهٗ فَلَا تَخَافُوۡهُمۡ وَخَافُوۡنِ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 176,
                        "text": "وَلَا يَحۡزُنۡكَ الَّذِيۡنَ يُسَارِعُوۡنَ فِى الۡكُفۡرِ​ۚ اِنَّهُمۡ لَنۡ يَّضُرُّوا اللّٰهَ شَيۡـــًٔا ​ؕ يُرِيۡدُ اللّٰهُ اَلَّا يَجۡعَلَ لَهُمۡ حَظًّا فِىۡ الۡاٰخِرَةِ ​ۚ وَلَهُمۡ عَذَابٌ عَظِيۡمٌ‏"
                    },
                    {
                        "num": 177,
                        "text": "اِنَّ الَّذِيۡنَ اشۡتَرَوُا الۡكُفۡرَ بِالۡاِيۡمَانِ لَنۡ يَّضُرُّوا اللّٰهَ شَيۡـــًٔا ​ۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ‏"
                    },
                    {
                        "num": 178,
                        "text": "وَلَا يَحۡسَبَنَّ الَّذِيۡنَ كَفَرُوۡۤا اَنَّمَا نُمۡلِىۡ لَهُمۡ خَيۡرٌ لِّاَنۡفُسِهِمۡ​ؕ اِنَّمَا نُمۡلِىۡ لَهُمۡ لِيَزۡدَادُوۡۤا اِثۡمًا​ ۚ وَلَهُمۡ عَذَابٌ مُّهِيۡنٌ‏ ﻿﻿"
                    },
                    {
                        "num": 179,
                        "text": "مَا كَانَ اللّٰهُ لِيَذَرَ الۡمُؤۡمِنِيۡنَ عَلٰى مَاۤ اَنۡـتُمۡ عَلَيۡهِ حَتّٰى يَمِيۡزَ الۡخَبِيۡثَ مِنَ الطَّيِّبِ​ؕ وَمَا كَانَ اللّٰهُ لِيُطۡلِعَكُمۡ عَلَى الۡغَيۡبِ وَ لٰكِنَّ اللّٰهَ يَجۡتَبِىۡ مِنۡ رُّسُلِهٖ مَنۡ يَّشَآءُ​ فَاٰمِنُوۡا بِاللّٰهِ وَرُسُلِهٖ​ۚ وَاِنۡ تُؤۡمِنُوۡا وَتَتَّقُوۡا فَلَـكُمۡ اَجۡرٌ عَظِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 180,
                        "text": "وَلَا يَحۡسَبَنَّ الَّذِيۡنَ يَبۡخَلُوۡنَ بِمَاۤ اٰتٰٮهُمُ اللّٰهُ مِنۡ فَضۡلِهٖ هُوَ خَيۡـرًا لَّهُمۡ​ؕ بَلۡ هُوَ شَرٌّ لَّهُمۡ​ؕ سَيُطَوَّقُوۡنَ مَا بَخِلُوۡا بِهٖ يَوۡمَ الۡقِيٰمَةِ ​ؕ وَ لِلّٰهِ مِيۡرَاثُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 181,
                        "text": "لَقَدۡ سَمِعَ اللّٰهُ قَوۡلَ الَّذِيۡنَ قَالُوۡۤا اِنَّ اللّٰهَ فَقِيۡرٌ وَّنَحۡنُ اَغۡنِيَآءُ ​ۘ سَنَكۡتُبُ مَا قَالُوۡا وَقَتۡلَهُمُ الۡاَنۡۢبِيَآءَ بِغَيۡرِ حَقٍّ ۙۚ وَّنَقُوۡلُ ذُوۡقُوۡا عَذَابَ الۡحَرِيۡقِ‏"
                    },
                    {
                        "num": 182,
                        "text": "ذٰ لِكَ بِمَا قَدَّمَتۡ اَيۡدِيۡكُمۡ وَاَنَّ اللّٰهَ لَيۡسَ بِظَلَّامٍ لِّلۡعَبِيۡدِ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 183,
                        "text": "اَلَّذِيۡنَ قَالُوۡۤا اِنَّ اللّٰهَ عَهِدَ اِلَيۡنَاۤ اَلَّا نُؤۡمِنَ لِرَسُوۡلٍ حَتّٰى يَاۡتِيَنَا بِقُرۡبَانٍ تَاۡكُلُهُ النَّارُ​ؕ قُلۡ قَدۡ جَآءَكُمۡ رُسُلٌ مِّنۡ قَبۡلِىۡ بِالۡبَيِّنٰتِ وَبِالَّذِىۡ قُلۡتُمۡ فَلِمَ قَتَلۡتُمُوۡهُمۡ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 184,
                        "text": "فَاِنۡ كَذَّبُوۡكَ فَقَدۡ كُذِّبَ رُسُلٌ مِّنۡ قَبۡلِكَ جَآءُوۡ بِالۡبَيِّنٰتِ وَالزُّبُرِ وَالۡكِتٰبِ الۡمُنِيۡرِ‏"
                    },
                    {
                        "num": 185,
                        "text": "كُلُّ نَفۡسٍ ذَآٮِٕقَةُ الۡمَوۡتِ​ؕ وَاِنَّمَا تُوَفَّوۡنَ اُجُوۡرَكُمۡ يَوۡمَ الۡقِيٰمَةِ​ؕ فَمَنۡ زُحۡزِحَ عَنِ النَّارِ وَاُدۡخِلَ الۡجَـنَّةَ فَقَدۡ فَازَ ​ؕ وَمَا الۡحَيٰوةُ الدُّنۡيَاۤ اِلَّا مَتَاعُ الۡغُرُوۡرِ‏"
                    },
                    {
                        "num": 186,
                        "text": "لَـتُبۡلَوُنَّ فِىۡۤ اَمۡوَالِكُمۡ وَاَنۡفُسِكُمۡ وَلَـتَسۡمَعُنَّ مِنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ مِنۡ قَبۡلِكُمۡ وَمِنَ الَّذِيۡنَ اَشۡرَكُوۡۤا اَذًى كَثِيۡـرًا​ؕ وَاِنۡ تَصۡبِرُوۡا وَتَتَّقُوۡا فَاِنَّ ذٰلِكَ مِنۡ عَزۡمِ الۡاُمُوۡرِ‏"
                    },
                    {
                        "num": 187,
                        "text": "وَاِذۡ اَخَذَ اللّٰهُ مِيۡثَاقَ الَّذِيۡنَ اُوۡتُوۡا الۡكِتٰبَ لَتُبَيِّنُنَّهٗ لِلنَّاسِ وَلَا تَكۡتُمُوۡنَهٗ فَنَبَذُوۡهُ وَرَآءَ ظُهُوۡرِهِمۡ وَ اشۡتَرَوۡا بِهٖ ثَمَنًا قَلِيۡلًاؕ فَبِئۡسَ مَا يَشۡتَرُوۡنَ‏"
                    },
                    {
                        "num": 188,
                        "text": "لَا تَحۡسَبَنَّ الَّذِيۡنَ يَفۡرَحُوۡنَ بِمَاۤ اَتَوْا وَّيُحِبُّوۡنَ اَنۡ يُّحۡمَدُوۡا بِمَا لَمۡ يَفۡعَلُوۡا فَلَا تَحۡسَبَنَّهُمۡ بِمَفَازَةٍ مِّنَ الۡعَذَابِ​ۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ‏"
                    },
                    {
                        "num": 189,
                        "text": "وَلِلّٰهِ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 190,
                        "text": "اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ لَاٰيٰتٍ لِّاُولِى الۡاَلۡبَابِ ۚۖ‏"
                    },
                    {
                        "num": 191,
                        "text": "الَّذِيۡنَ يَذۡكُرُوۡنَ اللّٰهَ قِيَامًا وَّقُعُوۡدًا وَّعَلٰى جُنُوۡبِهِمۡ وَيَتَفَكَّرُوۡنَ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ​ۚ رَبَّنَا مَا خَلَقۡتَ هٰذَا بَاطِلًا ۚ سُبۡحٰنَكَ فَقِنَا عَذَابَ النَّارِ‏"
                    },
                    {
                        "num": 192,
                        "text": "رَبَّنَاۤ اِنَّكَ مَنۡ تُدۡخِلِ النَّارَ فَقَدۡ اَخۡزَيۡتَهٗ ​ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ‏"
                    },
                    {
                        "num": 193,
                        "text": "رَبَّنَاۤ اِنَّنَا سَمِعۡنَا مُنَادِيًا يُّنَادِىۡ لِلۡاِيۡمَانِ اَنۡ اٰمِنُوۡا بِرَبِّكُمۡ فَاٰمَنَّا  ۖ رَبَّنَا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَكَفِّرۡ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الۡاَبۡرَارِ​ۚ‏"
                    },
                    {
                        "num": 194,
                        "text": "رَبَّنَا وَاٰتِنَا مَا وَعَدتَّنَا عَلٰى رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ الۡقِيٰمَةِ ​ؕ اِنَّكَ لَا تُخۡلِفُ الۡمِيۡعَادَ‏"
                    },
                    {
                        "num": 195,
                        "text": "فَاسۡتَجَابَ لَهُمۡ رَبُّهُمۡ اَنِّىۡ لَاۤ اُضِيۡعُ عَمَلَ عَامِلٍ مِّنۡكُمۡ مِّنۡ ذَكَرٍ اَوۡ اُنۡثٰى​​ۚ بَعۡضُكُمۡ مِّنۡۢ بَعۡضٍ​​ۚ فَالَّذِيۡنَ هَاجَرُوۡا وَاُخۡرِجُوۡا مِنۡ دِيَارِهِمۡ وَاُوۡذُوۡا فِىۡ سَبِيۡلِىۡ وَقٰتَلُوۡا وَقُتِلُوۡا لَاُكَفِّرَنَّ عَنۡهُمۡ سَيِّاٰتِهِمۡ وَلَاُدۡخِلَنَّهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ۚ ثَوَابًا مِّنۡ عِنۡدِ اللّٰهِ ​ؕ وَ اللّٰهُ عِنۡدَهٗ حُسۡنُ الثَّوَابِ‏"
                    },
                    {
                        "num": 196,
                        "text": "لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيۡنَ كَفَرُوۡا فِى الۡبِلَادِؕ‏"
                    },
                    {
                        "num": 197,
                        "text": "مَتَاعٌ قَلِيۡلٌ ثُمَّ مَاۡوٰٮهُمۡ جَهَنَّمُ​ؕ وَ بِئۡسَ الۡمِهَادُ‏"
                    },
                    {
                        "num": 198,
                        "text": "لٰكِنِ الَّذِيۡنَ اتَّقَوۡا رَبَّهُمۡ لَهُمۡ جَنّٰتٌ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا نُزُلًا مِّنۡ عِنۡدِ اللّٰهِ​ؕ وَمَا عِنۡدَ اللّٰهِ خَيۡرٌ لِّلۡاَبۡرَارِ‏"
                    },
                    {
                        "num": 199,
                        "text": "وَاِنَّ مِنۡ اَهۡلِ الۡكِتٰبِ لَمَنۡ يُّؤۡمِنُ بِاللّٰهِ وَمَاۤ اُنۡزِلَ اِلَيۡكُمۡ وَمَاۤ اُنۡزِلَ اِلَيۡهِمۡ خٰشِعِيۡنَ لِلّٰهِ ۙ لَا يَشۡتَرُوۡنَ بِاٰيٰتِ اللّٰهِ ثَمَنًا قَلِيۡلًا ​ؕ اُولٰٓٮِٕكَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ؕ اِنَّ اللّٰهَ سَرِيۡعُ الۡحِسَابِ‏"
                    },
                    {
                        "num": 200,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اصۡبِرُوۡا وَصَابِرُوۡا وَرَابِطُوۡا وَاتَّقُوا اللّٰهَ لَعَلَّكُمۡ تُفۡلِحُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "An-Nisa",
                "number": 4,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤـاَيُّهَا النَّاسُ اتَّقُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَةٍ وَّخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالًا كَثِيۡرًا وَّنِسَآءً​ ۚ وَاتَّقُوا اللّٰهَ الَّذِىۡ تَسَآءَلُوۡنَ بِهٖ وَالۡاَرۡحَامَ​ ؕ اِنَّ اللّٰهَ كَانَ عَلَيۡكُمۡ رَقِيۡبًا‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاٰ تُوا الۡيَتٰمٰٓى اَمۡوَالَهُمۡ​ وَلَا تَتَبَدَّلُوا الۡخَبِيۡثَ بِالطَّيِّبِ وَلَا تَاۡكُلُوۡۤا اَمۡوَالَهُمۡ​ اِلٰٓى اَمۡوَالِكُمۡ​ؕ اِنَّهٗ كَانَ حُوۡبًا كَبِيۡرًا‏‏ ﻿﻿"
                    },
                    {
                        "num": 3,
                        "text": "وَاِنۡ خِفۡتُمۡ اَلَّا تُقۡسِطُوۡا فِى الۡيَتٰمٰى فَانْكِحُوۡا مَا طَابَ لَـكُمۡ مِّنَ النِّسَآءِ مَثۡنٰى وَثُلٰثَ وَرُبٰعَ​ ​ۚ فَاِنۡ خِفۡتُمۡ اَلَّا تَعۡدِلُوۡا فَوَاحِدَةً اَوۡ مَا مَلَـكَتۡ اَيۡمَانُكُمۡ​ ؕ ذٰ لِكَ اَدۡنٰٓى اَلَّا تَعُوۡلُوۡا ؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاٰ تُوا النِّسَآءَ صَدُقٰتِهِنَّ نِحۡلَةً​  ؕ فَاِنۡ طِبۡنَ لَـكُمۡ عَنۡ شَىۡءٍ مِّنۡهُ نَفۡسًا فَكُلُوۡهُ هَنِيۡٓــًٔـا مَّرِیۡٓـــٴًﺎ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَلَا تُؤۡتُوا السُّفَهَآءَ اَمۡوَالَـكُمُ الَّتِىۡ جَعَلَ اللّٰهُ لَـكُمۡ قِيٰمًا وَّارۡزُقُوۡهُمۡ فِيۡهَا وَاكۡسُوۡهُمۡ وَقُوۡلُوۡا لَهُمۡ قَوۡلًا مَّعۡرُوۡفًا‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "وَابۡتَلُوا الۡيَتٰمٰى حَتّٰىۤ اِذَا بَلَغُوا النِّكَاحَ​ ۚ فَاِنۡ اٰنَسۡتُمۡ مِّنۡهُمۡ رُشۡدًا فَادۡفَعُوۡۤا اِلَيۡهِمۡ اَمۡوَالَهُمۡ​ۚ وَلَا تَاۡكُلُوۡهَاۤ اِسۡرَافًا وَّبِدَارًا اَنۡ يَّكۡبَرُوۡا​ ؕ وَمَنۡ كَانَ غَنِيًّا فَلۡيَسۡتَعۡفِفۡ​ ۚ وَمَنۡ كَانَ فَقِيۡرًا فَلۡيَاۡكُلۡ بِالۡمَعۡرُوۡفِ​ ؕ فَاِذَا دَفَعۡتُمۡ اِلَيۡهِمۡ اَمۡوَالَهُمۡ فَاَشۡهِدُوۡا عَلَيۡهِمۡ​ ؕ وَكَفٰى بِاللّٰهِ حَسِيۡبًا‏"
                    },
                    {
                        "num": 7,
                        "text": "لِلرِّجَالِ نَصِيۡبٌ مِّمَّا تَرَكَ الۡوَالِدٰنِ وَالۡاَقۡرَبُوۡنَ وَلِلنِّسَآءِ نَصِيۡبٌ مِّمَّا تَرَكَ الۡوَالِدٰنِ وَالۡاَقۡرَبُوۡنَ مِمَّا قَلَّ مِنۡهُ اَوۡ كَثُرَ ​ؕ نَصِيۡبًا مَّفۡرُوۡضًا‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاِذَا حَضَرَ الۡقِسۡمَةَ اُولُوا الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنُ فَارۡزُقُوۡهُمۡ مِّنۡهُ وَقُوۡلُوۡا لَهُمۡ قَوۡلًا مَّعۡرُوۡفًا‏"
                    },
                    {
                        "num": 9,
                        "text": "وَلۡيَخۡشَ الَّذِيۡنَ لَوۡ تَرَكُوۡا مِنۡ خَلۡفِهِمۡ ذُرِّيَّةً ضِعٰفًا خَافُوۡا عَلَيۡهِمۡ فَلۡيَتَّقُوا اللّٰهَ وَلۡيَقُوۡلُوا قَوۡلًا سَدِيۡدًا‏"
                    },
                    {
                        "num": 10,
                        "text": "اِنَّ الَّذِيۡنَ يَاۡكُلُوۡنَ اَمۡوَالَ الۡيَتٰمٰى ظُلۡمًا اِنَّمَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ نَارًا​ ؕ وَسَيَـصۡلَوۡنَ سَعِيۡرًا‏"
                    },
                    {
                        "num": 11,
                        "text": "يُوۡصِيۡكُمُ اللّٰهُ فِىۡۤ اَوۡلَادِكُمۡ​ لِلذَّكَرِ مِثۡلُ حَظِّ الۡاُنۡثَيَيۡنِ​ ۚ فَاِنۡ كُنَّ نِسَآءً فَوۡقَ اثۡنَتَيۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ​ ۚ وَاِنۡ كَانَتۡ وَاحِدَةً فَلَهَا النِّصۡفُ​ ؕ وَلِاَ بَوَيۡهِ لِكُلِّ وَاحِدٍ مِّنۡهُمَا السُّدُسُ مِمَّا تَرَكَ اِنۡ كَانَ لَهٗ وَلَدٌ ۚ فَاِنۡ لَّمۡ يَكُنۡ لَّهٗ وَلَدٌ وَّوَرِثَهٗۤ اَبَوٰهُ فَلِاُمِّهِ الثُّلُثُ​ ؕ فَاِنۡ كَانَ لَهٗۤ اِخۡوَةٌ فَلِاُمِّهِ السُّدُسُ مِنۡۢ بَعۡدِ وَصِيَّةٍ يُّوۡصِىۡ بِهَاۤ اَوۡ دَيۡنٍ​ ؕ اٰبَآؤُكُمۡ وَاَبۡنَآؤُكُمۡ ۚ لَا تَدۡرُوۡنَ اَيُّهُمۡ اَقۡرَبُ لَـكُمۡ نَفۡعًا​ ؕ فَرِيۡضَةً مِّنَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ كَانَ عَلِيۡمًا حَكِيۡمًا‏"
                    },
                    {
                        "num": 12,
                        "text": "وَلَـكُمۡ نِصۡفُ مَا تَرَكَ اَزۡوَاجُكُمۡ اِنۡ لَّمۡ يَكُنۡ لَّهُنَّ وَلَدٌ ۚ فَاِنۡ كَانَ لَهُنَّ وَلَدٌ فَلَـكُمُ الرُّبُعُ مِمَّا تَرَكۡنَ​ مِنۡۢ بَعۡدِ وَصِيَّةٍ يُّوۡصِيۡنَ بِهَاۤ اَوۡ دَ يۡنٍ​ ؕ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكۡتُمۡ اِنۡ لَّمۡ يَكُنۡ لَّكُمۡ وَلَدٌ ۚ فَاِنۡ كَانَ لَـكُمۡ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكۡتُمۡ​ مِّنۡۢ بَعۡدِ وَصِيَّةٍ تُوۡصُوۡنَ بِهَاۤ اَوۡ دَ يۡنٍ​ ؕ وَاِنۡ كَانَ رَجُلٌ يُّوۡرَثُ كَلٰلَةً اَوِ امۡرَاَةٌ وَّلَهٗۤ اَخٌ اَوۡ اُخۡتٌ فَلِكُلِّ وَاحِدٍ مِّنۡهُمَا السُّدُسُ​ ۚ فَاِنۡ كَانُوۡۤا اَكۡثَرَ مِنۡ ذٰ لِكَ فَهُمۡ شُرَكَآءُ فِى الثُّلُثِ مِنۡۢ بَعۡدِ وَصِيَّةٍ يُّوۡصٰى بِهَاۤ اَوۡ دَ يۡنٍ ۙ غَيۡرَ مُضَآرٍّ​ ۚ وَصِيَّةً مِّنَ اللّٰهِ​ ؕ وَاللّٰهُ عَلِيۡمٌ حَلِيۡمٌ ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "تِلۡكَ حُدُوۡدُ اللّٰهِ​ ؕ وَمَنۡ يُّطِعِ اللّٰهَ وَرَسُوۡلَهٗ يُدۡخِلۡهُ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا​ ؕ وَذٰ لِكَ الۡفَوۡزُ الۡعَظِيۡمُ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَمَنۡ يَّعۡصِ اللّٰهَ وَرَسُوۡلَهٗ وَيَتَعَدَّ حُدُوۡدَهٗ يُدۡخِلۡهُ نَارًا خَالِدًا فِيۡهَا وَلَهٗ عَذَابٌ مُّهِيۡنٌ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَالّٰتِىۡ يَاۡتِيۡنَ الۡفَاحِشَةَ مِنۡ نِّسَآٮِٕكُمۡ فَاسۡتَشۡهِدُوۡا عَلَيۡهِنَّ اَرۡبَعَةً مِّنۡكُمۡ​ ۚ فَاِنۡ شَهِدُوۡا فَاَمۡسِكُوۡهُنَّ فِى الۡبُيُوۡتِ حَتّٰى يَتَوَفّٰٮهُنَّ الۡمَوۡتُ اَوۡ يَجۡعَلَ اللّٰهُ لَهُنَّ سَبِيۡلًا‏"
                    },
                    {
                        "num": 16,
                        "text": "وَالَّذٰنِ يَاۡتِيٰنِهَا مِنۡكُمۡ فَاٰذُوۡهُمَا​ ۚ فَاِنۡ تَابَا وَاَصۡلَحَا فَاَعۡرِضُوۡا عَنۡهُمَا​ ؕ اِنَّ اللّٰهَ كَانَ تَوَّابًا رَّحِيۡمًا‏"
                    },
                    {
                        "num": 17,
                        "text": "اِنَّمَا التَّوۡبَةُ عَلَى اللّٰهِ لِلَّذِيۡنَ يَعۡمَلُوۡنَ السُّوۡٓءَ بِجَهَالَةٍ ثُمَّ يَتُوۡبُوۡنَ مِنۡ قَرِيۡبٍ فَاُولٰٓٮِٕكَ يَتُوۡبُ اللّٰهُ عَلَيۡهِمۡ​ؕ وَكَانَ اللّٰهُ عَلِيۡمًا حَكِيۡمًا‏"
                    },
                    {
                        "num": 18,
                        "text": "وَلَيۡسَتِ التَّوۡبَةُ لِلَّذِيۡنَ يَعۡمَلُوۡنَ السَّيِّاٰتِ​ ۚ حَتّٰۤى اِذَا حَضَرَ اَحَدَهُمُ الۡمَوۡتُ قَالَ اِنِّىۡ تُبۡتُ الۡـــٰٔنَ وَلَا الَّذِيۡنَ يَمُوۡتُوۡنَ وَهُمۡ كُفَّارٌ ​ؕ اُولٰٓٮِٕكَ اَعۡتَدۡنَا لَهُمۡ عَذَابًا اَ لِيۡمًا‏"
                    },
                    {
                        "num": 19,
                        "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا يَحِلُّ لَـكُمۡ اَنۡ تَرِثُوا النِّسَآءَ كَرۡهًا​ ؕ وَلَا تَعۡضُلُوۡهُنَّ لِتَذۡهَبُوۡا بِبَعۡضِ مَاۤ اٰتَيۡتُمُوۡهُنَّ اِلَّاۤ اَنۡ يَّاۡتِيۡنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ​ ۚ وَعَاشِرُوۡهُنَّ بِالۡمَعۡرُوۡفِ​ ۚ فَاِنۡ كَرِهۡتُمُوۡهُنَّ فَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡــًٔـا وَّيَجۡعَلَ اللّٰهُ فِيۡهِ خَيۡرًا كَثِيۡرًا‏"
                    },
                    {
                        "num": 20,
                        "text": "وَاِنۡ اَرَدتُّمُ اسۡتِبۡدَالَ زَوۡجٍ مَّكَانَ زَوۡجٍ ۙ وَّاٰتَيۡتُمۡ اِحۡدٰٮهُنَّ قِنۡطَارًا فَلَا تَاۡخُذُوۡا مِنۡهُ شَيۡـــًٔا​ ؕ اَ تَاۡخُذُوۡنَهٗ بُهۡتَانًا وَّاِثۡمًا مُّبِيۡنًا‏"
                    },
                    {
                        "num": 21,
                        "text": "وَ كَيۡفَ تَاۡخُذُوۡنَهٗ وَقَدۡ اَفۡضٰى بَعۡضُكُمۡ اِلٰى بَعۡضٍ وَّاَخَذۡنَ مِنۡكُمۡ مِّيۡثَاقًا غَلِيۡظًا‏"
                    },
                    {
                        "num": 22,
                        "text": "وَلَا تَنۡكِحُوۡا مَا نَكَحَ اٰبَآؤُكُمۡ مِّنَ النِّسَآءِ اِلَّا مَا قَدۡ سَلَفَ​ ؕ اِنَّهٗ كَانَ فَاحِشَةً وَّمَقۡتًا ؕ وَسَآءَ سَبِيۡلًا‏"
                    },
                    {
                        "num": 23,
                        "text": "حُرِّمَتۡ عَلَيۡكُمۡ اُمَّهٰتُكُمۡ وَبَنٰتُكُمۡ وَاَخَوٰتُكُمۡ وَعَمّٰتُكُمۡ وَخٰلٰتُكُمۡ وَبَنٰتُ الۡاٰخِ وَبَنٰتُ الۡاُخۡتِ وَاُمَّهٰتُكُمُ الّٰتِىۡۤ اَرۡضَعۡنَكُمۡ وَاَخَوٰتُكُمۡ مِّنَ الرَّضَاعَةِ وَ اُمَّهٰتُ نِسَآٮِٕكُمۡ وَرَبَآٮِٕبُكُمُ الّٰتِىۡ فِىۡ حُجُوۡرِكُمۡ مِّنۡ نِّسَآٮِٕكُمُ الّٰتِىۡ دَخَلۡتُمۡ بِهِنَّ فَاِنۡ لَّمۡ تَكُوۡنُوۡا دَخَلۡتُمۡ بِهِنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ وَحَلَاۤٮِٕلُ اَبۡنَآٮِٕكُمُ الَّذِيۡنَ مِنۡ اَصۡلَابِكُمۡۙ وَاَنۡ تَجۡمَعُوۡا بَيۡنَ الۡاُخۡتَيۡنِ اِلَّا مَا قَدۡ سَلَفَ​ؕ اِنَّ اللّٰهَ كَانَ غَفُوۡرًا رَّحِيۡمًا ۙ‏"
                    }
                ]
            }
        ]
    },
    "27": {
        "name": "Juz 27",
        "surahs": [
            {
                "surah": "Adz-Dzariyat",
                "number": 51,
                "ayahs": [
                    {
                        "num": 31,
                        "text": "قَالَ فَمَا خَطۡبُكُمۡ اَيُّهَا الۡمُرۡسَلُوۡنَ‏"
                    },
                    {
                        "num": 32,
                        "text": "قَالُـوۡۤا اِنَّاۤ اُرۡسِلۡنَاۤ اِلٰى قَوۡمٍ مُّجۡرِمِيۡنَۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "لِنُرۡسِلَ عَلَيۡهِمۡ حِجَارَةً مِّنۡ طِيۡنٍۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "مُّسَوَّمَةً عِنۡدَ رَبِّكَ لِلۡمُسۡرِفِيۡنَ‏"
                    },
                    {
                        "num": 35,
                        "text": "فَاَخۡرَجۡنَا مَنۡ كَانَ فِيۡهَا مِنَ الۡمُؤۡمِنِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 36,
                        "text": "فَمَا وَجَدۡنَا فِيۡهَا غَيۡرَ بَيۡتٍ مِّنَ الۡمُسۡلِمِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 37,
                        "text": "وَتَرَكۡنَا فِيۡهَاۤ اٰيَةً لِّـلَّذِيۡنَ يَخَافُوۡنَ الۡعَذَابَ الۡاَلِيۡمَؕ‏ ﻿﻿"
                    },
                    {
                        "num": 38,
                        "text": "وَفِىۡ مُوۡسٰۤی اِذۡ اَرۡسَلۡنٰهُ اِلٰى فِرۡعَوۡنَ بِسُلۡطٰنٍ مُّبِيۡنٍ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَتَوَلّٰى بِرُكۡنِهٖ وَقَالَ سٰحِرٌ اَوۡ مَجۡنُوۡنٌ‏"
                    },
                    {
                        "num": 40,
                        "text": "فَاَخَذۡنٰهُ وَجُنُوۡدَهٗ فَنَبَذۡنٰهُمۡ فِى الۡيَمِّ وَهُوَ مُلِيۡمٌؕ‏"
                    },
                    {
                        "num": 41,
                        "text": "وَفِىۡ عَادٍ اِذۡ اَرۡسَلۡنَا عَلَيۡهِمُ الرِّيۡحَ الۡعَقِيۡمَ​ۚ‏"
                    },
                    {
                        "num": 42,
                        "text": "مَا تَذَرُ مِنۡ شَىۡءٍ اَتَتۡ عَلَيۡهِ اِلَّا جَعَلَتۡهُ كَالرَّمِيۡمِؕ‏"
                    },
                    {
                        "num": 43,
                        "text": "وَفِىۡ ثَمُوۡدَ اِذۡ قِيۡلَ لَهُمۡ تَمَتَّعُوۡا حَتّٰى حِيۡنٍ‏"
                    },
                    {
                        "num": 44,
                        "text": "فَعَتَوۡا عَنۡ اَمۡرِ رَبِّهِمۡ فَاَخَذَتۡهُمُ الصّٰعِقَةُ وَ هُمۡ يَنۡظُرُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 45,
                        "text": "فَمَا اسۡتَطَاعُوۡا مِنۡ قِيَامٍ وَّمَا كَانُوۡا مُنۡتَصِرِيۡنَۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "وَقَوۡمَ نُوۡحٍ مِّنۡ قَبۡلُ​ؕ اِنَّهُمۡ كَانُوۡا قَوۡمًا فٰسِقِيۡنَ‏"
                    },
                    {
                        "num": 47,
                        "text": "وَ السَّمَآءَ بَنَيۡنٰهَا بِاَيۡٮدٍ وَّاِنَّا لَمُوۡسِعُوۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَالۡاَرۡضَ فَرَشۡنٰهَا فَنِعۡمَ الۡمٰهِدُوۡنَ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَمِنۡ كُلِّ شَىۡءٍ خَلَقۡنَا زَوۡجَيۡنِ لَعَلَّكُمۡ تَذَكَّرُوۡنَ‏"
                    },
                    {
                        "num": 50,
                        "text": "فَفِرُّوۡۤا اِلَى اللّٰهِ​ؕ اِنِّىۡ لَـكُمۡ مِّنۡهُ نَذِيۡرٌ مُّبِيۡنٌ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 51,
                        "text": "وَلَا تَجۡعَلُوۡا مَعَ اللّٰهِ اِلٰهًا اٰخَرَ​ؕ اِنِّىۡ لَـكُمۡ مِّنۡهُ نَذِيۡرٌ مُّبِيۡنٌ​ۚ‏"
                    },
                    {
                        "num": 52,
                        "text": "كَذٰلِكَ مَاۤ اَتَى الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّنۡ رَّسُوۡلٍ اِلَّا قَالُوۡا سَاحِرٌ اَوۡ مَجۡنُوۡنٌ​ۚ‏"
                    },
                    {
                        "num": 53,
                        "text": "اَتَوَاصَوۡا بِهٖ​ۚ بَلۡ هُمۡ قَوۡمٌ طَاغُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 54,
                        "text": "فَتَوَلَّ عَنۡهُمۡ فَمَاۤ اَنۡتَ بِمَلُوۡمٍ‏"
                    },
                    {
                        "num": 55,
                        "text": "وَّذَكِّرۡ فَاِنَّ الذِّكۡرٰى تَنۡفَعُ الۡمُؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 56,
                        "text": "وَمَا خَلَقۡتُ الۡجِنَّ وَالۡاِنۡسَ اِلَّا لِيَعۡبُدُوۡنِ‏"
                    },
                    {
                        "num": 57,
                        "text": "مَاۤ اُرِيۡدُ مِنۡهُمۡ مِّنۡ رِّزۡقٍ وَّمَاۤ اُرِيۡدُ اَنۡ يُّطۡعِمُوۡنِ‏ ﻿﻿"
                    },
                    {
                        "num": 58,
                        "text": "اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الۡقُوَّةِ الۡمَتِيۡنُ‏"
                    },
                    {
                        "num": 59,
                        "text": "فَاِنَّ لِلَّذِيۡنَ ظَلَمُوۡا ذَنُوۡبًا مِّثۡلَ ذَنُوۡبِ اَصۡحٰبِهِمۡ فَلَا يَسۡتَعۡجِلُوۡنِ‏"
                    },
                    {
                        "num": 60,
                        "text": "فَوَيۡلٌ لِّـلَّذِيۡنَ كَفَرُوۡا مِنۡ يَّوۡمِهِمُ الَّذِىۡ يُوۡعَدُوۡنَ‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "At-Tur",
                "number": 52,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالطُّوۡرِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَكِتٰبٍ مَّسۡطُوۡرٍۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "فِىۡ رَقٍّ مَّنۡشُوۡرٍۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالۡبَيۡتِ الۡمَعۡمُوۡرِۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَالسَّقۡفِ الۡمَرۡفُوۡعِۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَالۡبَحۡرِ الۡمَسۡجُوۡرِۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِنَّ عَذَابَ رَبِّكَ لوَاقِعٌ ۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "مَّا لَهٗ مِنۡ دَافِعٍۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "يَّوۡمَ تَمُوۡرُ السَّمَآءُ مَوۡرًا ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَّتَسِيۡرُ الۡجِبَالُ سَيۡرًا ؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "فَوَيۡلٌ يَّوۡمَٮِٕذٍ لِّـلۡمُكَذِّبِيۡنَۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "الَّذِيۡنَ هُمۡ فِىۡ خَوۡضٍ يَّلۡعَبُوۡنَ​ۘ‏"
                    },
                    {
                        "num": 13,
                        "text": "يَوۡمَ يُدَعُّوۡنَ اِلٰى نَارِ جَهَنَّمَ دَعًّاؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "هٰذِهِ النَّارُ الَّتِىۡ كُنۡتُمۡ بِهَا تُكَذِّبُوۡنَ‏"
                    },
                    {
                        "num": 15,
                        "text": "اَفَسِحۡرٌ هٰذَاۤ اَمۡ اَنۡتُمۡ لَا تُبۡصِرُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 16,
                        "text": "اِصۡلَوۡهَا فَاصۡبِرُوۡۤا اَوۡ لَا تَصۡبِرُوۡا​ۚ سَوَآءٌ عَلَيۡكُمۡ​ؕ اِنَّمَا تُجۡزَوۡنَ مَا كُنۡتُمۡ تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِنَّ الۡمُتَّقِيۡنَ فِىۡ جَنّٰتٍ وَّنَعِيۡمٍۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "فٰكِهِيۡنَ بِمَاۤ اٰتٰٮهُمۡ رَبُّهُمۡ​ۚ وَوَقٰٮهُمۡ رَبُّهُمۡ عَذَابَ الۡجَحِيۡمِ‏ ﻿﻿"
                    },
                    {
                        "num": 19,
                        "text": "كُلُوۡا وَاشۡرَبُوۡا هَـنِٓـيـْئًا ۢ بِمَا كُنۡـتُمۡ تَعۡمَلُوۡنَۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "مُتَّكِـــِٕيۡنَ عَلٰى سُرُرٍ مَّصۡفُوۡفَةٍ​ ۚ وَزَوَّجۡنٰهُمۡ بِحُوۡرٍ عِيۡنٍ‏ ﻿﻿"
                    },
                    {
                        "num": 21,
                        "text": "وَالَّذِيۡنَ اٰمَنُوۡا وَاتَّبَعَتۡهُمۡ ذُرِّيَّتُهُمۡ بِاِيۡمَانٍ اَلۡحَـقۡنَا بِهِمۡ ذُرِّيَّتَهُمۡ وَمَاۤ اَلَـتۡنٰهُمۡ مِّنۡ عَمَلِهِمۡ مِّنۡ شَىۡءٍ​ؕ كُلُّ امۡرِیءٍۢ بِمَا كَسَبَ رَهِيۡنٌ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَاَمۡدَدۡنٰهُمۡ بِفَاكِهَةٍ وَّلَحۡمٍ مِّمَّا يَشۡتَهُوۡنَ‏"
                    },
                    {
                        "num": 23,
                        "text": "يَـتَـنَازَعُوۡنَ فِيۡهَا كَاۡسًا لَّا لَغۡوٌ فِيۡهَا وَلَا تَاۡثِيۡمٌ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَيَطُوۡفُ عَلَيۡهِمۡ غِلۡمَانٌ لَّهُمۡ كَاَنَّهُمۡ لُـؤۡلُـؤٌ مَّكۡنُوۡنٌ‏ ﻿﻿"
                    },
                    {
                        "num": 25,
                        "text": "وَاَقۡبَلَ بَعۡضُهُمۡ عَلٰى بَعۡضٍ يَّتَسَآءَلُوۡنَ‏"
                    },
                    {
                        "num": 26,
                        "text": "قَالُـوۡۤا اِنَّا كُـنَّا قَبۡلُ فِىۡۤ اَهۡلِنَا مُشۡفِقِيۡنَ‏"
                    },
                    {
                        "num": 27,
                        "text": "فَمَنَّ اللّٰهُ عَلَيۡنَا وَوَقٰٮنَا عَذَابَ السَّمُوۡمِ‏"
                    },
                    {
                        "num": 28,
                        "text": "اِنَّا كُـنَّا مِنۡ قَبۡلُ نَدۡعُوۡهُ​ ؕ اِنَّهٗ هُوَ الۡبَـرُّ الرَّحِيۡمُ‏ ﻿﻿"
                    },
                    {
                        "num": 29,
                        "text": "فَذَكِّرۡ فَمَاۤ اَنۡتَ بِنِعۡمَتِ رَبِّكَ بِكَاهِنٍ وَّلَا مَجۡنُوۡنٍؕ‏"
                    },
                    {
                        "num": 30,
                        "text": "اَمۡ يَقُوۡلُوۡنَ شَاعِرٌ نَّتَـرَبَّصُ بِهٖ رَيۡبَ الۡمَنُوۡنِ‏"
                    },
                    {
                        "num": 31,
                        "text": "قُلۡ تَرَبَّصُوۡا فَاِنِّىۡ مَعَكُمۡ مِّنَ الۡمُتَـرَبِّصِيۡنَ ؕ‏"
                    },
                    {
                        "num": 32,
                        "text": "اَمۡ تَاۡمُرُهُمۡ اَحۡلَامُهُمۡ بِهٰذَآ​ اَمۡ هُمۡ قَوۡمٌ طَاغُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 33,
                        "text": "اَمۡ يَقُوۡلُوۡنَ تَقَوَّلَهٗ​ ۚ بَلْ لَّا يُؤۡمِنُوۡنَ​ ۚ‏"
                    },
                    {
                        "num": 34,
                        "text": "فَلۡيَاۡتُوۡا بِحَدِيۡثٍ مِّثۡلِهٖۤ اِنۡ كَانُوۡا صٰدِقِيۡنَؕ‏"
                    },
                    {
                        "num": 35,
                        "text": "اَمۡ خُلِقُوۡا مِنۡ غَيۡرِ شَىۡءٍ اَمۡ هُمُ الۡخٰلِقُوۡنَؕ‏"
                    },
                    {
                        "num": 36,
                        "text": "اَمۡ خَلَـقُوا السَّمٰوٰتِ وَالۡاَرۡضَ​ۚ بَلْ لَّا يُوۡقِنُوۡنَؕ‏"
                    },
                    {
                        "num": 37,
                        "text": "اَمۡ عِنۡدَهُمۡ خَزَآٮِٕنُ رَبِّكَ اَمۡ هُمُ الۡمُصَۜيۡطِرُوۡنَؕ‏"
                    },
                    {
                        "num": 38,
                        "text": "اَمۡ لَهُمۡ سُلَّمٌ يَّسۡتَمِعُوۡنَ فِيۡهِ​ ۚ فَلۡيَاۡتِ مُسۡتَمِعُهُمۡ بِسُلۡطٰنٍ مُّبِيۡنٍؕ‏"
                    },
                    {
                        "num": 39,
                        "text": "اَمۡ لَـهُ الۡبَنٰتُ وَلَـكُمُ الۡبَنُوۡنَؕ‏"
                    },
                    {
                        "num": 40,
                        "text": "اَمۡ تَسۡـَٔـلُهُمۡ اَجۡرًا فَهُمۡ مِّنۡ مَّغۡرَمٍ مُّثۡقَلُوۡنَؕ‏"
                    },
                    {
                        "num": 41,
                        "text": "اَمۡ عِنۡدَهُمُ الۡغَيۡبُ فَهُمۡ يَكۡتُبُوۡنَؕ‏"
                    },
                    {
                        "num": 42,
                        "text": "اَمۡ يُرِيۡدُوۡنَ كَيۡدًا​ؕ فَالَّذِيۡنَ كَفَرُوۡا هُمُ الۡمَكِيۡدُوۡنَؕ‏ ﻿﻿"
                    },
                    {
                        "num": 43,
                        "text": "اَمۡ لَهُمۡ اِلٰهٌ غَيۡرُ اللّٰهِ​ؕ سُبۡحٰنَ اللّٰهِ عَمَّا يُشۡرِكُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 44,
                        "text": "وَاِنۡ يَّرَوۡا كِسۡفًا مِّنَ السَّمَآءِ سَاقِطًا يَّقُوۡلُوۡا سَحَابٌ مَّرۡكُوۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 45,
                        "text": "فَذَرۡهُمۡ حَتّٰى يُلٰقُوۡا يَوۡمَهُمُ الَّذِىۡ فِيۡهِ يُصۡعَقُوۡنَۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "يَوۡمَ لَا يُغۡنِىۡ عَنۡهُمۡ كَيۡدُهُمۡ شَيۡـًٔـا وَّلَا هُمۡ يُنۡصَرُوۡنَؕ‏ ﻿﻿"
                    },
                    {
                        "num": 47,
                        "text": "وَاِنَّ لِلَّذِيۡنَ ظَلَمُوۡا عَذَابًا دُوۡنَ ذٰلِكَ وَلٰـكِنَّ اَكۡثَرَهُمۡ لَا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَاصۡبِرۡ لِحُكۡمِ رَبِّكَ فَاِنَّكَ بِاَعۡيُنِنَا​ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِيۡنَ تَقُوۡمُۙ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَمِنَ الَّيۡلِ فَسَبِّحۡهُ وَاِدۡبَارَ النُّجُوۡمِ‏"
                    }
                ]
            },
            {
                "surah": "An-Najm",
                "number": 53,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالنَّجۡمِ اِذَا هَوٰىۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَا ضَلَّ صَاحِبُكُمۡ وَمَا غَوٰى​ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمَا يَنۡطِقُ عَنِ الۡهَوٰىؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنۡ هُوَ اِلَّا وَحۡىٌ يُّوۡحٰىۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "عَلَّمَهٗ شَدِيۡدُ الۡقُوٰىۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "ذُوۡ مِرَّةٍؕ فَاسۡتَوٰىۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَهُوَ بِالۡاُفُقِ الۡاَعۡلٰى ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "ثُمَّ دَنَا فَتَدَلّٰىۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "فَكَانَ قَابَ قَوۡسَيۡنِ اَوۡ اَدۡنٰى​ۚ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَاَوۡحٰۤى الٰى عَبۡدِهٖ مَاۤ اَوۡحٰىؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "مَا كَذَبَ الۡفُؤَادُ مَا رَاٰى‏"
                    },
                    {
                        "num": 12,
                        "text": "اَفَتُمٰرُوۡنَهٗ عَلٰى مَا يَرٰى‏"
                    },
                    {
                        "num": 13,
                        "text": "وَلَقَدۡ رَاٰهُ نَزۡلَةً اُخۡرٰىۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "عِنۡدَ سِدۡرَةِ الۡمُنۡتَهٰى‏"
                    },
                    {
                        "num": 15,
                        "text": "عِنۡدَهَا جَنَّةُ الۡمَاۡوٰىؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "اِذۡ يَغۡشَى السِّدۡرَةَ مَا يَغۡشٰىۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "مَا زَاغَ الۡبَصَرُ وَمَا طَغٰى‏"
                    },
                    {
                        "num": 18,
                        "text": "لَقَدۡ رَاٰى مِنۡ اٰيٰتِ رَبِّهِ الۡكُبۡرٰى‏"
                    },
                    {
                        "num": 19,
                        "text": "اَفَرَءَيۡتُمُ اللّٰتَ وَالۡعُزّٰىۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَمَنٰوةَ الثَّالِثَةَ الۡاُخۡرٰى‏"
                    },
                    {
                        "num": 21,
                        "text": "اَلَـكُمُ الذَّكَرُ وَلَهُ الۡاُنۡثٰى‏"
                    },
                    {
                        "num": 22,
                        "text": "تِلۡكَ اِذًا قِسۡمَةٌ ضِيۡزٰى‏"
                    },
                    {
                        "num": 23,
                        "text": "اِنۡ هِىَ اِلَّاۤ اَسۡمَآءٌ سَمَّيۡتُمُوۡهَاۤ اَنۡتُمۡ وَاٰبَآؤُكُمۡ مَّاۤ اَنۡزَلَ اللّٰهُ بِهَا مِنۡ سُلۡطٰنٍ​ؕ اِنۡ يَّتَّبِعُوۡنَ اِلَّا الظَّنَّ وَمَا تَهۡوَى الۡاَنۡفُسُ​ۚ وَلَقَدۡ جَآءَهُمۡ مِّنۡ رَّبِّهِمُ الۡهُدٰىؕ‏"
                    },
                    {
                        "num": 24,
                        "text": "اَمۡ لِلۡاِنۡسَانِ مَا تَمَنّٰى   ۖ‏"
                    },
                    {
                        "num": 25,
                        "text": "فَلِلّٰهِ الۡاٰخِرَةُ وَالۡاُوۡلٰى‏"
                    },
                    {
                        "num": 26,
                        "text": "وَكَمۡ مِّنۡ مَّلَكٍ فِى السَّمٰوٰتِ لَا تُغۡنِىۡ شَفَاعَتُهُمۡ شَيۡــًٔــا اِلَّا مِنۡۢ بَعۡدِ اَنۡ يَّاۡذَنَ اللّٰهُ لِمَنۡ يَّشَآءُ وَيَرۡضٰى‏"
                    },
                    {
                        "num": 27,
                        "text": "اِنَّ الَّذِيۡنَ لَا يُؤۡمِنُوۡنَ بِالۡاٰخِرَةِ لَيُسَمُّوۡنَ الۡمَلٰٓٮِٕكَةَ تَسۡمِيَةَ الۡاُنۡثٰى‏"
                    },
                    {
                        "num": 28,
                        "text": "وَمَا لَهُمۡ بِهٖ مِنۡ عِلۡمٍ​ؕ اِنۡ يَّتَّبِعُوۡنَ اِلَّا الظَّنَّ​ۚ وَاِنَّ الظَّنَّ لَا يُغۡنِىۡ مِنَ الۡحَـقِّ شَيۡـًٔـاۚ‏"
                    },
                    {
                        "num": 29,
                        "text": "فَاَعۡرِضۡ عَنۡ مَّنۡ تَوَلّٰى ۙ عَنۡ ذِكۡرِنَا وَلَمۡ يُرِدۡ اِلَّا الۡحَيٰوةَ الدُّنۡيَا ؕ‏"
                    },
                    {
                        "num": 30,
                        "text": "ذٰ لِكَ مَبۡلَـغُهُمۡ مِّنَ الۡعِلۡمِ​ ؕ اِنَّ رَبَّكَ هُوَ اَعۡلَمُ بِمَنۡ ضَلَّ عَنۡ سَبِيۡلِهٖ ۙ وَهُوَ اَعۡلَمُ بِمَنِ اهۡتَدٰى‏"
                    },
                    {
                        "num": 31,
                        "text": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِۙ لِيَجۡزِىَ الَّذِيۡنَ اَسَآءُوۡا بِمَا عَمِلُوۡا وَيَجۡزِىَ الَّذِيۡنَ اَحۡسَنُوۡا بِالۡحُسۡنٰى​ ۚ‏"
                    },
                    {
                        "num": 32,
                        "text": "اَلَّذِيۡنَ يَجۡتَنِبُوۡنَ كَبٰٓٮِٕرَ الۡاِثۡمِ وَالۡفوَاحِشَ اِلَّا اللَّمَمَ​ؕ اِنَّ رَبَّكَ وَاسِعُ الۡمَغۡفِرَةِ​ؕ هُوَ اَعۡلَمُ بِكُمۡ اِذۡ اَنۡشَاَكُمۡ مِّنَ الۡاَرۡضِ وَاِذۡ اَنۡتُمۡ اَجِنَّةٌ فِىۡ بُطُوۡنِ اُمَّهٰتِكُمۡ​ۚ فَلَا تُزَكُّوۡۤا اَنۡفُسَكُمۡ​ ؕ هُوَ اَعۡلَمُ بِمَنِ اتَّقٰى‏"
                    },
                    {
                        "num": 33,
                        "text": "اَفَرَءَيۡتَ الَّذِىۡ تَوَلّٰىۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَاَعۡطٰى قَلِيۡلًا وَّاَكۡدٰى‏"
                    },
                    {
                        "num": 35,
                        "text": "اَعِنۡدَهٗ عِلۡمُ الۡغَيۡبِ فَهُوَ يَرٰى‏"
                    },
                    {
                        "num": 36,
                        "text": "اَمۡ لَمۡ يُنَبَّاۡ بِمَا فِىۡ صُحُفِ مُوۡسٰىۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "وَاِبۡرٰهِيۡمَ الَّذِىۡ وَفّٰىٓ  ۙ‏"
                    },
                    {
                        "num": 38,
                        "text": "اَلَّا تَزِرُ وَازِرَةٌ وِّزۡرَ اُخۡرٰىۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "وَاَنۡ لَّيۡسَ لِلۡاِنۡسَانِ اِلَّا مَا سَعٰىۙ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَاَنَّ سَعۡيَهٗ سَوۡفَ يُرٰى‏"
                    },
                    {
                        "num": 41,
                        "text": "ثُمَّ يُجۡزٰٮهُ الۡجَزَآءَ الۡاَوۡفٰىۙ‏"
                    },
                    {
                        "num": 42,
                        "text": "وَاَنَّ اِلٰى رَبِّكَ الۡمُنۡتَهٰىۙ‏"
                    },
                    {
                        "num": 43,
                        "text": "وَاَنَّهٗ هُوَ اَضۡحَكَ وَاَبۡكٰىۙ‏"
                    },
                    {
                        "num": 44,
                        "text": "وَاَنَّهٗ هُوَ اَمَاتَ وَ اَحۡيَا ۙ‏"
                    },
                    {
                        "num": 45,
                        "text": "وَاَنَّهٗ خَلَقَ الزَّوۡجَيۡنِ الذَّكَرَ وَالۡاُنۡثٰىۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "مِنۡ نُّطۡفَةٍ اِذَا تُمۡنٰى‏"
                    },
                    {
                        "num": 47,
                        "text": "وَاَنَّ عَلَيۡهِ النَّشۡاَةَ الۡاُخۡرٰىۙ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَاَنَّهٗ هُوَ اَغۡنٰى وَ اَقۡنٰىۙ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَاَنَّهٗ هُوَ رَبُّ الشِّعۡرٰىۙ‏"
                    },
                    {
                        "num": 50,
                        "text": "وَاَنَّهٗۤ اَهۡلَكَ عَادَا۟ اۨلۡـٮُٔـوْلٰى ۙ‏"
                    },
                    {
                        "num": 51,
                        "text": "وَثَمُوۡدَا۟ فَمَاۤ اَبۡقٰىۙ‏"
                    },
                    {
                        "num": 52,
                        "text": "وَقَوۡمَ نُوۡحٍ مِّنۡ قَبۡلُ​ؕ اِنَّهُمۡ كَانُوۡا هُمۡ اَظۡلَمَ وَاَطۡغٰىؕ‏ ﻿﻿"
                    },
                    {
                        "num": 53,
                        "text": "وَالۡمُؤۡتَفِكَةَ اَهۡوٰىۙ‏"
                    },
                    {
                        "num": 54,
                        "text": "فَغَشّٰٮهَا مَا غَشّٰى​ۚ‏"
                    },
                    {
                        "num": 55,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكَ تَتَمَارٰى‏"
                    },
                    {
                        "num": 56,
                        "text": "هٰذَا نَذِيۡرٌ مِّنَ النُّذُرِ الۡاُوۡلٰٓى‏"
                    },
                    {
                        "num": 57,
                        "text": "اَزِفَتِ الۡاٰزِفَةُ​ۚ‏"
                    },
                    {
                        "num": 58,
                        "text": "لَيۡسَ لَهَا مِنۡ دُوۡنِ اللّٰهِ كَاشِفَةٌ ؕ‏"
                    },
                    {
                        "num": 59,
                        "text": "اَفَمِنۡ هٰذَا الۡحَدِيۡثِ تَعۡجَبُوۡنَۙ‏"
                    },
                    {
                        "num": 60,
                        "text": "وَتَضۡحَكُوۡنَ وَلَا تَبۡكُوۡنَۙ‏"
                    },
                    {
                        "num": 61,
                        "text": "وَاَنۡتُمۡ سٰمِدُوۡنَ‏"
                    },
                    {
                        "num": 62,
                        "text": "فَاسۡجُدُوۡا لِلّٰهِ وَاعۡبُدُوۡا ۩‏"
                    }
                ]
            },
            {
                "surah": "Al-Qamar",
                "number": 54,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِقۡتَـرَبَتِ السَّاعَةُ وَانْشَقَّ الۡقَمَرُ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاِنۡ يَّرَوۡا اٰيَةً يُّعۡرِضُوۡا وَيَقُوۡلُوۡا سِحۡرٌ مُّسۡتَمِرٌّ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَكَذَّبُوۡا وَاتَّبَعُوۡۤا اَهۡوَآءَهُمۡ​ وَكُلُّ اَمۡرٍ مُّسۡتَقِرٌّ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَلَقَدۡ جَآءَهُمۡ مِّنَ الۡاَنۡۢبَآءِ مَا فِيۡهِ مُزۡدَجَرٌۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "حِكۡمَةٌ ۢ بَالِغَةٌ​ فَمَا تُغۡنِ النُّذُرُۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "فَتَوَلَّ عَنۡهُمۡ​ۘ يَوۡمَ يَدۡعُ الدَّاعِ اِلٰى شَىۡءٍ نُّكُرٍۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "خُشَّعًا اَبۡصَارُهُمۡ يَخۡرُجُوۡنَ مِنَ الۡاَجۡدَاثِ كَاَنَّهُمۡ جَرَادٌ مُّنۡتَشِرٌۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "مُّهۡطِعِيۡنَ اِلَى الدَّاعِ​ؕ يَقُوۡلُ الۡكٰفِرُوۡنَ هٰذَا يَوۡمٌ عَسِرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 9,
                        "text": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوۡحٍ فَكَذَّبُوۡا عَبۡدَنَا وَقَالُوۡا مَجۡنُوۡنٌ وَّازۡدُجِرَ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَدَعَا رَبَّهٗۤ اَنِّىۡ مَغۡلُوۡبٌ فَانْـتَصِرۡ‏"
                    },
                    {
                        "num": 11,
                        "text": "فَفَتَحۡنَاۤ اَبۡوَابَ السَّمَآءِ بِمَآءٍ مُّنۡهَمِرٍ ۖ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّفَجَّرۡنَا الۡاَرۡضَ عُيُوۡنًا فَالۡتَقَى الۡمَآءُ عَلٰٓى اَمۡرٍ قَدۡ قُدِرَ​ۚ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَحَمَلۡنٰهُ عَلٰى ذَاتِ اَلۡوَاحٍ وَّدُسُرٍۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "تَجۡرِىۡ بِاَعۡيُنِنَا​ۚ جَزَآءً لِّمَنۡ كَانَ كُفِرَ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَلَقَدْ تَّرَكۡنٰهَاۤ اٰيَةً فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَكَيۡفَ كَانَ عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَلَقَدۡ يَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّكۡرِ فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 18,
                        "text": "كَذَّبَتۡ عَادٌ فَكَيۡفَ كَانَ عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 19,
                        "text": "اِنَّاۤ اَرۡسَلۡنَا عَلَيۡهِمۡ رِيۡحًا صَرۡصَرًا فِىۡ يَوۡمِ نَحۡسٍ مُّسۡتَمِرٍّۙ‏ ﻿﻿"
                    },
                    {
                        "num": 20,
                        "text": "تَنۡزِعُ النَّاسَۙ كَاَنَّهُمۡ اَعۡجَازُ نَخۡلٍ مُّنۡقَعِرٍ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَكَيۡفَ كَانَ عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَلَقَدۡ يَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّكۡرِ فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 23,
                        "text": "كَذَّبَتۡ ثَمُوۡدُ بِالنُّذُرِ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَقَالُـوۡۤا اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهٗۤ ۙ اِنَّاۤ اِذًا لَّفِىۡ ضَلٰلٍ وَّسُعُرٍ‏"
                    },
                    {
                        "num": 25,
                        "text": "ءَاُلۡقِىَ الذِّكۡرُ عَلَيۡهِ مِنۡۢ بَيۡنِنَا بَلۡ هُوَ كَذَّابٌ اَشِرٌ‏"
                    },
                    {
                        "num": 26,
                        "text": "سَيَعۡلَمُوۡنَ غَدًا مَّنِ الۡكَذَّابُ الۡاَشِرُ‏"
                    },
                    {
                        "num": 27,
                        "text": "اِنَّا مُرۡسِلُوا النَّاقَةِ فِتۡنَةً لَّهُمۡ فَارۡتَقِبۡهُمۡ وَاصۡطَبِرۡ‏ ﻿﻿"
                    },
                    {
                        "num": 28,
                        "text": "وَنَبِّئۡهُمۡ اَنَّ الۡمَآءَ قِسۡمَةٌ ۢ بَيۡنَهُمۡ​ۚ كُلُّ شِرۡبٍ مُّحۡتَضَرٌ‏ ﻿﻿"
                    },
                    {
                        "num": 29,
                        "text": "فَنَادَوۡا صَاحِبَهُمۡ فَتَعَاطٰى فَعَقَرَ‏"
                    },
                    {
                        "num": 30,
                        "text": "فَكَيۡفَ كَانَ عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 31,
                        "text": "اِنَّاۤ اَرۡسَلۡنَا عَلَيۡهِمۡ صَيۡحَةً وَّاحِدَةً فَكَانُوۡا كَهَشِيۡمِ الۡمُحۡتَظِرِ‏ ﻿﻿"
                    },
                    {
                        "num": 32,
                        "text": "وَلَقَدۡ يَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّكۡرِ فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 33,
                        "text": "كَذَّبَتۡ قَوۡمُ لُوۡطٍ ۢ بِالنُّذُرِ‏"
                    },
                    {
                        "num": 34,
                        "text": "اِنَّاۤ اَرۡسَلۡنَا عَلَيۡهِمۡ حَاصِبًا اِلَّاۤ اٰلَ لُوۡطٍ​ؕ نَّجَّيۡنٰهُمۡ بِسَحَرٍۙ‏"
                    },
                    {
                        "num": 35,
                        "text": "نِّعۡمَةً مِّنۡ عِنۡدِنَا​ؕ كَذٰلِكَ نَجۡزِىۡ مَنۡ شَكَرَ‏"
                    },
                    {
                        "num": 36,
                        "text": "وَلَقَدۡ اَنۡذَرَهُمۡ بَطۡشَتَـنَا فَتَمَارَوۡا بِالنُّذُرِ‏"
                    },
                    {
                        "num": 37,
                        "text": "وَلَقَدۡ رَاوَدُوۡهُ عَنۡ ضَيۡفِهٖ فَطَمَسۡنَاۤ اَعۡيُنَهُمۡ فَذُوۡقُوۡا عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 38,
                        "text": "وَلَقَدۡ صَبَّحَهُمۡ بُكۡرَةً عَذَابٌ مُّسۡتَقِرٌّ​ ۚ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَذُوۡقُوۡا عَذَابِىۡ وَنُذُرِ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَلَقَدۡ يَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّكۡرِ فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 41,
                        "text": "وَلَقَدۡ جَآءَ اٰلَ فِرۡعَوۡنَ النُّذُرُ​ۚ‏"
                    },
                    {
                        "num": 42,
                        "text": "كَذَّبُوۡا بِاٰيٰتِنَا كُلِّهَا فَاَخَذۡنٰهُمۡ اَخۡذَ عَزِيۡزٍ مُّقۡتَدِرٍ‏ ﻿﻿"
                    },
                    {
                        "num": 43,
                        "text": "اَكُفَّارُكُمۡ خَيۡرٌ مِّنۡ اُولٰٓٮِٕكُمۡ اَمۡ لَكُمۡ بَرَآءَةٌ فِى الزُّبُرِ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 44,
                        "text": "اَمۡ يَقُوۡلُوۡنَ نَحۡنُ جَمِيۡعٌ مُّنۡتَصِرٌ‏"
                    },
                    {
                        "num": 45,
                        "text": "سَيُهۡزَمُ الۡجَمۡعُ وَيُوَلُّوۡنَ الدُّبُرَ‏"
                    },
                    {
                        "num": 46,
                        "text": "بَلِ السَّاعَةُ مَوۡعِدُهُمۡ وَالسَّاعَةُ اَدۡهٰى وَاَمَرُّ‏"
                    },
                    {
                        "num": 47,
                        "text": "اِنَّ الۡمُجۡرِمِيۡنَ فِىۡ ضَلٰلٍ وَّسُعُرٍ​ۘ‏"
                    },
                    {
                        "num": 48,
                        "text": "يَوۡمَ يُسۡحَبُوۡنَ فِى النَّارِ عَلٰى وُجُوۡهِهِمۡؕ ذُوۡقُوۡا مَسَّ سَقَرَ‏ ﻿﻿"
                    },
                    {
                        "num": 49,
                        "text": "اِنَّا كُلَّ شَىۡءٍ خَلَقۡنٰهُ بِقَدَرٍ‏"
                    },
                    {
                        "num": 50,
                        "text": "وَمَاۤ اَمۡرُنَاۤ اِلَّا وَاحِدَةٌ كَلَمۡحٍۢ بِالۡبَصَرِ‏"
                    },
                    {
                        "num": 51,
                        "text": "وَلَقَدۡ اَهۡلَـكۡنَاۤ اَشۡيَاعَكُمۡ فَهَلۡ مِنۡ مُّدَّكِرٍ‏"
                    },
                    {
                        "num": 52,
                        "text": "وَكُلُّ شَىۡءٍ فَعَلُوۡهُ فِى الزُّبُرِ‏"
                    },
                    {
                        "num": 53,
                        "text": "وَ كُلُّ صَغِيۡرٍ وَّكَبِيۡرٍ مُّسۡتَطَرٌ‏"
                    },
                    {
                        "num": 54,
                        "text": "اِنَّ الۡمُتَّقِيۡنَ فِىۡ جَنّٰتٍ وَّنَهَرٍۙ‏"
                    },
                    {
                        "num": 55,
                        "text": "  فِىۡ مَقۡعَدِ صِدۡقٍ عِنۡدَ مَلِيۡكٍ مُّقۡتَدِرٍ‏"
                    }
                ]
            },
            {
                "surah": "Ar-Rahman",
                "number": 55,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلرَّحۡمٰنُۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "عَلَّمَ الۡقُرۡاٰنَؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "خَلَقَ الۡاِنۡسَانَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "عَلَّمَهُ الۡبَيَانَ‏"
                    },
                    {
                        "num": 5,
                        "text": "اَلشَّمۡسُ وَالۡقَمَرُ بِحُسۡبَانٍ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَّالنَّجۡمُ وَالشَّجَرُ يَسۡجُدٰنِ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَالسَّمَآءَ رَفَعَهَا وَوَضَعَ الۡمِيۡزَانَۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "اَلَّا تَطۡغَوۡا فِى الۡمِيۡزَانِ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَاَقِيۡمُوا الۡوَزۡنَ بِالۡقِسۡطِ وَلَا تُخۡسِرُوا الۡمِيۡزَانَ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَالۡاَرۡضَ وَضَعَهَا لِلۡاَنَامِۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "فِيۡهَا فَاكِهَةٌ  ۙ وَّالنَّخۡلُ ذَاتُ الۡاَكۡمَامِ​ ۖ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَالۡحَبُّ ذُو الۡعَصۡفِ وَالرَّيۡحَانُ​ۚ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 14,
                        "text": "خَلَقَ الۡاِنۡسَانَ مِنۡ صَلۡصَالٍ كَالۡفَخَّارِۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَخَلَقَ الۡجَآنَّ مِنۡ مَّارِجٍ مِّنۡ نَّارٍ​ۚ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 17,
                        "text": "رَبُّ الۡمَشۡرِقَيۡنِ وَ رَبُّ الۡمَغۡرِبَيۡنِ​ۚ‏"
                    },
                    {
                        "num": 18,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 19,
                        "text": "مَرَجَ الۡبَحۡرَيۡنِ يَلۡتَقِيٰنِۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "بَيۡنَهُمَا بَرۡزَخٌ لَّا يَبۡغِيٰنِ​ۚ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 22,
                        "text": "يَخۡرُجُ مِنۡهُمَا اللُّـؤۡلُـؤُ وَالۡمَرۡجَانُ​ۚ‏"
                    },
                    {
                        "num": 23,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَلَهُ الۡجَوَارِ الۡمُنۡشَئٰتُ فِى الۡبَحۡرِ كَالۡاَعۡلَامِ​ۚ‏"
                    },
                    {
                        "num": 25,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 26,
                        "text": "كُلُّ مَنۡ عَلَيۡهَا فَانٍ​ ۚ​ ۖ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَّيَبۡقٰى وَجۡهُ رَبِّكَ ذُو الۡجَلٰلِ وَالۡاِكۡرَامِ​ۚ‏"
                    },
                    {
                        "num": 28,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 29,
                        "text": "يَسۡـَٔـلُهٗ مَنۡ فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلَّ يَوۡمٍ هُوَ فِىۡ شَاۡنٍ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 30,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 31,
                        "text": "سَنَفۡرُغُ لَـكُمۡ اَيُّهَ الثَّقَلٰنِ​ۚ‏"
                    },
                    {
                        "num": 32,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 33,
                        "text": "يٰمَعۡشَرَ الۡجِنِّ وَالۡاِنۡسِ اِنِ اسۡتَطَعۡتُمۡ اَنۡ تَنۡفُذُوۡا مِنۡ اَقۡطَارِ السَّمٰوٰتِ وَالۡاَرۡضِ فَانْفُذُوۡا​ؕ لَا تَنۡفُذُوۡنَ اِلَّا بِسُلۡطٰنٍ​ۚ‏"
                    },
                    {
                        "num": 34,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 35,
                        "text": "يُرۡسَلُ عَلَيۡكُمَا شُوَاظٌ مِّنۡ نَّارٍ ۙ وَّنُحَاسٌ فَلَا تَنۡتَصِرٰنِ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 36,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 37,
                        "text": "فَاِذَا انْشَقَّتِ السَّمَآءُ فَكَانَتۡ وَرۡدَةً كَالدِّهَانِ​ۚ‏"
                    },
                    {
                        "num": 38,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَيَوۡمَٮِٕذٍ لَّا يُسۡـَٔـلُ عَنۡ ذَنۡۢبِهٖۤ اِنۡسٌ وَّلَا جَآنٌّ​ۚ‏"
                    },
                    {
                        "num": 40,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 41,
                        "text": "يُعۡرَفُ الۡمُجۡرِمُوۡنَ بِسِيۡمٰهُمۡ فَيُؤۡخَذُ بِالنَّوَاصِىۡ وَ الۡاَقۡدَامِ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 42,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 43,
                        "text": "هٰذِهٖ جَهَنَّمُ الَّتِىۡ يُكَذِّبُ بِهَا الۡمُجۡرِمُوۡنَ​ۘ‏"
                    },
                    {
                        "num": 44,
                        "text": "يَطُوۡفُوۡنَ بَيۡنَهَا وَبَيۡنَ حَمِيۡمٍ اٰنٍ​ۚ‏"
                    },
                    {
                        "num": 45,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 46,
                        "text": "وَلِمَنۡ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِ​ۚ‏"
                    },
                    {
                        "num": 47,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۙ‏"
                    },
                    {
                        "num": 48,
                        "text": "ذَوَاتَاۤ اَفۡنَانٍ​ۚ‏"
                    },
                    {
                        "num": 49,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 50,
                        "text": "فِيۡهِمَا عَيۡنٰنِ تَجۡرِيٰنِ​ۚ‏"
                    },
                    {
                        "num": 51,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 52,
                        "text": "فِيۡهِمَا مِنۡ كُلِّ فَاكِهَةٍ زَوۡجٰنِ​ۚ‏"
                    },
                    {
                        "num": 53,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 54,
                        "text": "مُتَّكِـــِٕيۡنَ عَلٰى فُرُشٍۢ بَطَآٮِٕنُهَا مِنۡ اِسۡتَبۡرَقٍ​ؕ وَجَنَی الۡجَـنَّتَيۡنِ دَانٍ​ۚ‏"
                    },
                    {
                        "num": 55,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 56,
                        "text": "فِيۡهِنَّ قٰصِرٰتُ الطَّرۡفِۙ لَمۡ يَطۡمِثۡهُنَّ اِنۡسٌ قَبۡلَهُمۡ وَلَا جَآنٌّ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 57,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ ۚ‏"
                    },
                    {
                        "num": 58,
                        "text": "كَاَنَّهُنَّ الۡيَاقُوۡتُ وَالۡمَرۡجَانُ​ۚ‏"
                    },
                    {
                        "num": 59,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 60,
                        "text": "هَلۡ جَزَآءُ الْاِحۡسَانِ اِلَّا الۡاِحۡسَانُ​ۚ‏"
                    },
                    {
                        "num": 61,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 62,
                        "text": "وَمِنۡ دُوۡنِهِمَا جَنَّتٰنِ​ۚ‏"
                    },
                    {
                        "num": 63,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِۙ‏"
                    },
                    {
                        "num": 64,
                        "text": "مُدۡهَآمَّتٰنِ​ۚ‏"
                    },
                    {
                        "num": 65,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ​ۚ‏"
                    },
                    {
                        "num": 66,
                        "text": "فِيۡهِمَا عَيۡنٰنِ نَضَّاخَتٰنِ​ۚ‏"
                    },
                    {
                        "num": 67,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 68,
                        "text": "فِيۡهِمَا فَاكِهَةٌ وَّنَخۡلٌ وَّرُمَّانٌ​ۚ‏"
                    },
                    {
                        "num": 69,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ​ۚ‏"
                    },
                    {
                        "num": 70,
                        "text": "فِيۡهِنَّ خَيۡرٰتٌ حِسَانٌ​ۚ‏"
                    },
                    {
                        "num": 71,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ​ۚ‏"
                    },
                    {
                        "num": 72,
                        "text": "حُوۡرٌ مَّقۡصُوۡرٰتٌ فِى الۡخِيَامِ​ۚ‏"
                    },
                    {
                        "num": 73,
                        "text": "​فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ​ۚ‏"
                    },
                    {
                        "num": 74,
                        "text": "لَمۡ يَطۡمِثۡهُنَّ اِنۡسٌ قَبۡلَهُمۡ وَلَا جَآنٌّ​ۚ‏"
                    },
                    {
                        "num": 75,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ​ۚ‏"
                    },
                    {
                        "num": 76,
                        "text": "مُتَّكِــِٕيۡنَ عَلٰى رَفۡرَفٍ خُضۡرٍ وَّعَبۡقَرِىٍّ حِسَانٍ​ۚ‏"
                    },
                    {
                        "num": 77,
                        "text": "فَبِاَىِّ اٰلَاۤءِ رَبِّكُمَا تُكَذِّبٰنِ‏"
                    },
                    {
                        "num": 78,
                        "text": "تَبٰـرَكَ اسۡمُ رَبِّكَ ذِى الۡجَـلٰلِ وَالۡاِكۡرَامِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Waqi'ah",
                "number": 56,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا وَقَعَتِ الۡوَاقِعَةُ ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "لَيۡسَ لِـوَقۡعَتِهَا كَاذِبَةٌ​ ۘ‏"
                    },
                    {
                        "num": 3,
                        "text": "خَافِضَةٌ رَّافِعَةٌ ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِذَا رُجَّتِ الۡاَرۡضُ رَجًّا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَّبُسَّتِ الۡجِبَالُ بَسًّا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "فَكَانَتۡ هَبَآءً مُّنۡۢبَـثًّا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَّكُنۡـتُمۡ اَزۡوَاجًا ثَلٰـثَـةً ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَاَصۡحٰبُ الۡمَيۡمَنَةِ ۙ مَاۤ اَصۡحٰبُ الۡمَيۡمَنَةِ ؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَاَصۡحٰبُ الۡمَشۡـَٔـمَةِ ۙ مَاۤ اَصۡحٰبُ الۡمَشۡـَٔـمَةِؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَالسّٰبِقُوۡنَ السّٰبِقُوۡنَۚ  ۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "اُولٰٓٮِٕكَ الۡمُقَرَّبُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 12,
                        "text": "فِىۡ جَنّٰتِ النَّعِيۡمِ‏"
                    },
                    {
                        "num": 13,
                        "text": "ثُلَّةٌ مِّنَ الۡاَوَّلِيۡنَۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَقَلِيۡلٌ مِّنَ الۡاٰخِرِيۡنَؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "عَلٰى سُرُرٍ مَّوۡضُوۡنَةٍۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "مُّتَّكِـــِٕيۡنَ عَلَيۡهَا مُتَقٰبِلِيۡنَ‏"
                    },
                    {
                        "num": 17,
                        "text": "يَطُوۡفُ عَلَيۡهِمۡ وِلۡدَانٌ مُّخَلَّدُوۡنَۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "بِاَكۡوَابٍ وَّاَبَارِيۡقَ ۙ وَكَاۡسٍ مِّنۡ مَّعِيۡنٍۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "لَّا يُصَدَّعُوۡنَ عَنۡهَا وَلَا يُنۡزِفُوۡنَۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَفَاكِهَةٍ مِّمَّا يَتَخَيَّرُوۡنَۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "وَلَحۡمِ طَيۡرٍ مِّمَّا يَشۡتَهُوۡنَؕ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَحُوۡرٌ عِيۡنٌۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "كَاَمۡثَالِ اللُّـؤۡلُـوٴِالۡمَكۡنُوۡنِ​ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "جَزَآءًۢ بِمَا كَانُوۡا يَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 25,
                        "text": "لَا يَسۡمَعُوۡنَ فِيۡهَا لَغۡوًا وَّلَا تَاۡثِيۡمًا ۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "اِلَّا قِيۡلًا سَلٰمًا سَلٰمًا‏"
                    },
                    {
                        "num": 27,
                        "text": "وَاَصۡحٰبُ الۡيَمِيۡنِ ۙ مَاۤ اَصۡحٰبُ الۡيَمِيۡنِؕ‏"
                    },
                    {
                        "num": 28,
                        "text": "فِىۡ سِدۡرٍ مَّخۡضُوۡدٍۙ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَّطَلۡحٍ مَّنۡضُوۡدٍۙ‏"
                    },
                    {
                        "num": 30,
                        "text": "وَّظِلٍّ مَّمۡدُوۡدٍۙ‏"
                    },
                    {
                        "num": 31,
                        "text": "وَّ مَآءٍ مَّسۡكُوۡبٍۙ‏"
                    },
                    {
                        "num": 32,
                        "text": "وَّفَاكِهَةٍ كَثِيۡرَةٍۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "لَّا مَقۡطُوۡعَةٍ وَّلَا مَمۡنُوۡعَةٍۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَّ فُرُشٍ مَّرۡفُوۡعَةٍؕ‏"
                    },
                    {
                        "num": 35,
                        "text": "اِنَّاۤ اَنۡشَاۡنٰهُنَّ اِنۡشَآءًۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "فَجَعَلۡنٰهُنَّ اَبۡكَارًاۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "عُرُبًا اَتۡرَابًاۙ‏"
                    },
                    {
                        "num": 38,
                        "text": "لِّاَصۡحٰبِ الۡيَمِيۡنِؕ‏"
                    },
                    {
                        "num": 39,
                        "text": "ثُلَّةٌ مِّنَ الۡاَوَّلِيۡنَۙ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَثُلَّةٌ مِّنَ الۡاٰخِرِيۡنَؕ‏"
                    },
                    {
                        "num": 41,
                        "text": "وَاَصۡحٰبُ الشِّمَالِ ۙ مَاۤ اَصۡحٰبُ الشِّمَالِؕ‏"
                    },
                    {
                        "num": 42,
                        "text": "فِىۡ سَمُوۡمٍ وَّحَمِيۡمٍۙ‏"
                    },
                    {
                        "num": 43,
                        "text": "وَّظِلٍّ مِّنۡ يَّحۡمُوۡمٍۙ‏"
                    },
                    {
                        "num": 44,
                        "text": "لَّا بَارِدٍ وَّلَا كَرِيۡمٍ‏"
                    },
                    {
                        "num": 45,
                        "text": "اِنَّهُمۡ كَانُوۡا قَبۡلَ ذٰ لِكَ مُتۡرَفِيۡنَۚ  ۖ‏"
                    },
                    {
                        "num": 46,
                        "text": "وَكَانُوۡا يُصِرُّوۡنَ عَلَى الۡحِنۡثِ الۡعَظِيۡمِ​ۚ‏"
                    },
                    {
                        "num": 47,
                        "text": "وَكَانُوۡا يَقُوۡلُوۡنَ ۙ اَٮِٕذَا مِتۡنَا وَكُنَّا تُرَابًا وَّعِظَامًا ءَاِنَّا لَمَبۡعُوۡثُوۡنَۙ‏"
                    },
                    {
                        "num": 48,
                        "text": "اَوَاٰبَآؤُنَا الۡاَوَّلُوۡنَ‏"
                    },
                    {
                        "num": 49,
                        "text": "قُلۡ اِنَّ الۡاَوَّلِيۡنَ وَالۡاٰخِرِيۡنَۙ‏"
                    },
                    {
                        "num": 50,
                        "text": "لَمَجۡمُوۡعُوۡنَ ۙ اِلٰى مِيۡقَاتِ يَوۡمٍ مَّعۡلُوۡمٍ‏"
                    },
                    {
                        "num": 51,
                        "text": "ثُمَّ اِنَّكُمۡ اَيُّهَا الضَّآلُّوۡنَ الۡمُكَذِّبُوۡنَۙ‏"
                    },
                    {
                        "num": 52,
                        "text": "لَاٰكِلُوۡنَ مِنۡ شَجَرٍ مِّنۡ زَقُّوۡمٍۙ‏"
                    },
                    {
                        "num": 53,
                        "text": "فَمٰلِــُٔوۡنَ مِنۡهَا الۡبُطُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 54,
                        "text": "فَشٰرِبُوۡنَ عَلَيۡهِ مِنَ الۡحَمِيۡمِ​ۚ‏"
                    },
                    {
                        "num": 55,
                        "text": "فَشٰرِبُوۡنَ شُرۡبَ الۡهِيۡمِؕ‏"
                    },
                    {
                        "num": 56,
                        "text": "هٰذَا نُزُلُهُمۡ يَوۡمَ الدِّيۡنِؕ‏"
                    },
                    {
                        "num": 57,
                        "text": "نَحۡنُ خَلَقۡنٰكُمۡ فَلَوۡلَا تُصَدِّقُوۡنَ‏"
                    },
                    {
                        "num": 58,
                        "text": "اَفَرَءَيۡتُمۡ مَّا تُمۡنُوۡنَؕ‏"
                    },
                    {
                        "num": 59,
                        "text": "ءَاَنۡتُمۡ تَخۡلُقُوۡنَهٗۤ اَمۡ نَحۡنُ الۡخٰلِقُوۡنَ‏"
                    },
                    {
                        "num": 60,
                        "text": "نَحۡنُ قَدَّرۡنَا بَيۡنَكُمُ الۡمَوۡتَ وَمَا نَحۡنُ بِمَسۡبُوۡقِيۡنَۙ‏"
                    },
                    {
                        "num": 61,
                        "text": "عَلٰٓى اَنۡ نُّبَدِّلَ اَمۡثَالَـكُمۡ وَنُـنۡشِئَكُمۡ فِىۡ مَا لَا تَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 62,
                        "text": "وَلَـقَدۡ عَلِمۡتُمُ النَّشۡاَةَ الۡاُوۡلٰى فَلَوۡلَا تَذَكَّرُوۡنَ‏"
                    },
                    {
                        "num": 63,
                        "text": "اَفَرَءَيۡتُمۡ مَّا تَحۡرُثُوۡنَؕ‏"
                    },
                    {
                        "num": 64,
                        "text": "ءَاَنۡتُمۡ تَزۡرَعُوۡنَهٗۤ اَمۡ نَحۡنُ الزّٰرِعُوۡنَ‏"
                    },
                    {
                        "num": 65,
                        "text": "لَوۡ نَشَآءُ لَجَـعَلۡنٰهُ حُطَامًا فَظَلۡتُمۡ تَفَكَّهُوۡنَ‏"
                    },
                    {
                        "num": 66,
                        "text": "اِنَّا لَمُغۡرَمُوۡنَۙ‏"
                    },
                    {
                        "num": 67,
                        "text": "بَلۡ نَحۡنُ مَحۡرُوۡمُوۡنَ‏"
                    },
                    {
                        "num": 68,
                        "text": "اَفَرَءَيۡتُمُ الۡمَآءَ الَّذِىۡ تَشۡرَبُوۡنَؕ‏"
                    },
                    {
                        "num": 69,
                        "text": "ءَاَنۡـتُمۡ اَنۡزَلۡـتُمُوۡهُ مِنَ الۡمُزۡنِ اَمۡ نَحۡنُ الۡمُنۡزِلُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 70,
                        "text": "لَوۡ نَشَآءُ جَعَلۡنٰهُ اُجَاجًا فَلَوۡلَا تَشۡكُرُوۡنَ‏"
                    },
                    {
                        "num": 71,
                        "text": "اَفَرَءَيۡتُمُ النَّارَ الَّتِىۡ تُوۡرُوۡنَؕ‏"
                    },
                    {
                        "num": 72,
                        "text": "ءَاَنۡتُمۡ اَنۡشَاۡتُمۡ شَجَرَتَهَاۤ اَمۡ نَحۡنُ الۡمُنۡشِـُٔـوۡنَ‏"
                    },
                    {
                        "num": 73,
                        "text": "نَحۡنُ جَعَلۡنٰهَا تَذۡكِرَةً وَّمَتَاعًا لِّلۡمُقۡوِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 74,
                        "text": "فَسَبِّحۡ بِاسۡمِ رَبِّكَ الۡعَظِيۡمِ‏"
                    },
                    {
                        "num": 75,
                        "text": "فَلَاۤ اُقۡسِمُ بِمَوٰقِعِ النُّجُوۡمِۙ‏‏"
                    },
                    {
                        "num": 76,
                        "text": "وَاِنَّهٗ لَقَسَمٌ لَّوۡ تَعۡلَمُوۡنَ عَظِيۡمٌۙ‏"
                    },
                    {
                        "num": 77,
                        "text": "اِنَّهٗ لَـقُرۡاٰنٌ كَرِيۡمٌۙ‏"
                    },
                    {
                        "num": 78,
                        "text": "فِىۡ كِتٰبٍ مَّكۡنُوۡنٍۙ‏"
                    },
                    {
                        "num": 79,
                        "text": "لَّا يَمَسُّهٗۤ اِلَّا الۡمُطَهَّرُوۡنَؕ‏"
                    },
                    {
                        "num": 80,
                        "text": "تَنۡزِيۡلٌ مِّنۡ رَّبِّ الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 81,
                        "text": "اَفَبِهٰذَا الۡحَـدِيۡثِ اَنۡتُمۡ مُّدۡهِنُوۡنَۙ‏"
                    },
                    {
                        "num": 82,
                        "text": "وَتَجۡعَلُوۡنَ رِزۡقَكُمۡ اَنَّكُمۡ تُكَذِّبُوۡنَ‏"
                    },
                    {
                        "num": 83,
                        "text": "فَلَوۡلَاۤ اِذَا بَلَغَتِ الۡحُـلۡقُوۡمَۙ‏"
                    },
                    {
                        "num": 84,
                        "text": "وَاَنۡتُمۡ حِيۡنَٮِٕذٍ تَـنۡظُرُوۡنَۙ‏"
                    },
                    {
                        "num": 85,
                        "text": "وَنَحۡنُ اَقۡرَبُ اِلَيۡهِ مِنۡكُمۡ وَلٰـكِنۡ لَّا تُبۡصِرُوۡنَ‏"
                    },
                    {
                        "num": 86,
                        "text": "فَلَوۡلَاۤ اِنۡ كُنۡتُمۡ غَيۡرَ مَدِيۡنِيۡنَۙ‏"
                    },
                    {
                        "num": 87,
                        "text": "تَرۡجِعُوۡنَهَاۤ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 88,
                        "text": "فَاَمَّاۤ اِنۡ كَانَ مِنَ الۡمُقَرَّبِيۡنَۙ‏"
                    },
                    {
                        "num": 89,
                        "text": "فَرَوۡحٌ وَّ رَيۡحَانٌ ۙ وَّجَنَّتُ نَعِيۡمٍ‏"
                    },
                    {
                        "num": 90,
                        "text": "وَاَمَّاۤ اِنۡ كَانَ مِنۡ اَصۡحٰبِ الۡيَمِيۡنِۙ‏"
                    },
                    {
                        "num": 91,
                        "text": "فَسَلٰمٌ لَّكَ مِنۡ اَصۡحٰبِ الۡيَمِيۡنِؕ‏"
                    },
                    {
                        "num": 92,
                        "text": "وَاَمَّاۤ اِنۡ كَانَ مِنَ الۡمُكَذِّبِيۡنَ الضَّآلِّيۡنَۙ‏"
                    },
                    {
                        "num": 93,
                        "text": "فَنُزُلٌ مِّنۡ حَمِيۡمٍۙ‏"
                    },
                    {
                        "num": 94,
                        "text": "وَّتَصۡلِيَةُ جَحِيۡمٍ‏"
                    },
                    {
                        "num": 95,
                        "text": "اِنَّ هٰذَا لَهُوَ حَقُّ الۡيَـقِيۡنِۚ‏"
                    },
                    {
                        "num": 96,
                        "text": "فَسَبِّحۡ بِاسۡمِ رَبِّكَ الۡعَظِيۡمِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Hadid",
                "number": 57,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "سَبَّحَ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏ ﻿﻿"
                    },
                    {
                        "num": 2,
                        "text": "لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ۚ يُحۡىٖ وَيُمِيۡتُ​ۚ وَهُوَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 3,
                        "text": "هُوَ الۡاَوَّلُ وَالۡاٰخِرُ وَالظَّاهِرُ وَالۡبَاطِنُ​ۚ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 4,
                        "text": "هُوَ الَّذِىۡ خَلَقَ السَّمٰوٰتِ وَالۡاَرۡضَ فِىۡ سِتَّةِ اَيَّامٍ ثُمَّ اسۡتَوٰى عَلَى الۡعَرۡشِ​ؕ يَعۡلَمُ مَا يَلِجُ فِى الۡاَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنۡزِلُ مِنَ السَّمَآءِ وَمَا يَعۡرُجُ فِيۡهَاؕ وَهُوَ مَعَكُمۡ اَيۡنَ مَا كُنۡتُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 5,
                        "text": "لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "يُوۡلِجُ الَّيۡلَ فِى النَّهَارِ وَيُوۡلِجُ النَّهَارَ فِى الَّيۡلِ​ؕ وَهُوَ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏"
                    },
                    {
                        "num": 7,
                        "text": "اٰمِنُوۡا بِاللّٰهِ وَرَسُوۡلِهٖ وَاَنۡفِقُوۡا مِمَّا جَعَلَـكُمۡ مُّسۡتَخۡلَفِيۡنَ فِيۡهِ​ؕ فَالَّذِيۡنَ اٰمَنُوۡا مِنۡكُمۡ وَاَنۡفَقُوۡا لَهُمۡ اَجۡرٌ كَبِيۡرٌ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَمَا لَـكُمۡ لَا تُؤۡمِنُوۡنَ بِاللّٰهِ​ۚ وَالرَّسُوۡلُ يَدۡعُوۡكُمۡ لِتُؤۡمِنُوۡا بِرَبِّكُمۡ وَقَدۡ اَخَذَ مِيۡثَاقَكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "هُوَ الَّذِىۡ يُنَزِّلُ عَلٰى عَبۡدِهٖۤ اٰيٰتٍۭ بَيِّنٰتٍ لِّيُخۡرِجَكُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ وَاِنَّ اللّٰهَ بِكُمۡ لَرَءُوۡفٌ رَّحِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 10,
                        "text": "وَ مَا لَـكُمۡ اَلَّا تُنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلِلّٰهِ مِيۡـرَاثُ السَّمٰوٰتِ وَ الۡاَرۡضِ​ؕ لَا يَسۡتَوِىۡ مِنۡكُمۡ مَّنۡ اَنۡفَقَ مِنۡ قَبۡلِ الۡفَتۡحِ وَقَاتَلَ​ ؕ اُولٰٓٮِٕكَ اَعۡظَمُ دَرَجَةً مِّنَ الَّذِيۡنَ اَنۡفَقُوۡا مِنۡۢ بَعۡدُ وَقَاتَلُوۡا​ ؕ وَكُلًّا وَّعَدَ اللّٰهُ الۡحُسۡنٰى​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 11,
                        "text": "مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗ وَلَهٗۤ اَجۡرٌ كَرِيۡمٌ ۚ‏"
                    },
                    {
                        "num": 12,
                        "text": "يَوۡمَ تَرَى الۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِ يَسۡعٰى نُوۡرُهُمۡ بَيۡنَ اَيۡدِيۡهِمۡ وَبِاَيۡمَانِهِمۡ بُشۡرٰٮكُمُ الۡيَوۡمَ جَنّٰتٌ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا​ؕ ذٰلِكَ هُوَ الۡفَوۡزُ الۡعَظِيۡمُ​ۚ‏"
                    },
                    {
                        "num": 13,
                        "text": "يَوۡمَ يَقُوۡلُ الۡمُنٰفِقُوۡنَ وَالۡمُنٰفِقٰتُ لِلَّذِيۡنَ اٰمَنُوا انْظُرُوۡنَا نَقۡتَبِسۡ مِنۡ نُّوۡرِكُمۡ​ۚ قِيۡلَ ارۡجِعُوۡا وَرَآءَكُمۡ فَالۡتَمِسُوۡا نُوۡرًاؕ فَضُرِبَ بَيۡنَهُمۡ بِسُوۡرٍ لَّهٗ بَابٌؕ بَاطِنُهٗ فِيۡهِ الرَّحۡمَةُ وَظَاهِرُهٗ مِنۡ قِبَلِهِ الۡعَذَابُؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "يُنَادُوۡنَهُمۡ اَلَمۡ نَكُنۡ مَّعَكُمۡ​ؕ قَالُوۡا بَلٰى وَلٰـكِنَّكُمۡ فَتَنۡتُمۡ اَنۡفُسَكُمۡ وَ تَرَبَّصۡتُمۡ وَارۡتَبۡتُمۡ وَغَرَّتۡكُمُ الۡاَمَانِىُّ حَتّٰى جَآءَ اَمۡرُ اللّٰهِ وَ غَرَّكُمۡ بِاللّٰهِ الۡغَرُوۡرُ‏"
                    },
                    {
                        "num": 15,
                        "text": "فَالۡيَوۡمَ لَا يُؤۡخَذُ مِنۡكُمۡ فِدۡيَةٌ وَّلَا مِنَ الَّذِيۡنَ كَفَرُوۡا​ؕ مَاۡوٰٮكُمُ النَّارُ​ؕ هِىَ مَوۡلٰٮكُمۡ​ؕ وَبِئۡسَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 16,
                        "text": "اَلَمۡ يَاۡنِ لِلَّذِيۡنَ اٰمَنُوۡۤا اَنۡ تَخۡشَعَ قُلُوۡبُهُمۡ لِذِكۡرِ اللّٰهِ وَمَا نَزَلَ مِنَ الۡحَـقِّۙ وَلَا يَكُوۡنُوۡا كَالَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ مِنۡ قَبۡلُ فَطَالَ عَلَيۡهِمُ الۡاَمَدُ فَقَسَتۡ قُلُوۡبُهُمۡ​ؕ وَكَثِيۡرٌ مِّنۡهُمۡ فٰسِقُوۡنَ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِعۡلَمُوۡۤا اَنَّ اللّٰهَ يُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا​ؕ قَدۡ بَيَّنَّا لَكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَعۡقِلُوۡنَ‏"
                    },
                    {
                        "num": 18,
                        "text": "اِنَّ الۡمُصَّدِّقِيۡنَ وَالۡمُصَّدِّقٰتِ وَاَقۡرَضُوا اللّٰهَ قَرۡضًا حَسَنًا يُّضٰعَفُ لَهُمۡ وَلَهُمۡ اَجۡرٌ كَرِيۡمٌ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَالَّذِيۡنَ اٰمَنُوۡا بِاللّٰهِ وَرُسُلِهٖۤ اُولٰٓٮِٕكَ هُمُ الصِّدِّيۡقُوۡنَۖ وَالشُّهَدَآءُ عِنۡدَ رَبِّهِمۡؕ لَهُمۡ اَجۡرُهُمۡ وَنُوۡرُهُمۡ​ؕ وَ الَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِاٰيٰتِنَاۤ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَحِيۡمِ‏"
                    },
                    {
                        "num": 20,
                        "text": "اِعۡلَمُوۡۤا اَنَّمَا الۡحَيٰوةُ الدُّنۡيَا لَعِبٌ وَّلَهۡوٌ وَّزِيۡنَةٌ وَّتَفَاخُرٌۢ بَيۡنَكُمۡ وَتَكَاثُرٌ فِى الۡاَمۡوَالِ وَالۡاَوۡلَادِ​ؕ كَمَثَلِ غَيۡثٍ اَعۡجَبَ الۡكُفَّارَ نَبَاتُهٗ ثُمَّ يَهِيۡجُ فَتَرٰٮهُ مُصۡفَرًّا ثُمَّ يَكُوۡنُ حُطٰمًا​ؕ وَفِى الۡاٰخِرَةِ عَذَابٌ شَدِيۡدٌ ۙ وَّمَغۡفِرَةٌ مِّنَ اللّٰهِ وَرِضۡوَانٌ​ؕ وَمَا الۡحَيٰوةُ الدُّنۡيَاۤ اِلَّا مَتَاعُ الۡغُرُوۡرِ‏"
                    },
                    {
                        "num": 21,
                        "text": "سَابِقُوۡۤا اِلٰى مَغۡفِرَةٍ مِّنۡ رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ السَّمَآءِ وَ الۡاَرۡضِۙ اُعِدَّتۡ لِلَّذِيۡنَ اٰمَنُوۡا بِاللّٰهِ وَرُسُلِهٖ​ؕ ذٰلِكَ فَضۡلُ اللّٰهِ يُؤۡتِيۡهِ مَنۡ يَّشَآءُ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ‏ ﻿﻿"
                    },
                    {
                        "num": 22,
                        "text": "مَاۤ اَصَابَ مِنۡ مُّصِيۡبَةٍ فِى الۡاَرۡضِ وَلَا فِىۡۤ اَنۡفُسِكُمۡ اِلَّا فِىۡ كِتٰبٍ مِّنۡ قَبۡلِ اَنۡ نَّبۡـرَاَهَا ؕ اِنَّ ذٰ لِكَ عَلَى اللّٰهِ يَسِيۡرٌۚ  ۖ‏"
                    },
                    {
                        "num": 23,
                        "text": "لِّـكَيۡلَا تَاۡسَوۡا عَلٰى مَا فَاتَكُمۡ وَلَا تَفۡرَحُوۡا بِمَاۤ اٰتٰٮكُمۡ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ مُخۡتَالٍ فَخُوۡرِۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "اۨلَّذِيۡنَ يَبۡخَلُوۡنَ وَيَاۡمُرُوۡنَ النَّاسَ بِالۡبُخۡلِ​ؕ وَمَنۡ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الۡغَنِىُّ الۡحَمِيۡدُ‏"
                    },
                    {
                        "num": 25,
                        "text": "لَـقَدۡ اَرۡسَلۡنَا رُسُلَنَا بِالۡبَيِّنٰتِ وَاَنۡزَلۡنَا مَعَهُمُ الۡكِتٰبَ وَالۡمِيۡزَانَ لِيَقُوۡمَ النَّاسُ بِالۡقِسۡطِ​ۚ وَاَنۡزَلۡنَا الۡحَـدِيۡدَ فِيۡهِ بَاۡسٌ شَدِيۡدٌ وَّمَنَافِعُ لِلنَّاسِ وَلِيَـعۡلَمَ اللّٰهُ مَنۡ يَّنۡصُرُهٗ وَ رُسُلَهٗ بِالۡغَيۡبِ​ ؕ اِنَّ اللّٰهَ قَوِىٌّ عَزِيۡزٌ‏"
                    },
                    {
                        "num": 26,
                        "text": "وَلَقَدۡ اَرۡسَلۡنَا نُوۡحًا وَّ اِبۡرٰهِيۡمَ وَجَعَلۡنَا فِىۡ ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالۡـكِتٰبَ​ فَمِنۡهُمۡ مُّهۡتَدٍ​ۚ وَكَثِيۡرٌ مِّنۡهُمۡ فٰسِقُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 27,
                        "text": "ثُمَّ قَفَّيۡنَا عَلٰٓى اٰثَارِهِمۡ بِرُسُلِنَا وَقَفَّيۡنَا بِعِيۡسَى ابۡنِ مَرۡيَمَ وَاٰتَيۡنٰهُ الۡاِنۡجِيۡلَ ۙ وَجَعَلۡنَا فِىۡ قُلُوۡبِ الَّذِيۡنَ اتَّبَعُوۡهُ رَاۡفَةً وَّرَحۡمَةً  ؕ وَرَهۡبَانِيَّةَ اۨبۡتَدَعُوۡهَا مَا كَتَبۡنٰهَا عَلَيۡهِمۡ اِلَّا ابۡتِغَآءَ رِضۡوَانِ اللّٰهِ فَمَا رَعَوۡهَا حَقَّ رِعَايَتِهَا​ ۚ فَاٰتَيۡنَا الَّذِيۡنَ اٰمَنُوۡا مِنۡهُمۡ اَجۡرَهُمۡ​ۚ وَكَثِيۡرٌ مِّنۡهُمۡ فٰسِقُوۡنَ‏"
                    },
                    {
                        "num": 28,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَاٰمِنُوۡا بِرَسُوۡلِهٖ يُؤۡتِكُمۡ كِفۡلَيۡنِ مِنۡ رَّحۡمَتِهٖ وَيَجۡعَلْ لَّـكُمۡ نُوۡرًا تَمۡشُوۡنَ بِهٖ وَيَغۡفِرۡ لَـكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ ۙۚ‏"
                    },
                    {
                        "num": 29,
                        "text": "لِّـئَلَّا يَعۡلَمَ اَهۡلُ الۡكِتٰبِ اَلَّا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّنۡ فَضۡلِ اللّٰهِ​ وَاَنَّ الۡفَضۡلَ بِيَدِ اللّٰهِ يُؤۡتِيۡهِ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ ذُوۡ الۡفَضۡلِ الۡعَظِيۡمِ‏"
                    }
                ]
            }
        ]
    },
    "28": {
        "name": "Juz 28",
        "surahs": [
            {
                "surah": "Al-Mujadilah",
                "number": 58,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قَدۡ سَمِعَ اللّٰهُ قَوۡلَ الَّتِىۡ تُجَادِلُكَ فِىۡ زَوۡجِهَا وَ تَشۡتَكِىۡۤ اِلَى اللّٰهِ ​ۖ وَاللّٰهُ يَسۡمَعُ تَحَاوُرَكُمَا​ ؕ اِنَّ اللّٰهَ سَمِيۡعٌ ۢ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 2,
                        "text": "اَلَّذِيۡنَ يُظٰهِرُوۡنَ مِنۡكُمۡ مِّنۡ نِّسَآٮِٕهِمۡ مَّا هُنَّ اُمَّهٰتِهِمۡ​ؕ اِنۡ اُمَّهٰتُهُمۡ اِلَّا الّٰٓـىِٔۡ وَلَدۡنَهُمۡ​ؕ وَاِنَّهُمۡ لَيَقُوۡلُوۡنَ مُنۡكَرًا مِّنَ الۡقَوۡلِ وَزُوۡرًا​ؕ وَ اِنَّ اللّٰهَ لَعَفُوٌّ غَفُوۡرٌ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَالَّذِيۡنَ يُظٰهِرُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ ثُمَّ يَعُوۡدُوۡنَ لِمَا قَالُوۡا فَتَحۡرِيۡرُ رَقَبَةٍ مِّنۡ قَبۡلِ اَنۡ يَّتَمَآسَّا​ ؕ ذٰ لِكُمۡ تُوۡعَظُوۡنَ بِهٖ​ ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 4,
                        "text": "فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ مِنۡ قَبۡلِ اَنۡ يَّتَمَآسَّاؕ فَمَنۡ لَّمۡ يَسۡتَطِعۡ فَاِطۡعَامُ سِتِّيۡنَ مِسۡكِيۡنًا​ؕ ذٰلِكَ لِتُؤۡمِنُوۡا بِاللّٰهِ وَرَسُوۡلِهٖ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ اَلِیْمٌ‏"
                    },
                    {
                        "num": 5,
                        "text": "اِنَّ الَّذِيۡنَ يُحَآدُّوۡنَ اللّٰهَ وَرَسُوۡلَهٗ كُبِتُوۡا كَمَا كُبِتَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ​ وَقَدۡ اَنۡزَلۡنَاۤ اٰيٰتٍۢ بَيِّنٰتٍ​ ؕ وَ لِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ​ ۚ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَوۡمَ يَبۡعَثُهُمُ اللّٰهُ جَمِيۡعًا فَيُنَبِّئُهُمۡ بِمَا عَمِلُوۡا​ ؕ اَحۡصٰٮهُ اللّٰهُ وَنَسُوۡهُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ شَهِيۡدٌ​‏"
                    },
                    {
                        "num": 7,
                        "text": "اَلَمۡ تَرَ اَنَّ اللّٰهَ يَعۡلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَا يَكُوۡنُ مِنۡ نَّجۡوٰى ثَلٰثَةٍ اِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ اِلَّا هُوَ سَادِسُهُمۡ وَلَاۤ اَدۡنٰى مِنۡ ذٰ لِكَ وَلَاۤ اَكۡثَرَ اِلَّا هُوَ مَعَهُمۡ اَيۡنَ مَا كَانُوۡا​ۚ ثُمَّ يُنَبِّئُهُمۡ بِمَا عَمِلُوۡا يَوۡمَ الۡقِيٰمَةِ​ ؕ اِنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 8,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِيۡنَ نُهُوۡا عَنِ النَّجۡوٰى ثُمَّ يَعُوۡدُوۡنَ لِمَا نُهُوۡا عَنۡهُ وَيَتَنٰجَوۡنَ بِالۡاِثۡمِ وَالۡعُدۡوَانِ وَمَعۡصِيَتِ الرَّسُوۡلِ وَاِذَا جَآءُوۡكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ اللّٰهُۙ وَيَقُوۡلُوۡنَ فِىۡۤ اَنۡفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا اللّٰهُ بِمَا نَقُوۡلُ​ؕ حَسۡبُهُمۡ جَهَنَّمُ​ۚ يَصۡلَوۡنَهَا​ۚ فَبِئۡسَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 9,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَنَاجَيۡتُمۡ فَلَا تَـتَـنَاجَوۡا بِالۡاِثۡمِ وَالۡعُدۡوَانِ وَمَعۡصِيَتِ الرَّسُوۡلِ وَتَنَاجَوۡا بِالۡبِرِّ وَالتَّقۡوٰى​ؕ وَاتَّقُوا اللّٰهَ الَّذِىۡۤ اِلَيۡهِ تُحۡشَرُوۡنَ‏"
                    },
                    {
                        "num": 10,
                        "text": "اِنَّمَا النَّجۡوٰى مِنَ الشَّيۡطٰنِ لِيَحۡزُنَ الَّذِيۡنَ اٰمَنُوۡا وَلَيۡسَ بِضَآرِّهِمۡ شَيۡـًٔـا اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَعَلَى اللّٰهِ فَلۡيَتَوَكَّلِ الۡمُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 11,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا قِيۡلَ لَـكُمۡ تَفَسَّحُوۡا فِى الۡمَجٰلِسِ فَافۡسَحُوۡا يَفۡسَحِ اللّٰهُ لَـكُمۡ​ ۚ وَاِذَا قِيۡلَ انْشُزُوۡا فَانْشُزُوۡا يَرۡفَعِ اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا مِنۡكُمۡ ۙ وَالَّذِيۡنَ اُوۡتُوا الۡعِلۡمَ دَرَجٰتٍ ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 12,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا نَاجَيۡتُمُ الرَّسُوۡلَ فَقَدِّمُوۡا بَيۡنَ يَدَىۡ نَجۡوٰٮكُمۡ صَدَقَةً  ​ؕ ذٰ لِكَ خَيۡرٌ لَّكُمۡ وَاَطۡهَرُ ​ؕ فَاِنۡ لَّمۡ تَجِدُوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 13,
                        "text": "ءَاَشۡفَقۡتُمۡ اَنۡ تُقَدِّمُوۡا بَيۡنَ يَدَىۡ نَجۡوٰٮكُمۡ صَدَقٰتٍ​ ؕ فَاِذۡ لَمۡ تَفۡعَلُوۡا وَتَابَ اللّٰهُ عَلَيۡكُمۡ فَاَقِيۡمُوا الصَّلٰوةَ وَ اٰتُوا الزَّكٰوةَ وَاَطِيۡعُوا اللّٰهَ وَرَسُوۡلَهٗ​ ؕ وَاللّٰهُ خَبِيۡرٌۢ بِمَا تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 14,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِيۡنَ تَوَلَّوۡا قَوۡمًا غَضِبَ اللّٰهُ عَلَيۡهِمؕۡ مَّا هُمۡ مِّنۡكُمۡ وَلَا مِنۡهُمۡۙ وَيَحۡلِفُوۡنَ عَلَى الۡكَذِبِ وَهُمۡ يَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 15,
                        "text": "اَعَدَّ اللّٰهُ لَهُمۡ عَذَابًا شَدِيۡدًا​ ؕ اِنَّهُمۡ سَآءَ مَا كَانُوۡا يَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 16,
                        "text": "اِتَّخَذُوۡۤا اَيۡمَانَهُمۡ جُنَّةً فَصَدُّوۡا عَنۡ سَبِيۡلِ اللّٰهِ فَلَهُمۡ عَذَابٌ مُّهِيۡنٌ‏"
                    },
                    {
                        "num": 17,
                        "text": "لَنۡ تُغۡنِىَ عَنۡهُمۡ اَمۡوَالُهُمۡ وَلَاۤ اَوۡلَادُهُمۡ مِّنَ اللّٰهِ شَيۡــًٔـا​ ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ ؕ هُمۡ فِيۡهَا خٰلِدُوۡنَ‏"
                    },
                    {
                        "num": 18,
                        "text": "يَوۡمَ يَبۡعَثُهُمُ اللّٰهُ جَمِيۡعًا فَيَحۡلِفُوۡنَ لَهٗ كَمَا يَحۡلِفُوۡنَ لَـكُمۡ​ وَيَحۡسَبُوۡنَ اَنَّهُمۡ عَلٰى شَىۡءٍ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ الۡكٰذِبُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 19,
                        "text": "اِسۡتَحۡوَذَ عَلَيۡهِمُ الشَّيۡطٰنُ فَاَنۡسٰٮهُمۡ ذِكۡرَ اللّٰهِ​ؕ اُولٰٓٮِٕكَ حِزۡبُ الشَّيۡطٰنِ​ؕ اَلَاۤ اِنَّ حِزۡبَ الشَّيۡطٰنِ هُمُ الۡخٰسِرُوۡنَ‏"
                    },
                    {
                        "num": 20,
                        "text": "اِنَّ الَّذِيۡنَ يُحَآدُّوۡنَ اللّٰهَ وَرَسُوۡلَهٗۤ اُولٰٓٮِٕكَ فِى الۡاَذَلِّيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 21,
                        "text": "كَتَبَ اللّٰهُ لَاَغۡلِبَنَّ اَنَا وَرُسُلِىۡ​ؕ اِنَّ اللّٰهَ قَوِىٌّ عَزِيۡزٌ‏ ﻿﻿"
                    },
                    {
                        "num": 22,
                        "text": "لَا تَجِدُ قَوۡمًا يُّؤۡمِنُوۡنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ يُوَآدُّوۡنَ مَنۡ حَآدَّ اللّٰهَ وَرَسُوۡلَهٗ وَلَوۡ كَانُوۡۤا اٰبَآءَهُمۡ اَوۡ اَبۡنَآءَهُمۡ اَوۡ اِخۡوَانَهُمۡ اَوۡ عَشِيۡرَتَهُمۡ​ؕ اُولٰٓٮِٕكَ كَتَبَ فِىۡ قُلُوۡبِهِمُ الۡاِيۡمَانَ وَاَيَّدَهُمۡ بِرُوۡحٍ مِّنۡهُ​ ؕ وَيُدۡخِلُهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَا​ ؕ رَضِىَ اللّٰهُ عَنۡهُمۡ وَرَضُوۡا عَنۡهُ​ ؕ اُولٰٓٮِٕكَ حِزۡبُ اللّٰهِ​ ؕ اَلَاۤ اِنَّ حِزۡبَ اللّٰهِ هُمُ الۡمُفۡلِحُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Hasyr",
                "number": 59,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "سَبَّحَ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 2,
                        "text": "هُوَ الَّذِىۡۤ اَخۡرَجَ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ مِنۡ دِيَارِهِمۡ لِاَوَّلِ الۡحَشۡرِ​ؔؕ مَا ظَنَنۡـتُمۡ اَنۡ يَّخۡرُجُوۡا​ وَظَنُّوۡۤا اَنَّهُمۡ مَّانِعَتُهُمۡ حُصُوۡنُهُمۡ مِّنَ اللّٰهِ فَاَتٰٮهُمُ اللّٰهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُوۡا وَقَذَفَ فِىۡ قُلُوۡبِهِمُ الرُّعۡبَ يُخۡرِبُوۡنَ بُيُوۡتَهُمۡ بِاَيۡدِيۡهِمۡ وَاَيۡدِى الۡمُؤۡمِنِيۡنَ فَاعۡتَبِـرُوۡا يٰۤاُولِى الۡاَبۡصَارِ​‏"
                    },
                    {
                        "num": 3,
                        "text": "وَلَوۡلَاۤ اَنۡ كَتَبَ اللّٰهُ عَلَيۡهِمُ الۡجَـلَاۤءَ لَعَذَّبَهُمۡ فِى الدُّنۡيَا​ؕ وَلَهُمۡ فِى الۡاٰخِرَةِ عَذَابُ النَّارِ‏"
                    },
                    {
                        "num": 4,
                        "text": "ذٰ لِكَ بِاَنَّهُمۡ شَآقُّوا اللّٰهَ وَرَسُوۡلَهٗ​ ۚ وَمَنۡ يُّشَآقِّ اللّٰهَ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ‏"
                    },
                    {
                        "num": 5,
                        "text": "مَا قَطَعۡتُمۡ مِّنۡ لِّيۡنَةٍ اَوۡ تَرَكۡتُمُوۡهَا قَآٮِٕمَةً عَلٰٓى اُصُوۡلِهَا فَبِاِذۡنِ اللّٰهِ وَلِيُخۡزِىَ الۡفٰسِقِيۡنَ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَمَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوۡلِهٖ مِنۡهُمۡ فَمَاۤ اَوۡجَفۡتُمۡ عَلَيۡهِ مِنۡ خَيۡلٍ وَّلَا رِكَابٍ وَّلٰڪِنَّ اللّٰهَ يُسَلِّطُ رُسُلَهٗ عَلٰى مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 7,
                        "text": "مَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوۡلِهٖ مِنۡ اَهۡلِ الۡقُرٰى فَلِلّٰهِ وَلِلرَّسُوۡلِ وَلِذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِۙ كَىۡ لَا يَكُوۡنَ دُوۡلَةًۢ بَيۡنَ الۡاَغۡنِيَآءِ مِنۡكُمۡ​ ؕ وَمَاۤ اٰتٰٮكُمُ الرَّسُوۡلُ فَخُذُوْهُ وَ مَا َنَهٰٮكُمۡ عَنۡهُ فَانْتَهُوۡا​ ۚ وَاتَّقُوا اللّٰهَ ​ؕ اِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ​ۘ‏"
                    },
                    {
                        "num": 8,
                        "text": "لِلۡفُقَرَآءِ الۡمُهٰجِرِيۡنَ الَّذِيۡنَ اُخۡرِجُوۡا مِنۡ دِيَارِهِمۡ وَاَمۡوَالِهِمۡ يَبۡتَغُوۡنَ فَضۡلًا مِّنَ اللّٰهِ وَرِضۡوَانًا وَّيَنۡصُرُوۡنَ اللّٰهَ وَرَسُوۡلَهٗ​ؕ اُولٰٓٮِٕكَ هُمُ الصّٰدِقُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَالَّذِيۡنَ تَبَوَّؤُ الدَّارَ وَالۡاِيۡمَانَ مِنۡ قَبۡلِهِمۡ يُحِبُّوۡنَ مَنۡ هَاجَرَ اِلَيۡهِمۡ وَلَا يَجِدُوۡنَ فِىۡ صُدُوۡرِهِمۡ حَاجَةً مِّمَّاۤ اُوۡتُوۡا وَيُـؤۡثِرُوۡنَ عَلٰٓى اَنۡفُسِهِمۡ وَلَوۡ كَانَ بِهِمۡ خَصَاصَةٌ ؕ وَمَنۡ يُّوۡقَ شُحَّ نَـفۡسِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَالَّذِيۡنَ جَآءُوۡ مِنۡۢ بَعۡدِهِمۡ يَقُوۡلُوۡنَ رَبَّنَا اغۡفِرۡ لَـنَا وَلِاِخۡوَانِنَا الَّذِيۡنَ سَبَقُوۡنَا بِالۡاِيۡمَانِ وَلَا تَجۡعَلۡ فِىۡ قُلُوۡبِنَا غِلًّا لِّلَّذِيۡنَ اٰمَنُوۡا رَبَّنَاۤ اِنَّكَ رَءُوۡفٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 11,
                        "text": "اَلَمۡ تَرَ اِلَى الَّذِيۡنَ نَافَقُوۡا يَقُوۡلُوۡنَ لِاِخۡوَانِهِمُ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ لَٮِٕنۡ اُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيۡعُ فِيۡكُمۡ اَحَدًا اَبَدًاۙ وَّاِنۡ قُوۡتِلۡتُمۡ لَـنَـنۡصُرَنَّكُمۡ ؕ وَاللّٰهُ يَشۡهَدُ اِنَّهُمۡ لَـكٰذِبُوۡنَ‏"
                    },
                    {
                        "num": 12,
                        "text": "لَٮِٕنۡ اُخۡرِجُوۡا لَا يَخۡرُجُوۡنَ مَعَهُمۡ​ۚ وَلَٮِٕنۡ قُوۡتِلُوۡا لَا يَنۡصُرُوۡنَهُمۡ​ۚ وَلَٮِٕنۡ نَّصَرُوۡهُمۡ لَيُوَلُّنَّ الۡاَدۡبَارَ ثُمَّ لَا يُنۡصَرُوۡنَ‏"
                    },
                    {
                        "num": 13,
                        "text": "لَاَنۡتُمۡ اَشَدُّ رَهۡبَةً فِىۡ صُدُوۡرِهِمۡ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ قَوۡمٌ لَّا يَفۡقَهُوۡنَ‏"
                    },
                    {
                        "num": 14,
                        "text": "لَا يُقَاتِلُوۡنَكُمۡ جَمِيۡعًا اِلَّا فِىۡ قُرًى مُّحَصَّنَةٍ اَوۡ مِنۡ وَّرَآءِ جُدُرٍؕ بَاۡسُهُمۡ بَيۡنَهُمۡ شَدِيۡدٌ ​ؕ تَحۡسَبُهُمۡ جَمِيۡعًا وَّقُلُوۡبُهُمۡ شَتّٰى​ؕ ذٰلِكَ بِاَنَّهُمۡ قَوۡمٌ لَّا يَعۡقِلُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 15,
                        "text": "كَمَثَلِ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ قَرِيۡبًا​ ذَاقُوۡا وَبَالَ اَمۡرِهِمۡ​ۚ وَلَهُمۡ عَذَابٌ اَلِيۡمٌ​ۚ‏"
                    },
                    {
                        "num": 16,
                        "text": "كَمَثَلِ الشَّيۡطٰنِ اِذۡ قَالَ لِلۡاِنۡسَانِ اكۡفُرۡ​ۚ فَلَمَّا كَفَرَ قَالَ اِنِّىۡ بَرِىۡٓءٌ مِّنۡكَ اِنِّىۡۤ اَخَافُ اللّٰهَ رَبَّ الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 17,
                        "text": "فَكَانَ عَاقِبَتَهُمَاۤ اَنَّهُمَا فِى النَّارِ خَالِدَيۡنِ فِيۡهَا​ ؕ وَذٰ لِكَ جَزٰٓؤُا الظّٰلِمِيۡن‏"
                    },
                    {
                        "num": 18,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اتَّقُوا اللّٰهَ وَلۡتَـنۡظُرۡ نَـفۡسٌ مَّا قَدَّمَتۡ لِغَدٍ​ ۚ وَاتَّقُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ خَبِيۡرٌۢ بِمَا تَعۡمَلُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 19,
                        "text": "وَلَا تَكُوۡنُوۡا كَالَّذِيۡنَ نَسُوا اللّٰهَ فَاَنۡسٰٮهُمۡ اَنۡفُسَهُمۡ​ؕ اُولٰٓٮِٕكَ هُمُ الۡفٰسِقُوۡنَ‏"
                    },
                    {
                        "num": 20,
                        "text": "لَا يَسۡتَوِىۡۤ اَصۡحٰبُ النَّارِ وَاَصۡحٰبُ الۡجَـنَّةِ​ؕ اَصۡحٰبُ الۡجَـنَّةِ هُمُ الۡفَآٮِٕزُوۡنَ‏"
                    },
                    {
                        "num": 21,
                        "text": "لَوۡ اَنۡزَلۡنَا هٰذَا الۡقُرۡاٰنَ عَلٰى جَبَلٍ لَّرَاَيۡتَهٗ خَاشِعًا مُّتَصَدِّعًا مِّنۡ خَشۡيَةِ اللّٰهِ​ؕ وَتِلۡكَ الۡاَمۡثَالُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُوۡنَ‏"
                    },
                    {
                        "num": 22,
                        "text": "هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ​ ۚ عٰلِمُ الۡغَيۡبِ وَالشَّهَادَةِ​ ۚ هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ‏"
                    },
                    {
                        "num": 23,
                        "text": "هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ​ۚ اَلۡمَلِكُ الۡقُدُّوۡسُ السَّلٰمُ الۡمُؤۡمِنُ الۡمُهَيۡمِنُ الۡعَزِيۡزُ الۡجَـبَّارُ الۡمُتَكَبِّرُ​ؕ سُبۡحٰنَ اللّٰهِ عَمَّا يُشۡرِكُوۡنَ‏"
                    },
                    {
                        "num": 24,
                        "text": "هُوَ اللّٰهُ الۡخَـالِـقُ الۡبَارِئُ الۡمُصَوِّرُ​ لَـهُ الۡاَسۡمَآءُ الۡحُسۡنٰى​ؕ يُسَبِّحُ لَهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "Al-Mumtahanah",
                "number": 60,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡا عَدُوِّىۡ وَعَدُوَّكُمۡ اَوۡلِيَآءَ تُلۡقُوۡنَ اِلَيۡهِمۡ بِالۡمَوَدَّةِ وَقَدۡ كَفَرُوۡا بِمَا جَآءَكُمۡ مِّنَ الۡحَـقِّ​ ۚ يُخۡرِجُوۡنَ الرَّسُوۡلَ وَاِيَّاكُمۡ​ اَنۡ تُؤۡمِنُوۡا بِاللّٰهِ رَبِّكُمۡ ؕ اِنۡ كُنۡـتُمۡ خَرَجۡتُمۡ جِهَادًا فِىۡ سَبِيۡلِىۡ وَ ابۡتِغَآءَ مَرۡضَاتِىۡ ​ۖ  تُسِرُّوۡنَ اِلَيۡهِمۡ بِالۡمَوَدَّةِ ​ۖ  وَاَنَا اَعۡلَمُ بِمَاۤ اَخۡفَيۡتُمۡ وَمَاۤ اَعۡلَنۡتُمۡ​ؕ وَمَنۡ يَّفۡعَلۡهُ مِنۡكُمۡ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ‏ ﻿﻿"
                    },
                    {
                        "num": 2,
                        "text": "اِنۡ يَّثۡقَفُوۡكُمۡ يَكُوۡنُوۡا لَـكُمۡ اَعۡدَآءً وَّيَبۡسُطُوۡۤا اِلَيۡكُمۡ اَيۡدِيَهُمۡ وَاَلۡسِنَتَهُمۡ بِالسُّوۡٓءِ وَوَدُّوۡا لَوۡ تَكۡفُرُوۡنَؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "لَنۡ تَـنۡفَعَكُمۡ اَرۡحَامُكُمۡ وَلَاۤ اَوۡلَادُكُمۡ ۛۚ يَوۡمَ الۡقِيٰمَةِ ۛۚ يَفۡصِلُ بَيۡنَكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 4,
                        "text": "قَدۡ كَانَتۡ لَـكُمۡ اُسۡوَةٌ حَسَنَةٌ فِىۡۤ اِبۡرٰهِيۡمَ وَالَّذِيۡنَ مَعَهٗ​ۚ اِذۡ قَالُوۡا لِقَوۡمِهِمۡ اِنَّا بُرَءٰٓؤُا مِنۡكُمۡ وَمِمَّا تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ الۡعَدَاوَةُ وَالۡبَغۡضَآءُ اَبَدًا حَتّٰى تُؤۡمِنُوۡا بِاللّٰهِ وَحۡدَهٗۤ اِلَّا قَوۡلَ اِبۡرٰهِيۡمَ لِاَبِيۡهِ لَاَسۡتَغۡفِرَنَّ لَـكَ وَمَاۤ اَمۡلِكُ لَـكَ مِنَ اللّٰهِ مِنۡ شَىۡءٍ ​ؕ رَبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَاِلَيۡكَ اَنَـبۡنَا وَاِلَيۡكَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 5,
                        "text": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةً لِّلَّذِيۡنَ كَفَرُوۡا وَاغۡفِرۡ لَـنَا رَبَّنَا​ ۚ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 6,
                        "text": "لَقَدۡ كَانَ لَـكُمۡ فِيۡهِمۡ اُسۡوَةٌ حَسَنَةٌ لِّمَنۡ كَانَ يَرۡجُوا اللّٰهَ وَالۡيَوۡمَ الۡاٰخِرَ​ ؕ وَمَنۡ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الۡغَنِىُّ الۡحَمِيۡدُ‏ ﻿﻿"
                    },
                    {
                        "num": 7,
                        "text": "عَسَى اللّٰهُ اَنۡ يَّجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ الَّذِيۡنَ عَادَيۡتُمۡ مِّنۡهُمۡ مَّوَدَّةً ؕ وَاللّٰهُ قَدِيۡرٌ​ؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 8,
                        "text": "لَا يَنۡهٰٮكُمُ اللّٰهُ عَنِ الَّذِيۡنَ لَمۡ يُقَاتِلُوۡكُمۡ فِى الدِّيۡنِ وَلَمۡ يُخۡرِجُوۡكُمۡ مِّنۡ دِيَارِكُمۡ اَنۡ تَبَرُّوۡهُمۡ وَ تُقۡسِطُوۡۤا اِلَيۡهِمۡ​ؕ اِنَّ اللّٰهَ يُحِبُّ الۡمُقۡسِطِيۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "اِنَّمَا يَنۡهٰٮكُمُ اللّٰهُ عَنِ الَّذِيۡنَ قَاتَلُوۡكُمۡ فِى الدِّيۡنِ وَاَخۡرَجُوۡكُمۡ مِّنۡ دِيَارِكُمۡ وَظَاهَرُوۡا عَلٰٓى اِخۡرَاجِكُمۡ اَنۡ تَوَلَّوۡهُمۡ​ۚ وَمَنۡ يَّتَوَلَّهُمۡ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 10,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا جَآءَكُمُ الۡمُؤۡمِنٰتُ مُهٰجِرٰتٍ فَامۡتَحِنُوۡهُنَّ​ ؕ اَللّٰهُ اَعۡلَمُ بِاِيۡمَانِهِنَّ​ ۚ فَاِنۡ عَلِمۡتُمُوۡهُنَّ مُؤۡمِنٰتٍ فَلَا تَرۡجِعُوۡهُنَّ اِلَى الۡكُفَّارِ​ ؕ لَا هُنَّ حِلٌّ لَّهُمۡ وَلَا هُمۡ يَحِلُّوۡنَ لَهُنَّ​ ۚ وَاٰ تُوۡهُمۡ مَّاۤ اَنۡفَقُوۡا​ ؕ وَلَا جُنَاحَ عَلَيۡكُمۡ اَنۡ تَنۡكِحُوۡهُنَّ اِذَاۤ اٰ تَيۡتُمُوۡهُنَّ اُجُوۡرَهُنَّ​ ؕ وَلَا تُمۡسِكُوۡا بِعِصَمِ الۡكَوَافِرِ وَسۡــَٔـلُوۡا مَاۤ اَنۡفَقۡتُمۡ وَلۡيَسۡــَٔـلُوۡا مَاۤ اَنۡفَقُوۡا​ ؕ ذٰ لِكُمۡ حُكۡمُ اللّٰهِ​ ؕ يَحۡكُمُ بَيۡنَكُمۡ​ ؕ وَاللّٰهُ عَلِيۡمٌ حَكِيۡمٌ‏ ﻿﻿"
                    },
                    {
                        "num": 11,
                        "text": "وَاِنۡ فَاتَكُمۡ شَىۡءٌ مِّنۡ اَزۡوَاجِكُمۡ اِلَى الۡكُفَّارِ فَعَاقَبۡتُمۡ فَاٰ تُوا الَّذِيۡنَ ذَهَبَتۡ اَزۡوَاجُهُمۡ مِّثۡلَ مَاۤ اَنۡفَقُوۡا​ ؕ وَاتَّقُوا اللّٰهَ الَّذِىۡۤ اَنۡـتُمۡ بِهٖ مُؤۡمِنُوۡنَ‏"
                    },
                    {
                        "num": 12,
                        "text": "يٰۤاَيُّهَا النَّبِىُّ اِذَا جَآءَكَ الۡمُؤۡمِنٰتُ يُبَايِعۡنَكَ عَلٰٓى اَنۡ لَّا يُشۡرِكۡنَ بِاللّٰهِ شَيۡــًٔا وَّلَا يَسۡرِقۡنَ وَلَا يَزۡنِيۡنَ وَلَا يَقۡتُلۡنَ اَوۡلَادَهُنَّ وَلَا يَاۡتِيۡنَ بِبُهۡتَانٍ يَّفۡتَرِيۡنَهٗ بَيۡنَ اَيۡدِيۡهِنَّ وَاَرۡجُلِهِنَّ وَلَا يَعۡصِيۡنَكَ فِىۡ مَعۡرُوۡفٍ​ فَبَايِعۡهُنَّ وَاسۡتَغۡفِرۡ لَهُنَّ اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 13,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَتَوَلَّوۡا قَوۡمًا غَضِبَ اللّٰهُ عَلَيۡهِمۡ قَدۡ يَــٮِٕـسُوۡا مِنَ الۡاٰخِرَةِ كَمَا يَــٮِٕـسَ الۡكُفَّارُ مِنۡ اَصۡحٰبِ الۡقُبُوۡرِ‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "As-Saf",
                "number": 61,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "سَبَّحَ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 2,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لِمَ تَقُوۡلُوۡنَ مَا لَا تَفۡعَلُوۡنَ‏"
                    },
                    {
                        "num": 3,
                        "text": "كَبُرَ مَقۡتًا عِنۡدَ اللّٰهِ اَنۡ تَقُوۡلُوۡا مَا لَا تَفۡعَلُوۡنَ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنَّ اللّٰهَ يُحِبُّ الَّذِيۡنَ يُقَاتِلُوۡنَ فِىۡ سَبِيۡلِهٖ صَفًّا كَاَنَّهُمۡ بُنۡيَانٌ مَّرۡصُوۡصٌ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ لِمَ تُؤۡذُوۡنَنِىۡ وَقَد تَّعۡلَمُوۡنَ اَنِّىۡ رَسُوۡلُ اللّٰهِ اِلَيۡكُمۡؕ فَلَمَّا زَاغُوۡۤا اَزَاغَ اللّٰهُ قُلُوۡبَهُمۡ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡفٰسِقِيۡنَ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَاِذۡ قَالَ عِيۡسَى ابۡنُ مَرۡيَمَ يٰبَنِىۡۤ اِسۡرَآءِيۡلَ اِنِّىۡ رَسُوۡلُ اللّٰهِ اِلَيۡكُمۡ مُّصَدِّقًا لِّمَا بَيۡنَ يَدَىَّ مِنَ التَّوۡرٰٮةِ وَمُبَشِّرًۢا بِرَسُوۡلٍ يَّاۡتِىۡ مِنۡۢ بَعۡدِى اسۡمُهٗۤ اَحۡمَدُ​ؕ فَلَمَّا جَآءَهُمۡ بِالۡبَيِّنٰتِ قَالُوۡا هٰذَا سِحۡرٌ مُّبِيۡنٌ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَـرٰى عَلَى اللّٰهِ الۡكَذِبَ وَهُوَ يُدۡعٰٓى اِلَى الۡاِسۡلَامِ​ ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 8,
                        "text": "يُرِيۡدُوۡنَ لِيُطۡفِــُٔـوۡا نُوۡرَ اللّٰهِ بِاَ فۡوَاهِهِمْ وَاللّٰهُ مُتِمُّ نُوۡرِهٖ وَلَوۡ كَرِهَ الۡكٰفِرُوۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "هُوَ الَّذِىۡۤ اَرۡسَلَ رَسُوۡلَهٗ بِالۡهُدٰى وَدِيۡنِ الۡحَـقِّ لِيُظۡهِرَهٗ عَلَى الدِّيۡنِ كُلِّهٖ وَلَوۡ كَرِهَ الۡمُشۡرِكُوۡنَ‏"
                    },
                    {
                        "num": 10,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا هَلۡ اَدُلُّكُمۡ عَلٰى تِجَارَةٍ تُنۡجِيۡكُمۡ مِّنۡ عَذَابٍ اَلِيۡمٍ‏"
                    },
                    {
                        "num": 11,
                        "text": "تُؤۡمِنُوۡنَ بِاللّٰهِ وَرَسُوۡلِهٖ وَتُجَاهِدُوۡنَ فِىۡ سَبِيۡلِ اللّٰهِ بِاَمۡوَالِكُمۡ وَاَنۡفُسِكُمۡ​ؕ ذٰلِكُمۡ خَيۡرٌ لَّـكُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَۙ‏ ﻿﻿"
                    },
                    {
                        "num": 12,
                        "text": "يَغۡفِرۡ لَـكُمۡ ذُنُوۡبَكُمۡ وَيُدۡخِلۡكُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ وَمَسٰكِنَ طَيِّبَةً فِىۡ جَنّٰتِ عَدۡنٍ​ؕ ذٰلِكَ الۡفَوۡزُ الۡعَظِيۡمُۙ‏ ﻿﻿"
                    },
                    {
                        "num": 13,
                        "text": "وَاُخۡرٰى تُحِبُّوۡنَهَا​ ؕ نَصۡرٌ مِّنَ اللّٰهِ وَفَـتۡحٌ قَرِيۡبٌ​ ؕ وَبَشِّرِ الۡمُؤۡمِنِيۡنَ‏"
                    },
                    {
                        "num": 14,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُوۡنُوۡۤا اَنۡصَارَ اللّٰهِ كَمَا قَالَ عِيۡسَى ابۡنُ مَرۡيَمَ لِلۡحَوٰارِيّٖنَ مَنۡ اَنۡصَارِىۡۤ اِلَى اللّٰهِ​ؕ قَالَ الۡحَـوٰرِيُّوۡنَ نَحۡنُ اَنۡصَارُ اللّٰهِ​ فَاٰمَنَتۡ طَّآٮِٕفَةٌ مِّنۡۢ بَنِىۡۤ اِسۡرَآءِيۡلَ وَكَفَرَتۡ طَّآٮِٕفَةٌ ۚ فَاَيَّدۡنَا الَّذِيۡنَ اٰمَنُوۡا عَلٰى عَدُوِّهِمۡ فَاَصۡبَحُوۡا ظٰهِرِيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Jumu'ah",
                "number": 62,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يُسَبِّحُ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ الۡمَلِكِ الۡقُدُّوۡسِ الۡعَزِيۡزِ الۡحَكِيۡمِ‏"
                    },
                    {
                        "num": 2,
                        "text": "هُوَ الَّذِىۡ بَعَثَ فِى الۡاُمِّيّٖنَ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِهٖ وَيُزَكِّيۡهِمۡ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَاِنۡ كَانُوۡا مِنۡ قَبۡلُ لَفِىۡ ضَلٰلٍ مُّبِيۡنٍۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّاٰخَرِيۡنَ مِنۡهُمۡ لَمَّا يَلۡحَقُوۡا بِهِمۡ​ؕ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏ ﻿﻿"
                    },
                    {
                        "num": 4,
                        "text": "ذٰ لِكَ فَضۡلُ اللّٰهِ يُؤۡتِيۡهِ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ‏"
                    },
                    {
                        "num": 5,
                        "text": "مَثَلُ الَّذِيۡنَ حُمِّلُوا التَّوۡرٰٮةَ ثُمَّ لَمۡ يَحۡمِلُوۡهَا كَمَثَلِ الۡحِمَارِ يَحۡمِلُ اَسۡفَارًا​ ؕ بِئۡسَ مَثَلُ الۡقَوۡمِ الَّذِيۡنَ كَذَّبُوۡا بِاٰيٰتِ اللّٰهِ ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 6,
                        "text": "قُلۡ يٰۤاَيُّهَا الَّذِيۡنَ هَادُوۡۤا اِنۡ زَعَمۡتُمۡ اَنَّكُمۡ اَوۡلِيَآءُ لِلّٰهِ مِنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَلَا يَتَمَنَّوۡنَهٗۤ اَبَدًۢا بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 8,
                        "text": "قُلۡ اِنَّ الۡمَوۡتَ الَّذِىۡ تَفِرُّوۡنَ مِنۡهُ فَاِنَّهٗ مُلٰقِيۡكُمۡ​ ثُمَّ تُرَدُّوۡنَ اِلٰى عٰلِمِ الۡغَيۡبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمۡ بِمَا كُنۡتُمۡ تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا نُوۡدِىَ لِلصَّلٰوةِ مِنۡ يَّوۡمِ الۡجُمُعَةِ فَاسۡعَوۡا اِلٰى ذِكۡرِ اللّٰهِ وَذَرُوا الۡبَيۡعَ​ ؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَاِذَا قُضِيَتِ الصَّلٰوةُ فَانْتَشِرُوۡا فِى الۡاَرۡضِ وَابۡتَغُوۡا مِنۡ فَضۡلِ اللّٰهِ وَاذۡكُرُوا اللّٰهَ كَثِيۡرًا لَّعَلَّكُمۡ تُفۡلِحُوۡنَ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَاِذَا رَاَوۡا تِجَارَةً اَوۡ لَهۡوَا۟ اۨنْفَضُّوۡۤا اِلَيۡهَا وَتَرَكُوۡكَ قَآٮِٕمًا​ ؕ قُلۡ مَا عِنۡدَ اللّٰهِ خَيۡرٌ مِّنَ اللَّهۡوِ وَمِنَ التِّجَارَةِ​ ؕ وَاللّٰهُ خَيۡرُ الرّٰزِقِيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Munafiqun",
                "number": 63,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا جَآءَكَ الۡمُنٰفِقُوۡنَ قَالُوۡا نَشۡهَدُ اِنَّكَ لَرَسُوۡلُ اللّٰهِ ​ۘ وَاللّٰهُ يَعۡلَمُ اِنَّكَ لَرَسُوۡلُهٗ ؕ وَاللّٰهُ يَشۡهَدُ اِنَّ الۡمُنٰفِقِيۡنَ لَـكٰذِبُوۡنَ​ ۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "اِتَّخَذُوۡۤا اَيۡمَانَهُمۡ جُنَّةً فَصَدُّوۡا عَنۡ سَبِيۡلِ اللّٰهِ​ؕ اِنَّهُمۡ سَآءَ مَا كَانُوۡا يَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 3,
                        "text": "ذٰلِكَ بِاَنَّهُمۡ اٰمَنُوۡا ثُمَّ كَفَرُوۡا فَطُبِعَ عَلٰى قُلُوۡبِهِمۡ فَهُمۡ لَا يَفۡقَهُوۡنَ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاِذَا رَاَيۡتَهُمۡ تُعۡجِبُكَ اَجۡسَامُهُمۡ​ ؕ وَاِنۡ يَّقُوۡلُوۡا تَسۡمَعۡ لِقَوۡلِهِمۡ​ ؕ كَاَنَّهُمۡ خُشُبٌ مُّسَنَّدَةٌ   ​ؕ يَحۡسَبُوۡنَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡ​ ؕ هُمُ الۡعَدُوُّ فَاحۡذَرۡهُمۡ​ ؕ قَاتَلَهُمُ اللّٰهُ​ اَنّٰى يُـؤۡفَكُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 5,
                        "text": "وَاِذَا قِيۡلَ لَهُمۡ تَعَالَوۡا يَسۡتَغۡفِرۡ لَـكُمۡ رَسُوۡلُ اللّٰهِ لَـوَّوۡا رُءُوۡسَهُمۡ وَرَاَيۡتَهُمۡ يَصُدُّوۡنَ وَهُمۡ مُّسۡتَكۡبِرُوۡنَ‏"
                    },
                    {
                        "num": 6,
                        "text": "سَوَآءٌ عَلَيۡهِمۡ اَسۡتَغۡفَرۡتَ لَهُمۡ اَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡؕ لَنۡ يَّغۡفِرَ اللّٰهُ لَهُمۡ​ؕ اِنَّ اللّٰهَ لَا يَهۡدِى الۡقَوۡمَ الۡفٰسِقِيۡنَ‏"
                    },
                    {
                        "num": 7,
                        "text": "هُمُ الَّذِيۡنَ يَقُوۡلُوۡنَ لَا تُنۡفِقُوۡا عَلٰى مَنۡ عِنۡدَ رَسُوۡلِ اللّٰهِ حَتّٰى يَنۡفَضُّوۡا​ؕ وَلِلّٰهِ خَزَآٮِٕنُ السَّمٰوٰتِ وَالۡاَرۡضِ وَلٰـكِنَّ الۡمُنٰفِقِيۡنَ لَا يَفۡقَهُوۡنَ‏"
                    },
                    {
                        "num": 8,
                        "text": "يَقُوۡلُوۡنَ لَٮِٕنۡ رَّجَعۡنَاۤ اِلَى الۡمَدِيۡنَةِ لَيُخۡرِجَنَّ الۡاَعَزُّ مِنۡهَا الۡاَذَلَّ ​ؕ وَلِلّٰهِ الۡعِزَّةُ وَلِرَسُوۡلِهٖ وَلِلۡمُؤۡمِنِيۡنَ وَلٰـكِنَّ الۡمُنٰفِقِيۡنَ لَا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُلۡهِكُمۡ اَمۡوَالُكُمۡ وَلَاۤ اَوۡلَادُكُمۡ عَنۡ ذِكۡرِ اللّٰهِ​ۚ وَمَنۡ يَّفۡعَلۡ ذٰلِكَ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 10,
                        "text": "وَاَنۡفِقُوۡا مِنۡ مَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ اَحَدَكُمُ الۡمَوۡتُ فَيَقُوۡلَ رَبِّ لَوۡلَاۤ اَخَّرۡتَنِىۡۤ اِلٰٓى اَجَلٍ قَرِيۡبٍۙ فَاَصَّدَّقَ وَاَكُنۡ مِّنَ الصّٰلِحِيۡنَ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَلَنۡ يُّؤَخِّرَ اللّٰهُ نَفۡسًا اِذَا جَآءَ اَجَلُهَا​ؕ وَاللّٰهُ خَبِيۡرٌۢ بِمَا تَعۡمَلُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "At-Taghabun",
                "number": 64,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يُسَبِّحُ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ۚ لَهُ الۡمُلۡكُ وَلَهُ الۡحَمۡدُ​ وَهُوَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 2,
                        "text": "هُوَ الَّذِىۡ خَلَقَكُمۡ فَمِنۡكُمۡ كَافِرٌ وَّمِنۡكُمۡ مُّؤۡمِنٌ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 3,
                        "text": "خَلَقَ السَّمٰوٰتِ وَالۡاَرۡضَ بِالۡحَـقِّ وَصَوَّرَكُمۡ​ فَاَحۡسَنَ صُوَرَكُمۡۚ​ وَاِلَيۡهِ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 4,
                        "text": "يَعۡلَمُ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ وَيَعۡلَمُ مَا تُسِرُّوۡنَ وَمَا تُعۡلِنُوۡنَ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏"
                    },
                    {
                        "num": 5,
                        "text": "اَلَمۡ يَاۡتِكُمۡ نَبَـؤُا الَّذِيۡنَ كَفَرُوۡا مِنۡ قَبۡلُ فَذَاقُوۡا وَبَالَ اَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ اَلِيۡمٌ‏"
                    },
                    {
                        "num": 6,
                        "text": "ذٰ لِكَ بِاَنَّهٗ كَانَتۡ تَّاۡتِيۡهِمۡ رُسُلُهُمۡ بِالۡبَيِّنٰتِ فَقَالُوۡۤا اَبَشَرٌ يَّهۡدُوۡنَـنَا فَكَفَرُوۡا وَتَوَلَّوْا​ وَّاسۡتَغۡنَى اللّٰهُ​ ؕ وَاللّٰهُ غَنِىٌّ حَمِيۡدٌ‏"
                    },
                    {
                        "num": 7,
                        "text": "زَعَمَ الَّذِيۡنَ كَفَرُوۡۤا اَنۡ لَّنۡ يُّبۡـعَـثُـوۡا​ ؕ قُلۡ بَلٰى وَرَبِّىۡ لَـتُبۡـعَـثُـنَّ ثُمَّ لَـتُنَـبَّـؤُنَّ بِمَا عَمِلۡـتُمۡ​ؕ وَذٰ لِكَ عَلَى اللّٰهِ يَسِيۡرٌ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَاٰمِنُوۡا بِاللّٰهِ وَرَسُوۡلِهٖ وَالنُّوۡرِ الَّذِىۡۤ اَنۡزَلۡنَا​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ‏"
                    },
                    {
                        "num": 9,
                        "text": "يَوۡمَ يَجۡمَعُكُمۡ لِيَوۡمِ الۡجَمۡعِ​ ذٰ لِكَ يَوۡمُ التَّغَابُنِ​ ؕ وَمَنۡ يُّؤۡمِنۡۢ بِاللّٰهِ وَيَعۡمَلۡ صَالِحًـا يُّكَفِّرۡ عَنۡهُ سَيِّاٰتِهٖ وَيُدۡخِلۡهُ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَاۤ اَبَدًا​ ؕ ذٰ لِكَ الۡفَوۡزُ الۡعَظِیْمُ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِاٰيٰتِنَاۤ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ خٰلِدِيۡنَ فِيۡهَا​ ؕ وَبِئۡسَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 11,
                        "text": "مَاۤ اَصَابَ مِنۡ مُّصِيۡبَةٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَمَنۡ يُّؤۡمِنۡۢ بِاللّٰهِ يَهۡدِ قَلۡبَهٗ​ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَاَطِيۡعُوا اللّٰهَ وَاَطِيۡعُوا الرَّسُوۡلَ​ۚ فَاِنۡ تَوَلَّيۡتُمۡ فَاِنَّمَا عَلٰى رَسُوۡلِنَا الۡبَلٰغُ الۡمُبِيۡنُ‏"
                    },
                    {
                        "num": 13,
                        "text": "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ​ؕ وَعَلَى اللّٰهِ فَلۡيَتَوَكَّلِ الۡمُؤۡمِنُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 14,
                        "text": "​يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِنَّ مِنۡ اَزۡوَاجِكُمۡ وَاَوۡلَادِكُمۡ عَدُوًّا لَّكُمۡ فَاحۡذَرُوۡهُمۡ​ۚ وَاِنۡ تَعۡفُوۡا وَتَصۡفَحُوۡا وَتَغۡفِرُوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 15,
                        "text": "اِنَّمَاۤ اَمۡوَالُـكُمۡ وَاَوۡلَادُكُمۡ فِتۡنَةٌ ​ؕ وَاللّٰهُ عِنۡدَهٗۤ اَجۡرٌ عَظِيۡمٌ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَاتَّقُوا اللّٰهَ مَا اسۡتَطَعۡتُمۡ وَاسۡمَعُوۡا وَاَطِيۡعُوۡا وَاَنۡفِقُوۡا خَيۡرًا لِّاَنۡفُسِكُمۡ​ؕ وَمَنۡ يُّوۡقَ شُحَّ نَفۡسِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 17,
                        "text": "اِنۡ تُقۡرِضُوا اللّٰهَ قَرۡضًا حَسَنًا يُّضٰعِفۡهُ لَـكُمۡ وَيَغۡفِرۡ لَـكُمۡ​ؕ وَاللّٰهُ شَكُوۡرٌ حَلِيۡمٌۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "عٰلِمُ الۡغَيۡبِ وَالشَّهَادَةِ الۡعَزِيۡزُ الۡحَكِيۡمُ‏"
                    }
                ]
            },
            {
                "surah": "Ath-Thalaq",
                "number": 65,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤاَيُّهَا النَّبِىُّ اِذَا طَلَّقۡتُمُ النِّسَآءَ فَطَلِّقُوۡهُنَّ لِعِدَّتِهِنَّ وَاَحۡصُوا الۡعِدَّةَ ​ ۚ وَاتَّقُوا اللّٰهَ رَبَّكُمۡ​ ۚ لَا تُخۡرِجُوۡهُنَّ مِنۡۢ بُيُوۡتِهِنَّ وَلَا يَخۡرُجۡنَ اِلَّاۤ اَنۡ يَّاۡتِيۡنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ​ ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ​ ؕ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَقَدۡ ظَلَمَ نَفۡسَهٗ​ ؕ لَا تَدۡرِىۡ لَعَلَّ اللّٰهَ يُحۡدِثُ بَعۡدَ ذٰ لِكَ اَمۡرًا‏"
                    },
                    {
                        "num": 2,
                        "text": "فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ فَارِقُوۡهُنَّ بِمَعۡرُوۡفٍ وَّاَشۡهِدُوۡا ذَوَىۡ عَدۡلٍ مِّنۡكُمۡ وَاَقِيۡمُوا الشَّهَادَةَ لِلّٰهِ​ ؕ ذٰ لِكُمۡ يُوۡعَظُ بِهٖ مَنۡ كَانَ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ ۙ وَمَنۡ يَّـتَّـقِ اللّٰهَ يَجۡعَلْ لَّهٗ مَخۡرَجًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُ​ ؕ وَمَنۡ يَّتَوَكَّلۡ عَلَى اللّٰهِ فَهُوَ حَسۡبُهٗ ؕ اِنَّ اللّٰهَ بَالِغُ اَمۡرِهٖ​ ؕ قَدۡ جَعَلَ اللّٰهُ لِكُلِّ شَىۡءٍ قَدۡرًا‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالّٰٓـىٴِۡ يَٮِٕسۡنَ مِنَ الۡمَحِيۡضِ مِنۡ نِّسَآٮِٕكُمۡ اِنِ ارۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلٰثَةُ اَشۡهُرٍ وَّالّٰٓـىٴِۡ لَمۡ يَحِضۡنَ​ ؕ وَاُولَاتُ الۡاَحۡمَالِ اَجَلُهُنَّ اَنۡ يَّضَعۡنَ حَمۡلَهُنَّ ​ؕ وَمَنۡ يَّـتَّـقِ اللّٰهَ يَجۡعَلْ لَّهٗ مِنۡ اَمۡرِهٖ یُسْرًا‏"
                    },
                    {
                        "num": 5,
                        "text": "ذٰ لِكَ اَمۡرُ اللّٰهِ اَنۡزَلَهٗۤ اِلَيۡكُمۡ​ ؕ وَمَنۡ يَّـتَّـقِ اللّٰهَ يُكَفِّرۡ عَنۡهُ سَيِّاٰتِهٖ وَيُعۡظِمۡ لَهٗۤ اَجۡرًا‏"
                    },
                    {
                        "num": 6,
                        "text": "اَسۡكِنُوۡهُنَّ مِنۡ حَيۡثُ سَكَنۡـتُمۡ مِّنۡ وُّجۡدِكُمۡ وَلَا تُضَآرُّوۡهُنَّ لِتُضَيِّقُوۡا عَلَيۡهِنَّ​ ؕ وَاِنۡ كُنَّ اُولَاتِ حَمۡلٍ فَاَنۡفِقُوا عَلَيۡهِنَّ حَتّٰى يَضَعۡنَ حَمۡلَهُنَّ​​ ۚ فَاِنۡ اَرۡضَعۡنَ لَـكُمۡ فَاٰ تُوۡهُنَّ اُجُوۡرَهُنَّ​ ۚ وَاۡتَمِرُوۡا بَيۡنَكُمۡ بِمَعۡرُوۡفٍ​ۚ وَاِنۡ تَعَاسَرۡتُمۡ فَسَتُرۡضِعُ لَهٗۤ اُخۡرٰى ؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "لِيُنۡفِقۡ ذُوۡ سَعَةٍ مِّنۡ سَعَتِهٖ​ؕ وَمَنۡ قُدِرَ عَلَيۡهِ رِزۡقُهٗ فَلۡيُنۡفِقۡ مِمَّاۤ اٰتٰٮهُ اللّٰهُ​ؕ لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا مَاۤ اٰتٰٮهَا​ؕ سَيَجۡعَلُ اللّٰهُ بَعۡدَ عُسۡرٍ يُّسۡرًا‏"
                    },
                    {
                        "num": 8,
                        "text": "وَكَاَيِّنۡ مِّنۡ قَرۡيَةٍ عَتَتۡ عَنۡ اَمۡرِ رَبِّهَا وَرُسُلِهٖ فَحَاسَبۡنٰهَا حِسَابًا شَدِيۡدًاۙ وَّعَذَّبۡنٰهَا عَذَابًا نُّكۡرًا‏"
                    },
                    {
                        "num": 9,
                        "text": "فَذَاقَتۡ وَبَالَ اَمۡرِهَا وَكَانَ عَاقِبَةُ اَمۡرِهَا خُسۡرًا‏"
                    },
                    {
                        "num": 10,
                        "text": "اَعَدَّ اللّٰهُ لَهُمۡ عَذَابًا شَدِيۡدًا​ ۙ فَاتَّقُوا اللّٰهَ يٰۤاُولِى الۡاَ لۡبَابِ ۖۚ ۛ الَّذِيۡنَ اٰمَنُوۡا ۛؕ قَدۡ اَنۡزَلَ اللّٰهُ اِلَيۡكُمۡ ذِكۡرًا ۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "رَّسُوۡلًا يَّتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِ اللّٰهِ مُبَيِّنٰتٍ لِّيُخۡرِجَ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ وَمَنۡ يُّؤۡمِنۡۢ بِاللّٰهِ وَيَعۡمَلۡ صَالِحًـا يُّدۡخِلۡهُ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَاۤ اَبَدًا​ؕ قَدۡ اَحۡسَنَ اللّٰهُ لَهٗ رِزۡقًا‏"
                    },
                    {
                        "num": 12,
                        "text": "اَللّٰهُ الَّذِىۡ خَلَقَ سَبۡعَ سَمٰوٰتٍ وَّمِنَ الۡاَرۡضِ مِثۡلَهُنَّ ؕ يَتَنَزَّلُ الۡاَمۡرُ بَيۡنَهُنَّ لِتَعۡلَمُوۡۤا اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ ۙ وَّاَنَّ اللّٰهَ قَدۡ اَحَاطَ بِكُلِّ شَىۡءٍ عِلۡمًا‏"
                    }
                ]
            },
            {
                "surah": "At-Tahrim",
                "number": 66,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤاَيُّهَا النَّبِىُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَـكَ​ۚ تَبۡتَغِىۡ مَرۡضَاتَ اَزۡوَاجِكَ​ؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    },
                    {
                        "num": 2,
                        "text": "قَدۡ فَرَضَ اللّٰهُ لَـكُمۡ تَحِلَّةَ اَيۡمَانِكُمۡ​ؕ وَاللّٰهُ مَوۡلٰٮكُمۡ​ۚ وَهُوَ الۡعَلِيۡمُ الۡحَكِيۡمُ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِذۡ اَسَرَّ النَّبِىُّ اِلٰى بَعۡضِ اَزۡوَاجِهٖ حَدِيۡثًا​ۚ فَلَمَّا نَـبَّاَتۡ بِهٖ وَاَظۡهَرَهُ اللّٰهُ عَلَيۡهِ عَرَّفَ بَعۡضَهٗ وَاَعۡرَضَ عَنۡۢ بَعۡضٍ​ۚ فَلَمَّا نَـبَّاَهَا بِهٖ قَالَتۡ مَنۡ اَنۡۢبَاَكَ هٰذَا​ؕ قَالَ نَـبَّاَنِىَ الۡعَلِيۡمُ الۡخَبِیْرُ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنۡ تَتُوۡبَاۤ اِلَى اللّٰهِ فَقَدۡ صَغَتۡ قُلُوۡبُكُمَا​ۚ وَاِنۡ تَظٰهَرَا عَلَيۡهِ فَاِنَّ اللّٰهَ هُوَ مَوۡلٰٮهُ وَجِبۡرِيۡلُ وَصَالِحُ الۡمُؤۡمِنِيۡنَ​ۚ وَالۡمَلٰٓٮِٕكَةُ بَعۡدَ ذٰلِكَ ظَهِيۡرٌ‏"
                    },
                    {
                        "num": 5,
                        "text": "عَسٰى رَبُّهٗۤ اِنۡ طَلَّقَكُنَّ اَنۡ يُّبۡدِلَهٗۤ اَزۡوَاجًا خَيۡرًا مِّنۡكُنَّ مُسۡلِمٰتٍ مُّؤۡمِنٰتٍ قٰنِتٰتٍ تٰٓٮِٕبٰتٍ عٰبِدٰتٍ سٰٓٮِٕحٰتٍ ثَيِّبٰتٍ وَّاَبۡكَارًا‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا قُوۡۤا اَنۡفُسَكُمۡ وَاَهۡلِيۡكُمۡ نَارًا وَّقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ عَلَيۡهَا مَلٰٓٮِٕكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعۡصُوۡنَ اللّٰهَ مَاۤ اَمَرَهُمۡ وَيَفۡعَلُوۡنَ مَا يُؤۡمَرُوۡنَ‏"
                    },
                    {
                        "num": 7,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ كَفَرُوۡا لَا تَعۡتَذِرُوا الۡيَوۡمَ​ؕ اِنَّمَا تُجۡزَوۡنَ مَا كُنۡتُمۡ تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 8,
                        "text": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا تُوۡبُوۡۤا اِلَى اللّٰهِ تَوۡبَةً نَّصُوۡحًا ؕ عَسٰى رَبُّكُمۡ اَنۡ يُّكَفِّرَ عَنۡكُمۡ سَيِّاٰتِكُمۡ وَيُدۡخِلَـكُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ ۙ يَوۡمَ لَا يُخۡزِى اللّٰهُ النَّبِىَّ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ​ ۚ نُوۡرُهُمۡ يَسۡعٰى بَيۡنَ اَيۡدِيۡهِمۡ وَبِاَيۡمَانِهِمۡ يَقُوۡلُوۡنَ رَبَّنَاۤ اَ تۡمِمۡ لَـنَا نُوۡرَنَا وَاغۡفِرۡ لَـنَا​ ۚ اِنَّكَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ‏"
                    },
                    {
                        "num": 9,
                        "text": "يٰۤاَيُّهَا النَّبِىُّ جَاهِدِ الۡكُفَّارَ وَالۡمُنٰفِقِيۡنَ وَاغۡلُظۡ عَلَيۡهِمۡ​ؕ وَمَاۡوٰٮهُمۡ جَهَنَّمُ​ؕ وَبِئۡسَ الۡمَصِيۡرُ‏"
                    },
                    {
                        "num": 10,
                        "text": "ضَرَبَ اللّٰهُ مَثَلًا لِّـلَّذِيۡنَ كَفَرُوا امۡرَاَتَ نُوۡحٍ وَّ امۡرَاَتَ لُوۡطٍ​ ؕ كَانَـتَا تَحۡتَ عَبۡدَيۡنِ مِنۡ عِبَادِنَا صَالِحَـيۡنِ فَخَانَتٰهُمَا فَلَمۡ يُغۡنِيَا عَنۡهُمَا مِنَ اللّٰهِ شَيۡــًٔا وَّقِيۡلَ ادۡخُلَا النَّارَ مَعَ الدّٰخِلِيۡنَ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَضَرَبَ اللّٰهُ مَثَلًا لِّـلَّذِيۡنَ اٰمَنُوۡا امۡرَاَتَ فِرۡعَوۡنَ​ۘ اِذۡ قَالَتۡ رَبِّ ابۡنِ لِىۡ عِنۡدَكَ بَيۡتًا فِى الۡجَـنَّةِ وَنَجِّنِىۡ مِنۡ فِرۡعَوۡنَ وَعَمَلِهٖ وَنَجِّنِىۡ مِنَ الۡقَوۡمِ الظّٰلِمِيۡنَۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَمَرۡيَمَ ابۡنَتَ عِمۡرٰنَ الَّتِىۡۤ اَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيۡهِ مِنۡ رُّوۡحِنَا وَصَدَّقَتۡ بِكَلِمٰتِ رَبِّهَا وَكُتُبِهٖ وَكَانَتۡ مِنَ الۡقٰنِتِيۡنَ‏ ﻿﻿"
                    }
                ]
            }
        ]
    },
    "29": {
        "name": "Juz 29",
        "surahs": [
            {
                "surah": "Al-Mulk",
                "number": 67,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "تَبٰرَكَ الَّذِىۡ بِيَدِهِ الۡمُلۡكُ وَهُوَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرُۙ‏ ﻿﻿"
                    },
                    {
                        "num": 2,
                        "text": "اۨلَّذِىۡ خَلَقَ الۡمَوۡتَ وَالۡحَيٰوةَ لِيَبۡلُوَكُمۡ اَيُّكُمۡ اَحۡسَنُ عَمَلًا ؕ وَهُوَ الۡعَزِيۡزُ الۡغَفُوۡرُۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "الَّذِىۡ خَلَقَ سَبۡعَ سَمٰوٰتٍ طِبَاقًا​ ؕ مَا تَرٰى فِىۡ خَلۡقِ الرَّحۡمٰنِ مِنۡ تَفٰوُتٍ​ ؕ فَارۡجِعِ الۡبَصَرَۙ هَلۡ تَرٰى مِنۡ فُطُوۡرٍ‏"
                    },
                    {
                        "num": 4,
                        "text": "ثُمَّ ارۡجِعِ الۡبَصَرَ كَرَّتَيۡنِ يَنۡقَلِبۡ اِلَيۡكَ الۡبَصَرُ خَاسِئًا وَّهُوَ حَسِيۡرٌ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَلَـقَدۡ زَيَّـنَّا السَّمَآءَ الدُّنۡيَا بِمَصَابِيۡحَ وَجَعَلۡنٰهَا رُجُوۡمًا لِّلشَّيٰطِيۡنِ​ وَاَعۡتَدۡنَا لَهُمۡ عَذَابَ السَّعِيۡرِ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَلِلَّذِيۡنَ كَفَرُوۡا بِرَبِّهِمۡ عَذَابُ جَهَنَّمَ​ؕ وَبِئۡسَ الۡمَصِيۡرُ‏ ﻿﻿"
                    },
                    {
                        "num": 7,
                        "text": "اِذَاۤ اُلۡقُوۡا فِيۡهَا سَمِعُوۡا لَهَا شَهِيۡقًا وَّهِىَ تَفُوۡرُۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "تَكَادُ تَمَيَّزُ مِنَ الۡغَيۡظِ​ؕ كُلَّمَاۤ اُلۡقِىَ فِيۡهَا فَوۡجٌ سَاَلَهُمۡ خَزَنَـتُهَاۤ اَلَمۡ يَاۡتِكُمۡ نَذِيۡرٌ‏"
                    },
                    {
                        "num": 9,
                        "text": "قَالُوۡا بَلٰى قَدۡ جَآءَنَا نَذِيۡرٌ  ۙ فَكَذَّبۡنَا وَقُلۡنَا مَا نَزَّلَ اللّٰهُ مِنۡ شَىۡءٍ ۖۚ اِنۡ اَنۡتُمۡ اِلَّا فِىۡ ضَلٰلٍ كَبِيۡرٍ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَقَالُوۡا لَوۡ كُنَّا نَسۡمَعُ اَوۡ نَعۡقِلُ مَا كُنَّا فِىۡۤ اَصۡحٰبِ السَّعِيۡرِ‏ ﻿﻿"
                    },
                    {
                        "num": 11,
                        "text": "فَاعۡتَرَفُوۡا بِذَنۡۢبِهِمۡ​ۚ فَسُحۡقًا لِّاَصۡحٰبِ السَّعِيۡرِ‏"
                    },
                    {
                        "num": 12,
                        "text": "اِنَّ الَّذِيۡنَ يَخۡشَوۡنَ رَبَّهُمۡ بِالۡغَيۡبِ لَهُمۡ مَّغۡفِرَةٌ وَّاَجۡرٌ كَبِيۡرٌ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَاَسِرُّوۡا قَوۡلَـكُمۡ اَوِ اجۡهَرُوۡا بِهٖؕ اِنَّهٗ عَلِيۡمٌۢ بِذَاتِ الصُّدُوۡرِ‏ ﻿﻿"
                    },
                    {
                        "num": 14,
                        "text": "اَلَا يَعۡلَمُ مَنۡ خَلَقَؕ وَهُوَ اللَّطِيۡفُ الۡخَبِيۡرُ‏"
                    },
                    {
                        "num": 15,
                        "text": "هُوَ الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ ذَلُوۡلًا فَامۡشُوۡا فِىۡ مَنَاكِبِهَا وَكُلُوۡا مِنۡ رِّزۡقِهٖ​ؕ وَاِلَيۡهِ النُّشُوۡرُ‏"
                    },
                    {
                        "num": 16,
                        "text": "ءَاَمِنۡتُمۡ مَّنۡ فِىۡ السَّمَآءِ اَنۡ يَّخۡسِفَ بِكُمُ الۡاَرۡضَ فَاِذَا هِىَ تَمُوۡرُۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "اَمۡ اَمِنۡتُمۡ مَّنۡ فِى السَّمَآءِ اَنۡ يُّرۡسِلَ عَلَيۡكُمۡ حَاصِبًا​ ؕ فَسَتَعۡلَمُوۡنَ كَيۡفَ نَذِيۡرِ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَلَـقَدۡ كَذَّبَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ فَكَيۡفَ كَانَ نَكِيۡرِ‏"
                    },
                    {
                        "num": 19,
                        "text": "اَوَلَمۡ يَرَوۡا اِلَى الطَّيۡرِ فَوۡقَهُمۡ صٰٓفّٰتٍ وَّيَقۡبِضۡنَؕ ۘ مَا يُمۡسِكُهُنَّ اِلَّا الرَّحۡمٰنُ​ؕ اِنَّهٗ بِكُلِّ شَىۡءٍۢ بَصِيۡرٌ‏"
                    },
                    {
                        "num": 20,
                        "text": "اَمَّنۡ هٰذَا الَّذِىۡ هُوَ جُنۡدٌ لَّكُمۡ يَنۡصُرُكُمۡ مِّنۡ دُوۡنِ الرَّحۡمٰنِ​ؕ اِنِ الۡكٰفِرُوۡنَ اِلَّا فِىۡ غُرُوۡرٍ​ۚ‏"
                    },
                    {
                        "num": 21,
                        "text": "اَمَّنۡ هٰذَا الَّذِىۡ يَرۡزُقُكُمۡ اِنۡ اَمۡسَكَ رِزۡقَهٗ​ ۚ بَلۡ لَّجُّوۡا فِىۡ عُتُوٍّ وَّنُفُوۡرٍ‏"
                    },
                    {
                        "num": 22,
                        "text": "اَفَمَنۡ يَّمۡشِىۡ مُكِبًّا عَلٰى وَجۡهِهٖۤ اَهۡدٰٓى اَمَّنۡ يَّمۡشِىۡ سَوِيًّا عَلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ‏"
                    },
                    {
                        "num": 23,
                        "text": "قُلۡ هُوَ الَّذِىۡۤ اَنۡشَاَكُمۡ وَجَعَلَ لَـكُمُ السَّمۡعَ وَالۡاَبۡصَارَ وَ الۡاَفۡـــِٕدَةَ ​ ؕ قَلِيۡلًا مَّا تَشۡكُرُوۡنَ‏"
                    },
                    {
                        "num": 24,
                        "text": "قُلۡ هُوَ الَّذِىۡ ذَرَاَكُمۡ فِى الۡاَرۡضِ وَاِلَيۡهِ تُحۡشَرُوۡنَ‏"
                    },
                    {
                        "num": 25,
                        "text": "وَيَقُوۡلُوۡنَ مَتٰى هٰذَا الۡوَعۡدُ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ‏"
                    },
                    {
                        "num": 26,
                        "text": "قُلۡ اِنَّمَا الۡعِلۡمُ عِنۡدَ اللّٰهِ وَاِنَّمَاۤ اَنَا نَذِيۡرٌ مُّبِيۡنٌ‏ ﻿﻿"
                    },
                    {
                        "num": 27,
                        "text": "فَلَمَّا رَاَوۡهُ زُلۡفَةً سِیْٓــَٔتۡ وُجُوۡهُ الَّذِيۡنَ كَفَرُوۡا وَقِيۡلَ هٰذَا الَّذِىۡ كُنۡتُمۡ بِهٖ تَدَّعُوۡنَ‏"
                    },
                    {
                        "num": 28,
                        "text": "قُلۡ اَرَءَيۡتُمۡ اِنۡ اَهۡلَـكَنِىَ اللّٰهُ وَمَنۡ مَّعِىَ اَوۡ رَحِمَنَا ۙ فَمَنۡ يُّجِيۡرُ الۡكٰفِرِيۡنَ مِنۡ عَذَابٍ اَلِيۡمٍ‏"
                    },
                    {
                        "num": 29,
                        "text": "قُلۡ هُوَ الرَّحۡمٰنُ اٰمَنَّا بِهٖ وَعَلَيۡهِ تَوَكَّلۡنَا​ۚ فَسَتَعۡلَمُوۡنَ مَنۡ هُوَ فِىۡ ضَلٰلٍ مُّبِيۡنٍ‏"
                    },
                    {
                        "num": 30,
                        "text": "قُلۡ اَرَءَيۡتُمۡ اِنۡ اَصۡبَحَ مَآؤُكُمۡ غَوۡرًا فَمَنۡ يَّاۡتِيۡكُمۡ بِمَآءٍ مَّعِيۡنٍ‏"
                    }
                ]
            },
            {
                "surah": "Al-Qalam",
                "number": 68,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "نٓ​ وَالۡقَلَمِ وَمَا يَسۡطُرُوۡنَۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَاۤ اَنۡتَ بِـنِعۡمَةِ رَبِّكَ بِمَجۡنُوۡنٍ​ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِنَّ لَڪَ لَاَجۡرًا غَيۡرَ مَمۡنُوۡنٍ​ۚ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاِنَّكَ لَعَلٰى خُلُقٍ عَظِيۡمٍ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَسَتُبۡصِرُ وَيُبۡصِرُوۡنَۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "بِاَيِّٮكُمُ الۡمَفۡتُوۡنُ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِنَّ رَبَّكَ هُوَ اَعۡلَمُ بِمَنۡ ضَلَّ عَنۡ سَبِيۡلِهٖ وَهُوَ اَعۡلَمُ بِالۡمُهۡتَدِيۡنَ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَلَا تُطِعِ الۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَدُّوۡا لَوۡ تُدۡهِنُ فَيُدۡهِنُوۡنَ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَلَا تُطِعۡ كُلَّ حَلَّافٍ مَّهِيۡنٍۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "هَمَّازٍ مَّشَّآءٍۢ بِنَمِيۡمٍۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "مَّنَّاعٍ لِّلۡخَيۡرِ مُعۡتَدٍ اَثِيۡمٍۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "عُتُلٍّ ۢ بَعۡدَ ذٰلِكَ زَنِيۡمٍۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "اَنۡ كَانَ ذَا مَالٍ وَّبَنِيۡنَؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "اِذَا تُتۡلٰى عَلَيۡهِ اٰيٰتُنَا قَالَ اَسَاطِيۡرُ الۡاَوَّلِيۡنَ‏"
                    },
                    {
                        "num": 16,
                        "text": "سَنَسِمُهٗ عَلَى الۡخُـرۡطُوۡمِ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِنَّا بَلَوۡنٰهُمۡ كَمَا بَلَوۡنَاۤ اَصۡحٰبَ الۡجَـنَّةِ​ ۚ اِذۡ اَقۡسَمُوۡا لَيَصۡرِمُنَّهَا مُصۡبِحِيۡنَۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَلَا يَسۡتَثۡنُوۡنَ‏"
                    },
                    {
                        "num": 19,
                        "text": "فَطَافَ عَلَيۡهَا طَآٮِٕفٌ مِّنۡ رَّبِّكَ وَهُمۡ نَآٮِٕمُوۡنَ‏"
                    },
                    {
                        "num": 20,
                        "text": "فَاَصۡبَحَتۡ كَالصَّرِيۡمِۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَتَـنَادَوۡا مُصۡبِحِيۡنَۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "اَنِ اغۡدُوۡا عَلٰى حَرۡثِكُمۡ اِنۡ كُنۡتُمۡ صٰرِمِيۡنَ‏"
                    },
                    {
                        "num": 23,
                        "text": "فَانۡطَلَقُوۡا وَهُمۡ يَتَخَافَتُوۡنَۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "اَنۡ لَّا يَدۡخُلَنَّهَا الۡيَوۡمَ عَلَيۡكُمۡ مِّسۡكِيۡنٌۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "وَّغَدَوۡا عَلٰى حَرۡدٍ قٰدِرِيۡنَ‏"
                    },
                    {
                        "num": 26,
                        "text": "فَلَمَّا رَاَوۡهَا قَالُوۡۤا اِنَّا لَـضَآلُّوۡنَۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "بَلۡ نَحۡنُ مَحۡرُوۡمُوۡنَ‏"
                    },
                    {
                        "num": 28,
                        "text": "قَالَ اَوۡسَطُهُمۡ اَلَمۡ اَقُلۡ لَّكُمۡ لَوۡلَا تُسَبِّحُوۡنَ‏"
                    },
                    {
                        "num": 29,
                        "text": "قَالُوۡا سُبۡحٰنَ رَبِّنَاۤ اِنَّا كُنَّا ظٰلِمِيۡنَ‏"
                    },
                    {
                        "num": 30,
                        "text": "فَاَقۡبَلَ بَعۡضُهُمۡ عَلٰى بَعۡضٍ يَّتَلَاوَمُوۡنَ‏"
                    },
                    {
                        "num": 31,
                        "text": "قَالُوۡا يٰوَيۡلَنَاۤ اِنَّا كُنَّا طٰغِيۡنَ‏"
                    },
                    {
                        "num": 32,
                        "text": "عَسٰى رَبُّنَاۤ اَنۡ يُّبۡدِلَـنَا خَيۡرًا مِّنۡهَاۤ اِنَّاۤ اِلٰى رَبِّنَا رٰغِبُوۡنَ‏"
                    },
                    {
                        "num": 33,
                        "text": "كَذٰلِكَ الۡعَذَابُ​ؕ وَلَعَذَابُ الۡاٰخِرَةِ اَكۡبَرُ ​ۘ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 34,
                        "text": "اِنَّ لِلۡمُتَّقِيۡنَ عِنۡدَ رَبِّهِمۡ جَنّٰتِ النَّعِيۡمِ‏"
                    },
                    {
                        "num": 35,
                        "text": "اَفَنَجۡعَلُ الۡمُسۡلِمِيۡنَ كَالۡمُجۡرِمِيۡنَؕ‏"
                    },
                    {
                        "num": 36,
                        "text": "مَا لَـكُمۡ كَيۡفَ تَحۡكُمُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 37,
                        "text": "اَمۡ لَـكُمۡ كِتٰبٌ فِيۡهِ تَدۡرُسُوۡنَۙ‏"
                    },
                    {
                        "num": 38,
                        "text": "اِنَّ لَـكُمۡ فِيۡهِ لَمَا تَخَيَّرُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 39,
                        "text": "اَمۡ لَـكُمۡ اَيۡمَانٌ عَلَيۡنَا بَالِغَةٌ اِلٰى يَوۡمِ الۡقِيٰمَةِ​ ۙ اِنَّ لَـكُمۡ لَمَا تَحۡكُمُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 40,
                        "text": "سَلۡهُمۡ اَيُّهُمۡ بِذٰلِكَ زَعِيۡمٌ ۛۚ‏"
                    },
                    {
                        "num": 41,
                        "text": "اَمۡ لَهُمۡ شُرَكَآءُ ۛۚ فَلۡيَاۡتُوۡا بِشُرَكَآٮِٕهِمۡ اِنۡ كَانُوۡا صٰدِقِيۡنَ‏ ﻿﻿"
                    },
                    {
                        "num": 42,
                        "text": "يَوۡمَ يُكۡشَفُ عَنۡ سَاقٍ وَّيُدۡعَوۡنَ اِلَى السُّجُوۡدِ فَلَا يَسۡتَطِيۡعُوۡنَۙ‏ ﻿﻿"
                    },
                    {
                        "num": 43,
                        "text": "خَاشِعَةً اَبۡصَارُهُمۡ تَرۡهَقُهُمۡ ذِلَّةٌ ؕ وَقَدۡ كَانُوۡا يُدۡعَوۡنَ اِلَى السُّجُوۡدِ وَهُمۡ سٰلِمُوۡنَ‏"
                    },
                    {
                        "num": 44,
                        "text": "فَذَرۡنِىۡ وَمَنۡ يُّكَذِّبُ بِهٰذَا الۡحَـدِيۡثِ​ؕ سَنَسۡتَدۡرِجُهُمۡ مِّنۡ حَيۡثُ لَا يَعۡلَمُوۡنَۙ‏"
                    },
                    {
                        "num": 45,
                        "text": "وَاُمۡلِىۡ لَهُمۡ​ؕ اِنَّ كَيۡدِىۡ مَتِيۡنٌ‏"
                    },
                    {
                        "num": 46,
                        "text": "اَمۡ تَسۡـَٔـلُهُمۡ اَجۡرًا فَهُمۡ مِّنۡ مَّغۡرَمٍ مُّثۡقَلُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 47,
                        "text": "اَمۡ عِنۡدَهُمُ الۡغَيۡبُ فَهُمۡ يَكۡتُبُوۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "فَاصۡبِرۡ لِحُكۡمِ رَبِّكَ وَلَا تَكُنۡ كَصَاحِبِ الۡحُوۡتِ​ۘ اِذۡ نَادٰى وَهُوَ مَكۡظُوۡمٌؕ‏"
                    },
                    {
                        "num": 49,
                        "text": "لَوۡلَاۤ اَنۡ تَدٰرَكَهٗ نِعۡمَةٌ مِّنۡ رَّبِّهٖ لَنُبِذَ بِالۡعَرَآءِ وَهُوَ مَذۡمُوۡمٌ‏"
                    },
                    {
                        "num": 50,
                        "text": "فَاجۡتَبٰهُ رَبُّهٗ فَجَعَلَهٗ مِنَ الصّٰلِحِيۡنَ‏"
                    },
                    {
                        "num": 51,
                        "text": "وَاِنۡ يَّكَادُ الَّذِيۡنَ كَفَرُوۡا لَيُزۡلِقُوۡنَكَ بِاَبۡصَارِهِمۡ لَمَّا سَمِعُوا الذِّكۡرَ وَيَقُوۡلُوۡنَ اِنَّهٗ لَمَجۡنُوۡنٌ​ۘ‏"
                    },
                    {
                        "num": 52,
                        "text": "وَمَا هُوَ اِلَّا ذِكۡرٌ لِّلۡعٰلَمِيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Haqqah",
                "number": 69,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلۡحَـآقَّةُ ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَا الۡحَـآقَّةُ​ ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا الۡحَــآقَّةُ ؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "كَذَّبَتۡ ثَمُوۡدُ وَعَادٌۢ بِالۡقَارِعَةِ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَاَمَّا ثَمُوۡدُ فَاُهۡلِكُوۡا بِالطَّاغِيَةِ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَاَمَّا عَادٌ فَاُهۡلِكُوۡا بِرِيۡحٍ صَرۡصَرٍ عَاتِيَةٍۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "سَخَّرَهَا عَلَيۡهِمۡ سَبۡعَ لَيَالٍ وَّثَمٰنِيَةَ اَيَّامٍۙ حُسُوۡمًا ۙ فَتَرَى الۡقَوۡمَ فِيۡهَا صَرۡعٰىۙ كَاَنَّهُمۡ اَعۡجَازُ نَخۡلٍ خَاوِيَةٍ​ ۚ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَهَلۡ تَرٰى لَهُمۡ مِّنۡۢ بَاقِيَةٍ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَجَآءَ فِرۡعَوۡنُ وَمَنۡ قَبۡلَهٗ وَالۡمُؤۡتَفِكٰتُ بِالۡخَـاطِئَةِ​ۚ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَعَصَوۡا رَسُوۡلَ رَبِّهِمۡ فَاَخَذَهُمۡ اَخۡذَةً رَّابِيَةً‏"
                    },
                    {
                        "num": 11,
                        "text": "اِنَّا لَمَّا طَغَا الۡمَآءُ حَمَلۡنٰكُمۡ فِى الۡجَارِيَةِ ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "لِنَجۡعَلَهَا لَـكُمۡ تَذۡكِرَةً وَّتَعِيَهَاۤ اُذُنٌ وَّاعِيَةٌ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَاِذَا نُفِخَ فِى الصُّوۡرِ نَفۡخَةٌ وَّاحِدَةٌ ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَحُمِلَتِ الۡاَرۡضُ وَ الۡجِبَالُ فَدُكَّتَا دَكَّةً وَّاحِدَةً ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "فَيَوۡمَٮِٕذٍ وَّقَعَتِ الۡوَاقِعَةُ ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَانْشَقَّتِ السَّمَآءُ فَهِىَ يَوۡمَٮِٕذٍ وَّاهِيَةٌ ۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَّالۡمَلَكُ عَلٰٓى اَرۡجَآٮِٕهَا ​ؕ وَيَحۡمِلُ عَرۡشَ رَبِّكَ فَوۡقَهُمۡ يَوۡمَٮِٕذٍ ثَمٰنِيَةٌ ؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "يَوۡمَٮِٕذٍ تُعۡرَضُوۡنَ لَا تَخۡفٰى مِنۡكُمۡ خَافِيَةٌ‏"
                    },
                    {
                        "num": 19,
                        "text": "فَاَمَّا مَنۡ اُوۡتِىَ كِتٰبَهٗ بِيَمِيۡنِهٖۙ فَيَقُوۡلُ هَآؤُمُ اقۡرَءُوۡا كِتٰبِيَهۡ​ۚ‏"
                    },
                    {
                        "num": 20,
                        "text": "اِنِّىۡ ظَنَنۡتُ اَنِّىۡ مُلٰقٍ حِسَابِيَهۡ​ۚ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَهُوَ فِىۡ عِيۡشَةٍ رَّاضِيَةٍۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "فِىۡ جَنَّةٍ عَالِيَةٍۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "قُطُوۡفُهَا دَانِيَةٌ‏"
                    },
                    {
                        "num": 24,
                        "text": "كُلُوۡا وَاشۡرَبُوۡا هَنِيۡٓـــًٔا ۢ بِمَاۤ اَسۡلَفۡتُمۡ فِى الۡاَيَّامِ الۡخَـالِيَةِ‏ ﻿﻿"
                    },
                    {
                        "num": 25,
                        "text": "وَاَمَّا مَنۡ اُوۡتِىَ كِتٰبَهٗ بِشِمَالِهٖ  ۙ فَيَقُوۡلُ يٰلَيۡتَنِىۡ لَمۡ اُوۡتَ كِتٰبِيَهۡ​ۚ‏"
                    },
                    {
                        "num": 26,
                        "text": "وَلَمۡ اَدۡرِ مَا حِسَابِيَهۡ​ۚ‏"
                    },
                    {
                        "num": 27,
                        "text": "يٰلَيۡتَهَا كَانَتِ الۡقَاضِيَةَ​ ۚ‏"
                    },
                    {
                        "num": 28,
                        "text": "مَاۤ اَغۡنٰى عَنِّىۡ مَالِيَهۡۚ‏"
                    },
                    {
                        "num": 29,
                        "text": "هَلَكَ عَنِّىۡ سُلۡطٰنِيَهۡ​ۚ‏"
                    },
                    {
                        "num": 30,
                        "text": "خُذُوۡهُ فَغُلُّوۡهُ ۙ‏"
                    },
                    {
                        "num": 31,
                        "text": "ثُمَّ الۡجَحِيۡمَ صَلُّوۡهُ ۙ‏"
                    },
                    {
                        "num": 32,
                        "text": "ثُمَّ فِىۡ سِلۡسِلَةٍ ذَرۡعُهَا سَبۡعُوۡنَ ذِرَاعًا فَاسۡلُكُوۡهُ ؕ‏"
                    },
                    {
                        "num": 33,
                        "text": "اِنَّهٗ كَانَ لَا يُؤۡمِنُ بِاللّٰهِ الۡعَظِيۡمِۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَلَا يَحُضُّ عَلٰى طَعَامِ الۡمِسۡكِيۡنِؕ‏"
                    },
                    {
                        "num": 35,
                        "text": "فَلَيۡسَ لَـهُ الۡيَوۡمَ هٰهُنَا حَمِيۡمٌۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "وَّلَا طَعَامٌ اِلَّا مِنۡ غِسۡلِيۡنٍۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "لَّا يَاۡكُلُهٗۤ اِلَّا الۡخٰطِئُوْنَ‏"
                    },
                    {
                        "num": 38,
                        "text": "فَلَاۤ اُقۡسِمُ بِمَا تُبۡصِرُوۡنَۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "وَمَا لَا تُبۡصِرُوۡنَۙ‏"
                    },
                    {
                        "num": 40,
                        "text": "اِنَّهٗ لَقَوۡلُ رَسُوۡلٍ كَرِيۡمٍۚ ۙ‏"
                    },
                    {
                        "num": 41,
                        "text": "وَّمَا هُوَ بِقَوۡلِ شَاعِرٍ​ؕ قَلِيۡلًا مَّا تُؤۡمِنُوۡنَۙ‏"
                    },
                    {
                        "num": 42,
                        "text": "وَلَا بِقَوۡلِ كَاهِنٍ​ؕ قَلِيۡلًا مَّا تَذَكَّرُوۡنَؕ‏"
                    },
                    {
                        "num": 43,
                        "text": "تَنۡزِيۡلٌ مِّنۡ رَّبِّ الۡعٰلَمِيۡنَ‏"
                    },
                    {
                        "num": 44,
                        "text": "وَلَوۡ تَقَوَّلَ عَلَيۡنَا بَعۡضَ الۡاَقَاوِيۡلِۙ‏"
                    },
                    {
                        "num": 45,
                        "text": "لَاَخَذۡنَا مِنۡهُ بِالۡيَمِيۡنِۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "ثُمَّ لَقَطَعۡنَا مِنۡهُ الۡوَتِيۡنَ  ۖ‏"
                    },
                    {
                        "num": 47,
                        "text": "فَمَا مِنۡكُمۡ مِّنۡ اَحَدٍ عَنۡهُ حَاجِزِيۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَاِنَّهٗ لَتَذۡكِرَةٌ لِّلۡمُتَّقِيۡنَ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَاِنَّا لَنَعۡلَمُ اَنَّ مِنۡكُمۡ مُّكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 50,
                        "text": "وَاِنَّهٗ لَحَسۡرَةٌ عَلَى الۡكٰفِرِيۡنَ‏"
                    },
                    {
                        "num": 51,
                        "text": " وَاِنَّهٗ لَحَـقُّ الۡيَقِيۡنِ‏"
                    },
                    {
                        "num": 52,
                        "text": "فَسَبِّحۡ بِاسۡمِ رَبِّكَ الۡعَظِيۡمِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Ma'arij",
                "number": 70,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "سَاَلَ سَآٮِٕلٌ ۢ بِعَذَابٍ وَّاقِعٍۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "لِّلۡكٰفِرِيۡنَ لَيۡسَ لَهٗ دَافِعٌ ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "مِّنَ اللّٰهِ ذِى الۡمَعَارِجِؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "تَعۡرُجُ الۡمَلٰٓٮِٕكَةُ وَ الرُّوۡحُ اِلَيۡهِ فِىۡ يَوۡمٍ كَانَ مِقۡدَارُهٗ خَمۡسِيۡنَ اَلۡفَ سَنَةٍ​ۚ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَاصۡبِرۡ صَبۡرًا جَمِيۡلًا‏"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّهُمۡ يَرَوۡنَهٗ بَعِيۡدًا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَّنَرٰٮهُ قَرِيۡبًا ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "يَوۡمَ تَكُوۡنُ السَّمَآءُ كَالۡمُهۡلِۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَتَكُوۡنُ الۡجِبَالُ كَالۡعِهۡنِۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَلَا يَسۡـَٔـلُ حَمِيۡمٌ حَمِيۡمًا ۖۚ‏"
                    },
                    {
                        "num": 11,
                        "text": "يُّبَصَّرُوۡنَهُمۡ​ؕ يَوَدُّ الۡمُجۡرِمُ لَوۡ يَفۡتَدِىۡ مِنۡ عَذَابِ يَوۡمِٮِٕذٍۢ بِبَنِيۡهِۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَ صَاحِبَتِهٖ وَاَخِيۡهِۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَفَصِيۡلَتِهِ الَّتِىۡ تُــْٔوِيۡهِۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَمَنۡ فِى الۡاَرۡضِ جَمِيۡعًا ۙ ثُمَّ يُنۡجِيۡهِۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "كَلَّا ؕ اِنَّهَا لَظٰىۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "نَزَّاعَةً لِّلشَّوٰى​ ۖ​ۚ‏"
                    },
                    {
                        "num": 17,
                        "text": "تَدۡعُوۡا مَنۡ اَدۡبَرَ وَتَوَلّٰىۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَجَمَعَ فَاَوۡعٰى‏"
                    },
                    {
                        "num": 19,
                        "text": "اِنَّ الۡاِنۡسَانَ خُلِقَ هَلُوۡعًا ۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "اِذَا مَسَّهُ الشَّرُّ جَزُوۡعًا ۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "وَاِذَا مَسَّهُ الۡخَيۡرُ مَنُوۡعًا ۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "اِلَّا الۡمُصَلِّيۡنَۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "الَّذِيۡنَ هُمۡ عَلٰى صَلَاتِهِمۡ دَآٮِٕمُوۡنَۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَالَّذِيۡنَ فِىۡۤ اَمۡوَالِهِمۡ حَقٌّ مَّعۡلُوۡمٌۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "لِّلسَّآٮِٕلِ وَالۡمَحۡرُوۡمِۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "وَالَّذِيۡنَ يُصَدِّقُوۡنَ بِيَوۡمِ الدِّيۡنِۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَالَّذِيۡنَ هُمۡ مِّنۡ عَذَابِ رَبِّهِمۡ مُّشۡفِقُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 28,
                        "text": "اِنَّ عَذَابَ رَبِّهِمۡ غَيۡرُ مَاۡمُوۡنٍ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَالَّذِيۡنَ هُمۡ لِفُرُوۡجِهِمۡ حٰفِظُوۡنَۙ‏"
                    },
                    {
                        "num": 30,
                        "text": "اِلَّا عَلٰٓى اَزۡوَاجِهِمۡ اَوۡ مَا مَلَـكَتۡ اَيۡمَانُهُمۡ فَاِنَّهُمۡ غَيۡرُ مَلُوۡمِيۡنَ​ۚ‏"
                    },
                    {
                        "num": 31,
                        "text": "فَمَنِ ابۡتَغٰى وَرَآءَ ذٰلِكَ فَاُولٰٓٮِٕكَ هُمُ الۡعٰدُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 32,
                        "text": "وَالَّذِيۡنَ هُمۡ لِاَمٰنٰتِهِمۡ وَعَهۡدِهِمۡ رٰعُوۡنَ ۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "وَالَّذِيۡنَ هُمۡ بِشَهٰدٰتِهِمۡ قَآٮِٕمُوۡنَ ۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَالَّذِيۡنَ هُمۡ عَلٰى صَلَاتِهِمۡ يُحَافِظُوۡنَؕ‏"
                    },
                    {
                        "num": 35,
                        "text": "اُولٰٓٮِٕكَ فِىۡ جَنّٰتٍ مُّكۡرَمُوۡنَؕ‏"
                    },
                    {
                        "num": 36,
                        "text": "فَمَالِ الَّذِيۡنَ كَفَرُوۡا قِبَلَكَ مُهۡطِعِيۡنَۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "عَنِ الۡيَمِيۡنِ وَعَنِ الشِّمَالِ عِزِيۡنَ‏"
                    },
                    {
                        "num": 38,
                        "text": "اَيَطۡمَعُ كُلُّ امۡرِىءٍ مِّنۡهُمۡ اَنۡ يُّدۡخَلَ جَنَّةَ نَعِيۡمٍۙ‏ ﻿﻿"
                    },
                    {
                        "num": 39,
                        "text": "كَلَّا ؕ اِنَّا خَلَقۡنٰهُمۡ مِّمَّا يَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 40,
                        "text": "فَلَاۤ اُقۡسِمُ بِرَبِّ الۡمَشٰرِقِ وَالۡمَغٰرِبِ اِنَّا لَقٰدِرُوۡنَۙ‏"
                    },
                    {
                        "num": 41,
                        "text": "عَلٰٓى اَنۡ نُّبَدِّلَ خَيۡرًا مِّنۡهُمۡۙ وَمَا نَحۡنُ بِمَسۡبُوۡقِيۡنَ‏"
                    },
                    {
                        "num": 42,
                        "text": "فَذَرۡهُمۡ يَخُوۡضُوۡا وَيَلۡعَبُوۡا حَتّٰى يُلٰقُوۡا يَوۡمَهُمُ الَّذِىۡ يُوۡعَدُوۡنَۙ‏"
                    },
                    {
                        "num": 43,
                        "text": "يَوۡمَ يَخۡرُجُوۡنَ مِنَ الۡاَجۡدَاثِ سِرَاعًا كَاَنَّهُمۡ اِلٰى نُصُبٍ يُّوۡفِضُوۡنَۙ‏ ﻿﻿"
                    },
                    {
                        "num": 44,
                        "text": "خَاشِعَةً اَبۡصَارُهُمۡ تَرۡهَقُهُمۡ ذِلَّةٌ ؕ ذٰلِكَ الۡيَوۡمُ الَّذِىۡ كَانُوۡا يُوۡعَدُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Nuh",
                "number": 71,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِنَّاۤ اَرۡسَلۡنَا نُوۡحًا اِلٰى قَوۡمِهٖۤ اَنۡ اَنۡذِرۡ قَوۡمَكَ مِنۡ قَبۡلِ اَنۡ يَّاۡتِيَهُمۡ عَذَابٌ اَلِيۡمٌ‏"
                    },
                    {
                        "num": 2,
                        "text": "قَالَ يٰقَوۡمِ اِنِّىۡ لَـكُمۡ نَذِيۡرٌ مُّبِيۡنٌۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "اَنِ اعۡبُدُوا اللّٰهَ وَاتَّقُوۡهُ وَاَطِيۡعُوۡنِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "يَغۡفِرۡ لَـكُمۡ مِّنۡ ذُنُوۡبِكُمۡ وَيُؤَخِّرۡكُمۡ اِلٰٓى اَجَلٍ مُّسَمًّى​ؕ اِنَّ اَجَلَ اللّٰهِ اِذَا جَآءَ لَا يُؤَخَّرُ​​ۘ لَوۡ كُنۡتُمۡ تَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 5,
                        "text": "قَالَ رَبِّ اِنِّىۡ دَعَوۡتُ قَوۡمِىۡ لَيۡلًا وَّنَهَارًا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "فَلَمۡ يَزِدۡهُمۡ دُعَآءِىۡۤ اِلَّا فِرَارًا‏"
                    },
                    {
                        "num": 7,
                        "text": "وَاِنِّىۡ كُلَّمَا دَعَوۡتُهُمۡ لِتَغۡفِرَ لَهُمۡ جَعَلُوۡۤا اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ وَاسۡتَغۡشَوۡا ثِيَابَهُمۡ وَاَصَرُّوۡا وَاسۡتَكۡبَرُوا اسۡتِكۡبَارًا​ ۚ‏"
                    },
                    {
                        "num": 8,
                        "text": "ثُمَّ اِنِّىۡ دَعَوۡتُهُمۡ جِهَارًا ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "ثُمَّ اِنِّىۡۤ اَعۡلَـنۡتُ لَهُمۡ وَاَسۡرَرۡتُ لَهُمۡ اِسۡرَارًا ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَقُلۡتُ اسۡتَغۡفِرُوۡا رَبَّكُمۡؕ اِنَّهٗ كَانَ غَفَّارًا ۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "يُّرۡسِلِ السَّمَآءَ عَلَيۡكُمۡ مِّدۡرَارًا ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّيُمۡدِدۡكُمۡ بِاَمۡوَالٍ وَّبَنِيۡنَ وَيَجۡعَلۡ لَّـكُمۡ جَنّٰتٍ وَّيَجۡعَلۡ لَّـكُمۡ اَنۡهٰرًا ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "مَا لَـكُمۡ لَا تَرۡجُوۡنَ لِلّٰهِ وَقَارًا​ ۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَقَدۡ خَلَقَكُمۡ اَطۡوَارًا‏"
                    },
                    {
                        "num": 15,
                        "text": "اَلَمۡ تَرَوۡا كَيۡفَ خَلَقَ اللّٰهُ سَبۡعَ سَمٰوٰتٍ طِبَاقًا ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَّجَعَلَ الۡقَمَرَ فِيۡهِنَّ نُوۡرًا ۙ وَّجَعَلَ الشَّمۡسَ سِرَاجًا‏"
                    },
                    {
                        "num": 17,
                        "text": "وَاللّٰهُ اَنۡۢبَتَكُمۡ مِّنَ الۡاَرۡضِ نَبَاتًا ۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "ثُمَّ يُعِيۡدُكُمۡ فِيۡهَا وَيُخۡرِجُكُمۡ اِخۡرَاجًا‏"
                    },
                    {
                        "num": 19,
                        "text": "وَاللّٰهُ جَعَلَ لَـكُمُ الۡاَرۡضَ بِسَاطًا ۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "لِّـتَسۡلُكُوۡا مِنۡهَا سُبُلًا فِجَاجًا‏"
                    },
                    {
                        "num": 21,
                        "text": "قَالَ نُوۡحٌ رَّبِّ اِنَّهُمۡ عَصَوۡنِىۡ وَاتَّبَعُوۡا مَنۡ لَّمۡ يَزِدۡهُ مَالُهٗ وَوَلَدُهٗۤ اِلَّا خَسَارًا​ ۚ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَمَكَرُوۡا مَكۡرًا كُبَّارًا​ ۚ‏"
                    },
                    {
                        "num": 23,
                        "text": "وَ قَالُوۡا لَا تَذَرُنَّ اٰلِهَتَكُمۡ وَلَا تَذَرُنَّ وَدًّا وَّلَا سُوَاعًا  ۙ وَّ لَا يَغُوۡثَ وَيَعُوۡقَ وَنَسۡرًا​ ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَقَدۡ اَضَلُّوۡا كَثِيۡرًا​ ​ ۚ وَلَا تَزِدِ الظّٰلِمِيۡنَ اِلَّا ضَلٰلًا‏ ﻿﻿"
                    },
                    {
                        "num": 25,
                        "text": "مِّمَّا خَطِٓيْئٰتِهِمۡ اُغۡرِقُوۡا فَاُدۡخِلُوۡا نَارًا  ۙ فَلَمۡ يَجِدُوۡا لَهُمۡ مِّنۡ دُوۡنِ اللّٰهِ اَنۡصَارًا‏"
                    },
                    {
                        "num": 26,
                        "text": "وَ قَالَ نُوۡحٌ رَّبِّ لَا تَذَرۡ عَلَى الۡاَرۡضِ مِنَ الۡكٰفِرِيۡنَ دَيَّارًا‏ ﻿﻿"
                    },
                    {
                        "num": 27,
                        "text": "اِنَّكَ اِنۡ تَذَرۡهُمۡ يُضِلُّوۡا عِبَادَكَ وَلَا يَلِدُوۡۤا اِلَّا فَاجِرًا كَفَّارًا‏"
                    },
                    {
                        "num": 28,
                        "text": "رَبِّ اغۡفِرۡلِىۡ وَلِـوَالِدَىَّ وَلِمَنۡ دَخَلَ بَيۡتِىَ مُؤۡمِنًا وَّلِلۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِؕ وَلَا تَزِدِ الظّٰلِمِيۡنَ اِلَّا تَبَارًا‏"
                    }
                ]
            },
            {
                "surah": "Al-Jinn",
                "number": 72,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قُلۡ اُوۡحِىَ اِلَىَّ اَنَّهُ اسۡتَمَعَ نَفَرٌ مِّنَ الۡجِنِّ فَقَالُوۡۤا اِنَّا سَمِعۡنَا قُرۡاٰنًاعَجَبًا ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "يَّهۡدِىۡۤ اِلَى الرُّشۡدِ فَاٰمَنَّا بِهٖ​ ؕ وَلَنۡ نُّشۡرِكَ بِرَبِّنَاۤ اَحَدًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّاَنَّهٗ تَعٰلٰى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَّلَا وَلَدًا ۙ‏ ﻿﻿"
                    },
                    {
                        "num": 4,
                        "text": "وَّ اَنَّهٗ كَانَ يَقُوۡلُ سَفِيۡهُنَا عَلَى اللّٰهِ شَطَطًا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَّاَنَّا ظَنَنَّاۤ اَنۡ لَّنۡ تَقُوۡلَ الۡاِنۡسُ وَالۡجِنُّ عَلَى اللّٰهِ كَذِبًا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَّاَنَّهٗ كَانَ رِجَالٌ مِّنَ الۡاِنۡسِ يَعُوۡذُوۡنَ بِرِجَالٍ مِّنَ الۡجِنِّ فَزَادُوۡهُمۡ رَهَقًا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَّاَنَّهُمۡ ظَنُّوۡا كَمَا ظَنَنۡتُمۡ اَنۡ لَّنۡ يَّبۡعَثَ اللّٰهُ اَحَدًا ۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَّاَنَّا لَمَسۡنَا السَّمَآءَ فَوَجَدۡنٰهَا مُلِئَتۡ حَرَسًا شَدِيۡدًا وَّشُهُبًا ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَّاَنَّا كُنَّا نَقۡعُدُ مِنۡهَا مَقَاعِدَ لِلسَّمۡعِ​ ؕ فَمَنۡ يَّسۡتَمِعِ الۡاٰنَ يَجِدۡ لَهٗ شِهَابًا رَّصَدًا ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَّاَنَّا لَا نَدۡرِىۡۤ اَشَرٌّ اُرِيۡدَ بِمَنۡ فِى الۡاَرۡضِ اَمۡ اَرَادَ بِهِمۡ رَبُّهُمۡ رَشَدًا ۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَّاَنَّا مِنَّا الصّٰلِحُوۡنَ وَمِنَّا دُوۡنَ ذٰلِكَ​ؕ كُنَّا طَرَآٮِٕقَ قِدَدًا ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّاَنَّا ظَنَنَّاۤ اَنۡ لَّنۡ نُّعۡجِزَ اللّٰهَ فِى الۡاَرۡضِ وَلَنۡ نُّعۡجِزَهٗ هَرَبًا ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَّاَنَّا لَمَّا سَمِعۡنَا الۡهُدٰٓى اٰمَنَّا بِهٖ​ ؕ فَمَنۡ يُّؤۡمِنۡۢ بِرَبِّهٖ فَلَا يَخَافُ بَخۡسًا وَّلَا رَهَقًا ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَّاَنَّا مِنَّا الۡمُسۡلِمُوۡنَ وَمِنَّا الۡقٰسِطُوۡنَ​ؕ فَمَنۡ اَسۡلَمَ فَاُولٰٓٮِٕكَ تَحَرَّوۡا رَشَدًا‏"
                    },
                    {
                        "num": 15,
                        "text": "وَاَمَّا الۡقٰسِطُوۡنَ فَكَانُوۡا لِجَهَنَّمَ حَطَبًا ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَّاَنْ لَّوِ اسۡتَقَامُوۡا عَلَى الطَّرِيۡقَةِ لَاَسۡقَيۡنٰهُمۡ مَّآءً غَدَقًا ۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "لِّنَفۡتِنَهُمۡ فِيۡهِ​ ؕ وَمَنۡ يُّعۡرِضۡ عَنۡ ذِكۡرِ رَبِّهٖ يَسۡلُكۡهُ عَذَابًا صَعَدًا ۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَّاَنَّ الۡمَسٰجِدَ لِلّٰهِ فَلَا تَدۡعُوۡا مَعَ اللّٰهِ اَحَدًا ۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَّاَنَّهٗ لَمَّا قَامَ عَبۡدُ اللّٰهِ يَدۡعُوۡهُ كَادُوۡا يَكُوۡنُوۡنَ عَلَيۡهِ لِبَدًا ؕ‏"
                    },
                    {
                        "num": 20,
                        "text": "قُلۡ اِنَّمَاۤ اَدۡعُوۡا رَبِّىۡ وَلَاۤ اُشۡرِكُ بِهٖۤ اَحَدًا‏"
                    },
                    {
                        "num": 21,
                        "text": "قُلۡ اِنِّىۡ لَاۤ اَمۡلِكُ لَـكُمۡ ضَرًّا وَّلَا رَشَدًا‏"
                    },
                    {
                        "num": 22,
                        "text": "قُلۡ اِنِّىۡ لَنۡ يُّجِيۡرَنِىۡ مِنَ اللّٰهِ اَحَدٌ  ۙ وَّلَنۡ اَجِدَ مِنۡ دُوۡنِهٖ مُلۡتَحَدًا ۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "اِلَّا بَلٰغًا مِّنَ اللّٰهِ وَرِسٰلٰتِهٖ​ ؕ وَمَنۡ يَّعۡصِ اللّٰهَ وَرَسُوۡلَهٗ فَاِنَّ لَهٗ نَارَ جَهَنَّمَ خٰلِدِيۡنَ فِيۡهَاۤ اَبَدًا ؕ‏"
                    },
                    {
                        "num": 24,
                        "text": "حَتّٰٓى اِذَا رَاَوۡا مَا يُوۡعَدُوۡنَ فَسَيَعۡلَمُوۡنَ مَنۡ اَضۡعَفُ نَاصِرًا وَّاَقَلُّ عَدَدًا‏"
                    },
                    {
                        "num": 25,
                        "text": "قُلۡ اِنۡ اَدۡرِىۡۤ اَقَرِيۡبٌ مَّا تُوۡعَدُوۡنَ اَمۡ يَجۡعَلُ لَهٗ رَبِّىۡۤ اَمَدًا‏"
                    },
                    {
                        "num": 26,
                        "text": "عٰلِمُ الۡغَيۡبِ فَلَا يُظۡهِرُ عَلٰى غَيۡبِهٖۤ اَحَدًا ۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "اِلَّا مَنِ ارۡتَضٰى مِنۡ رَّسُوۡلٍ فَاِنَّهٗ يَسۡلُكُ مِنۡۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهٖ رَصَدًا ۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "لِّيَـعۡلَمَ اَنۡ قَدۡ اَبۡلَغُوۡا رِسٰلٰتِ رَبِّهِمۡ وَاَحَاطَ بِمَا لَدَيۡهِمۡ وَاَحۡصٰى كُلَّ شَىۡءٍ عَدَدًا‏"
                    }
                ]
            },
            {
                "surah": "Al-Muzzammil",
                "number": 73,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤاَيُّهَا الۡمُزَّمِّلُۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "قُمِ الَّيۡلَ اِلَّا قَلِيۡلًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "نِّصۡفَهٗۤ اَوِ انْقُصۡ مِنۡهُ قَلِيۡلًا ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "اَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ الۡقُرۡاٰنَ تَرۡتِيۡلًا ؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "اِنَّا سَنُلۡقِىۡ عَلَيۡكَ قَوۡلًا ثَقِيۡلًا‏"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّ نَاشِئَةَ الَّيۡلِ هِىَ اَشَدُّ وَطۡـاً وَّاَقۡوَمُ قِيۡلًا ؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِنَّ لَـكَ فِى النَّهَارِ سَبۡحًا طَوِيۡلًا ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاذۡكُرِ اسۡمَ رَبِّكَ وَتَبَتَّلۡ اِلَيۡهِ تَبۡتِيۡلًا ؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "رَبُّ الۡمَشۡرِقِ وَالۡمَغۡرِبِ لَاۤ اِلٰهَ اِلَّا هُوَ فَاتَّخِذۡهُ وَكِيۡلًا‏ ﻿﻿"
                    },
                    {
                        "num": 10,
                        "text": "وَاصۡبِرۡ عَلٰى مَا يَقُوۡلُوۡنَ وَاهۡجُرۡهُمۡ هَجۡرًا جَمِيۡلًا‏"
                    },
                    {
                        "num": 11,
                        "text": "وَذَرۡنِىۡ وَالۡمُكَذِّبِيۡنَ اُولِى النَّعۡمَةِ وَمَهِّلۡهُمۡ قَلِيۡلًا‏ ﻿﻿"
                    },
                    {
                        "num": 12,
                        "text": "اِنَّ لَدَيۡنَاۤ اَنۡـكَالًا وَّجَحِيۡمًا ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَّطَعَامًا ذَا غُصَّةٍ وَّعَذَابًا اَلِيۡمًا‏"
                    },
                    {
                        "num": 14,
                        "text": "يَوۡمَ تَرۡجُفُ الۡاَرۡضُ وَالۡجِبَالُ وَكَانَتِ الۡجِبَالُ كَثِيۡبًا مَّهِيۡلًا‏ ﻿﻿"
                    },
                    {
                        "num": 15,
                        "text": "اِنَّاۤ اَرۡسَلۡنَاۤ اِلَيۡكُمۡ رَسُوۡلًا ۙ شَاهِدًا عَلَيۡكُمۡ كَمَاۤ اَرۡسَلۡنَاۤ اِلٰى فِرۡعَوۡنَ رَسُوۡلًا ؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَعَصٰى فِرۡعَوۡنُ الرَّسُوۡلَ فَاَخَذۡنٰهُ اَخۡذًا وَّبِيۡلًا‏"
                    },
                    {
                        "num": 17,
                        "text": "فَكَيۡفَ تَتَّقُوۡنَ اِنۡ كَفَرۡتُمۡ يَوۡمًا يَّجۡعَلُ الۡوِلۡدَانَ شِيۡبَا  ۖ‏"
                    },
                    {
                        "num": 18,
                        "text": "اۨلسَّمَآءُ مُنۡفَطِرٌ ۢ بِهٖ​ؕ كَانَ وَعۡدُهٗ مَفۡعُوۡلًا‏"
                    },
                    {
                        "num": 19,
                        "text": "اِنَّ هٰذِهٖ تَذۡكِرَةٌ ​ ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰى رَبِّهٖ سَبِيۡلًا‏ ﻿﻿"
                    },
                    {
                        "num": 20,
                        "text": "اِنَّ رَبَّكَ يَعۡلَمُ اَنَّكَ تَقُوۡمُ اَدۡنىٰ مِنۡ ثُلُثَىِ الَّيۡلِ وَ نِصۡفَهٗ وَثُلُثَهٗ وَطَآٮِٕفَةٌ مِّنَ الَّذِيۡنَ مَعَكَ​ؕ وَاللّٰهُ يُقَدِّرُ الَّيۡلَ وَالنَّهَارَ​ؕ عَلِمَ اَنۡ لَّنۡ تُحۡصُوۡهُ فَتَابَ عَلَيۡكُمۡ​ فَاقۡرَءُوۡا مَا تَيَسَّرَ مِنَ الۡقُرۡاٰنِ​ؕ عَلِمَ اَنۡ سَيَكُوۡنُ مِنۡكُمۡ مَّرۡضٰى​ۙ وَاٰخَرُوۡنَ يَضۡرِبُوۡنَ فِى الۡاَرۡضِ يَبۡتَغُوۡنَ مِنۡ فَضۡلِ اللّٰهِ​ۙ وَاٰخَرُوۡنَ يُقَاتِلُوۡنَ فِىۡ سَبِيۡلِ اللّٰهِ ۖ فَاقۡرَءُوۡا مَا تَيَسَّرَ مِنۡهُ​ ۙ وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَقۡرِضُوا اللّٰهَ قَرۡضًا حَسَنًا​ ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ هُوَ خَيۡرًا وَّاَعۡظَمَ اَجۡرًا​ ؕ وَاسۡتَغۡفِرُوا اللّٰهَ ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ‏"
                    }
                ]
            },
            {
                "surah": "Al-Muddatstsir",
                "number": 74,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "يٰۤاَيُّهَا الۡمُدَّثِّرُۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "قُمۡ فَاَنۡذِرۡۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَرَبَّكَ فَكَبِّرۡۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَثِيَابَكَ فَطَهِّرۡۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَالرُّجۡزَ فَاهۡجُرۡۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَلَا تَمۡنُنۡ تَسۡتَكۡثِرُۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَ لِرَبِّكَ فَاصۡبِرۡؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَاِذَا نُقِرَ فِى النَّاقُوۡرِۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "فَذٰلِكَ يَوۡمَٮِٕذٍ يَّوۡمٌ عَسِيۡرٌۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "عَلَى الۡكٰفِرِيۡنَ غَيۡرُ يَسِيۡرٍ‏"
                    },
                    {
                        "num": 11,
                        "text": "ذَرۡنِىۡ وَمَنۡ خَلَقۡتُ وَحِيۡدًا ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّجَعَلۡتُ لَهٗ مَالًا مَّمۡدُوۡدًا ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَّبَنِيۡنَ شُهُوۡدًا ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَّمَهَّدتُّ لَهٗ تَمۡهِيۡدًا ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "ثُمَّ يَطۡمَعُ اَنۡ اَزِيۡدَ  ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "كَلَّا ؕ اِنَّهٗ كَانَ لِاٰيٰتِنَا عَنِيۡدًا ؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "سَاُرۡهِقُهٗ صَعُوۡدًا ؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "اِنَّهٗ فَكَّرَ وَقَدَّرَۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "فَقُتِلَ كَيۡفَ قَدَّرَۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "ثُمَّ قُتِلَ كَيۡفَ قَدَّرَۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "ثُمَّ نَظَرَۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "ثُمَّ عَبَسَ وَبَسَرَۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "ثُمَّ اَدۡبَرَ وَاسۡتَكۡبَرَۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَقَالَ اِنۡ هٰذَاۤ اِلَّا سِحۡرٌ يُّؤۡثَرُۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "اِنۡ هٰذَاۤ اِلَّا قَوۡلُ الۡبَشَرِؕ‏"
                    },
                    {
                        "num": 26,
                        "text": "سَاُصۡلِيۡهِ سَقَرَ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا سَقَرُؕ‏"
                    },
                    {
                        "num": 28,
                        "text": "لَا تُبۡقِىۡ وَ لَا تَذَرُ​ۚ‏"
                    },
                    {
                        "num": 29,
                        "text": "لَـوَّاحَةٌ لِّلۡبَشَرِ​ۖ​ۚ‏"
                    },
                    {
                        "num": 30,
                        "text": "عَلَيۡهَا تِسۡعَةَ عَشَرَؕ‏"
                    },
                    {
                        "num": 31,
                        "text": "وَمَا جَعَلۡنَاۤ اَصۡحٰبَ النَّارِ اِلَّا مَلٰٓٮِٕكَةً​ وَّمَا جَعَلۡنَا عِدَّتَهُمۡ اِلَّا فِتۡنَةً لِّلَّذِيۡنَ كَفَرُوۡا ۙ لِيَسۡتَيۡقِنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ وَيَزۡدَادَ الَّذِيۡنَ اٰمَنُوۡۤا اِيۡمَانًا​ وَّلَا يَرۡتَابَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ وَالۡمُؤۡمِنُوۡنَ​ۙ وَلِيَقُوۡلَ الَّذِيۡنَ فِىۡ قُلُوۡبِهِمۡ مَّرَضٌ وَّالۡكٰفِرُوۡنَ مَاذَاۤ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ​ؕ كَذٰلِكَ يُضِلُّ اللّٰهُ مَنۡ يَّشَآءُ وَيَهۡدِىۡ مَنۡ يَّشَآءُ ​ؕ وَمَا يَعۡلَمُ جُنُوۡدَ رَبِّكَ اِلَّا هُوَ ​ؕ وَمَا هِىَ اِلَّا ذِكۡرٰى لِلۡبَشَرِ‏"
                    },
                    {
                        "num": 32,
                        "text": "كَلَّا وَالۡقَمَرِۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "وَالَّيۡلِ اِذۡ اَدۡبَرَۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَالصُّبۡحِ اِذَاۤ اَسۡفَرَۙ‏"
                    },
                    {
                        "num": 35,
                        "text": "اِنَّهَا لَاِحۡدَى الۡكُبَرِۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "نَذِيۡرًا لِّلۡبَشَرِۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "لِمَنۡ شَآءَ مِنۡكُمۡ اَنۡ يَّتَقَدَّمَ اَوۡ يَتَاَخَّرَؕ‏"
                    },
                    {
                        "num": 38,
                        "text": "كُلُّ نَفۡسٍ ۢ بِمَا كَسَبَتۡ رَهِيۡنَةٌ ۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "اِلَّاۤ اَصۡحٰبَ الۡيَمِيۡنِۛ ؕ‏"
                    },
                    {
                        "num": 40,
                        "text": "فِىۡ جَنّٰتٍ ۛ يَتَسَآءَلُوۡنَۙ‏"
                    },
                    {
                        "num": 41,
                        "text": "عَنِ الۡمُجۡرِمِيۡنَۙ‏"
                    },
                    {
                        "num": 42,
                        "text": "مَا سَلَـكَكُمۡ فِىۡ سَقَرَ‏"
                    },
                    {
                        "num": 43,
                        "text": "قَالُوۡا لَمۡ نَكُ مِنَ الۡمُصَلِّيۡنَۙ‏"
                    },
                    {
                        "num": 44,
                        "text": "وَلَمۡ نَكُ نُطۡعِمُ الۡمِسۡكِيۡنَۙ‏"
                    },
                    {
                        "num": 45,
                        "text": "وَكُنَّا نَخُوۡضُ مَعَ الۡخَـآٮِٕضِيۡنَۙ‏"
                    },
                    {
                        "num": 46,
                        "text": "وَ كُنَّا نُكَذِّبُ بِيَوۡمِ الدِّيۡنِۙ‏"
                    },
                    {
                        "num": 47,
                        "text": "حَتّٰٓى اَتٰٮنَا الۡيَقِيۡنُؕ‏"
                    },
                    {
                        "num": 48,
                        "text": "فَمَا تَنۡفَعُهُمۡ شَفَاعَةُ الشّٰفِعِيۡنَؕ‏"
                    },
                    {
                        "num": 49,
                        "text": "فَمَا لَهُمۡ عَنِ التَّذۡكِرَةِ مُعۡرِضِيۡنَۙ‏"
                    },
                    {
                        "num": 50,
                        "text": "كَاَنَّهُمۡ حُمُرٌ مُّسۡتَنۡفِرَةٌ ۙ‏"
                    },
                    {
                        "num": 51,
                        "text": "فَرَّتۡ مِنۡ قَسۡوَرَةٍ ؕ‏"
                    },
                    {
                        "num": 52,
                        "text": "بَلۡ يُرِيۡدُ كُلُّ امۡرِىٴٍ مِّنۡهُمۡ اَنۡ يُّؤۡتٰى صُحُفًا مُّنَشَّرَةً ۙ‏ ﻿﻿"
                    },
                    {
                        "num": 53,
                        "text": "كَلَّا ​ؕ بَلۡ لَّا يَخَافُوۡنَ الۡاٰخِرَةَ ؕ‏"
                    },
                    {
                        "num": 54,
                        "text": "كَلَّاۤ اِنَّهٗ تَذۡكِرَةٌ​ ۚ‏"
                    },
                    {
                        "num": 55,
                        "text": "فَمَنۡ شَآءَ ذَكَرَهٗ ؕ‏"
                    },
                    {
                        "num": 56,
                        "text": "وَمَا يَذۡكُرُوۡنَ اِلَّاۤ اَنۡ يَّشَآءَ اللّٰهُ​ ؕ هُوَ اَهۡلُ التَّقۡوٰى وَاَهۡلُ الۡمَغۡفِرَةِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Qiyamah",
                "number": 75,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "لَاۤ اُقۡسِمُ بِيَوۡمِ الۡقِيٰمَةِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَلَاۤ اُقۡسِمُ بِالنَّفۡسِ اللَّوَّامَةِؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "اَيَحۡسَبُ الۡاِنۡسَانُ اَلَّنۡ نَّجۡمَعَ عِظَامَهٗؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "بَلٰى قٰدِرِيۡنَ عَلٰٓى اَنۡ نُّسَوِّىَ بَنَانَهٗ‏"
                    },
                    {
                        "num": 5,
                        "text": "بَلۡ يُرِيۡدُ الۡاِنۡسَانُ لِيَفۡجُرَ اَمَامَهٗ​ۚ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَسۡـَٔـلُ اَيَّانَ يَوۡمُ الۡقِيٰمَةِؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "فَاِذَا بَرِقَ الۡبَصَرُۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَخَسَفَ الۡقَمَرُۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَجُمِعَ الشَّمۡسُ وَالۡقَمَرُۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "يَقُوۡلُ الۡاِنۡسَانُ يَوۡمَٮِٕذٍ اَيۡنَ الۡمَفَرُّ​ ۚ‏"
                    },
                    {
                        "num": 11,
                        "text": "كَلَّا لَا وَزَرَؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "اِلٰى رَبِّكَ يَوۡمَٮِٕذِ اۨلۡمُسۡتَقَرُّ ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "يُنَبَّؤُا الۡاِنۡسَانُ يَوۡمَٮِٕذٍۢ بِمَا قَدَّمَ وَاَخَّرَؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "بَلِ الۡاِنۡسَانُ عَلٰى نَفۡسِهٖ بَصِيۡرَةٌ ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَّلَوۡ اَلۡقٰى مَعَاذِيۡرَهٗؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "لَا تُحَرِّكۡ بِهٖ لِسَانَكَ لِتَعۡجَلَ بِهٖؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِنَّ عَلَيۡنَا جَمۡعَهٗ وَقُرۡاٰنَهٗۚ  ۖ‏"
                    },
                    {
                        "num": 18,
                        "text": "فَاِذَا قَرَاۡنٰهُ فَاتَّبِعۡ قُرۡاٰنَهٗ​ۚ‏"
                    },
                    {
                        "num": 19,
                        "text": "ثُمَّ اِنَّ عَلَيۡنَا بَيَانَهٗؕ‏"
                    },
                    {
                        "num": 20,
                        "text": "كَلَّا بَلۡ تُحِبُّوۡنَ الۡعَاجِلَةَ ۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "وَتَذَرُوۡنَ الۡاٰخِرَةَ ؕ‏"
                    },
                    {
                        "num": 22,
                        "text": "وُجُوۡهٌ يَّوۡمَٮِٕذٍ نَّاضِرَةٌ ۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "اِلٰى رَبِّهَا نَاظِرَةٌ​ ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَوُجُوۡهٌ يَّوۡمَٮِٕذٍۢ بَاسِرَةٌ ۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "تَظُنُّ اَنۡ يُّفۡعَلَ بِهَا فَاقِرَةٌ ؕ‏"
                    },
                    {
                        "num": 26,
                        "text": "كَلَّاۤ اِذَا بَلَغَتِ التَّرَاقِىَۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَقِيۡلَ مَنۡ رَاقٍۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "وَّظَنَّ اَنَّهُ الۡفِرَاقُۙ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَالۡتَفَّتِ السَّاقُ بِالسَّاقِۙ‏"
                    },
                    {
                        "num": 30,
                        "text": "اِلٰى رَبِّكَ يَوۡمَٮِٕذِ اۨلۡمَسَاقُؕ‏"
                    },
                    {
                        "num": 31,
                        "text": "فَلَا صَدَّقَ وَلَا صَلّٰىۙ‏"
                    },
                    {
                        "num": 32,
                        "text": "وَلٰڪِنۡ كَذَّبَ وَتَوَلّٰىۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "ثُمَّ ذَهَبَ اِلٰٓى اَهۡلِهٖ يَتَمَطّٰىؕ‏"
                    },
                    {
                        "num": 34,
                        "text": "اَوۡلٰى لَكَ فَاَوۡلٰىۙ‏"
                    },
                    {
                        "num": 35,
                        "text": "ثُمَّ اَوۡلٰى لَكَ فَاَوۡلٰىؕ‏"
                    },
                    {
                        "num": 36,
                        "text": "اَيَحۡسَبُ الۡاِنۡسَانُ اَنۡ يُّتۡرَكَ سُدًىؕ‏"
                    },
                    {
                        "num": 37,
                        "text": "اَلَمۡ يَكُ نُطۡفَةً مِّنۡ مَّنِىٍّ يُّمۡنٰىۙ‏"
                    },
                    {
                        "num": 38,
                        "text": "ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوّٰىۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَجَعَلَ مِنۡهُ الزَّوۡجَيۡنِ الذَّكَرَ وَالۡاُنۡثٰىؕ‏"
                    },
                    {
                        "num": 40,
                        "text": "اَلَيۡسَ ذٰلِكَ بِقٰدِرٍ عَلٰٓى اَنۡ يُّحۡـىِۦَ الۡمَوۡتٰى‏"
                    }
                ]
            },
            {
                "surah": "Al-Insan",
                "number": 76,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "هَلۡ اَتٰى عَلَى الۡاِنۡسَانِ حِيۡنٌ مِّنَ الدَّهۡرِ لَمۡ يَكُنۡ شَيۡـًٔـا مَّذۡكُوۡرًا‏"
                    },
                    {
                        "num": 2,
                        "text": "اِنَّا خَلَقۡنَا الۡاِنۡسَانَ مِنۡ نُّطۡفَةٍ اَمۡشَاجٍۖ نَّبۡتَلِيۡهِ فَجَعَلۡنٰهُ سَمِيۡعًۢا بَصِيۡرًا‏"
                    },
                    {
                        "num": 3,
                        "text": "اِنَّا هَدَيۡنٰهُ السَّبِيۡلَ اِمَّا شَاكِرًا وَّاِمَّا كَفُوۡرًا‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنَّاۤ اَعۡتَدۡنَا لِلۡكٰفِرِيۡنَ سَلٰسِلَا۟ وَاَغۡلٰلًا وَّسَعِيۡرًا‏"
                    },
                    {
                        "num": 5,
                        "text": "اِنَّ الۡاَبۡرَارَ يَشۡرَبُوۡنَ مِنۡ كَاۡسٍ كَانَ مِزَاجُهَا كَافُوۡرًا​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 6,
                        "text": "عَيۡنًا يَّشۡرَبُ بِهَا عِبَادُ اللّٰهِ يُفَجِّرُوۡنَهَا تَفۡجِيۡرًا‏"
                    },
                    {
                        "num": 7,
                        "text": "يُوۡفُوۡنَ بِالنَّذۡرِ وَيَخَافُوۡنَ يَوۡمًا كَانَ شَرُّهٗ مُسۡتَطِيۡرًا‏ ﻿﻿"
                    },
                    {
                        "num": 8,
                        "text": "وَيُطۡعِمُوۡنَ الطَّعَامَ عَلٰى حُبِّهٖ مِسۡكِيۡنًا وَّيَتِيۡمًا وَّاَسِيۡرًا‏ ﻿﻿"
                    },
                    {
                        "num": 9,
                        "text": "اِنَّمَا نُطۡعِمُكُمۡ لِـوَجۡهِ اللّٰهِ لَا نُرِيۡدُ مِنۡكُمۡ جَزَآءً وَّلَا شُكُوۡرًا‏"
                    },
                    {
                        "num": 10,
                        "text": "اِنَّا نَخَافُ مِنۡ رَّبِّنَا يَوۡمًا عَبُوۡسًا قَمۡطَرِيۡرًا‏"
                    },
                    {
                        "num": 11,
                        "text": "فَوَقٰٮهُمُ اللّٰهُ شَرَّ ذٰلِكَ الۡيَوۡمِ وَ لَقّٰٮهُمۡ نَضۡرَةً وَّسُرُوۡرًا​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 12,
                        "text": "وَجَزٰٮهُمۡ بِمَا صَبَرُوۡا جَنَّةً وَّحَرِيۡرًا ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "مُّتَّكِـِٕـيۡنَ فِيۡهَا عَلَى الۡاَرَآٮِٕكِ​ۚ لَا يَرَوۡنَ فِيۡهَا شَمۡسًا وَّلَا زَمۡهَرِيۡرًا​ۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَدَانِيَةً عَلَيۡهِمۡ ظِلٰلُهَا وَذُلِّلَتۡ قُطُوۡفُهَا تَذۡلِيۡلًا‏"
                    },
                    {
                        "num": 15,
                        "text": "وَيُطَافُ عَلَيۡهِمۡ بِاٰنِيَةٍ مِّنۡ فِضَّةٍ وَّاَكۡوَابٍ كَانَتۡ قَوَارِيۡرَا۟ ۙ‏ ﻿﻿"
                    },
                    {
                        "num": 16,
                        "text": "قَوَارِيۡرَا۟ مِنۡ فِضَّةٍ قَدَّرُوۡهَا تَقۡدِيۡرًا‏"
                    },
                    {
                        "num": 17,
                        "text": "​ ​ وَيُسۡقَوۡنَ فِيۡهَا كَاۡسًا كَانَ مِزَاجُهَا زَنۡجَبِيۡلًا ۚ‏"
                    },
                    {
                        "num": 18,
                        "text": "عَيۡنًا فِيۡهَا تُسَمّٰى سَلۡسَبِيۡلًا‏"
                    },
                    {
                        "num": 19,
                        "text": "وَيَطُوۡفُ عَلَيۡهِمۡ وِلۡدَانٌ مُّخَلَّدُوۡنَ​ۚ اِذَا رَاَيۡتَهُمۡ حَسِبۡتَهُمۡ لُـؤۡلُـؤًا مَّنۡثُوۡرًا‏"
                    },
                    {
                        "num": 20,
                        "text": "وَاِذَا رَاَيۡتَ ثَمَّ رَاَيۡتَ نَعِيۡمًا وَّمُلۡكًا كَبِيۡرًا‏"
                    },
                    {
                        "num": 21,
                        "text": "عٰلِيَهُمۡ ثِيَابُ سُنۡدُسٍ خُضۡرٌ وَّاِسۡتَبۡرَقٌ​ وَّحُلُّوۡۤا اَسَاوِرَ مِنۡ فِضَّةٍ ​ۚوَسَقٰٮهُمۡ رَبُّهُمۡ شَرَابًا طَهُوۡرًا‏"
                    },
                    {
                        "num": 22,
                        "text": "اِنَّ هٰذَا كَانَ لَـكُمۡ جَزَآءً وَّكَانَ سَعۡيُكُمۡ مَّشۡكُوۡرًا‏"
                    },
                    {
                        "num": 23,
                        "text": "اِنَّا نَحۡنُ نَزَّلۡنَا عَلَيۡكَ الۡقُرۡاٰنَ تَنۡزِيۡلًا ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَاصۡبِرۡ لِحُكۡمِ رَبِّكَ وَلَا تُطِعۡ مِنۡهُمۡ اٰثِمًا اَوۡ كَفُوۡرًا​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 25,
                        "text": "وَاذۡكُرِ اسۡمَ رَبِّكَ بُكۡرَةً وَّاَصِيۡلًا ۚ  ۖ‏"
                    },
                    {
                        "num": 26,
                        "text": "وَمِنَ الَّيۡلِ فَاسۡجُدۡ لَهٗ وَسَبِّحۡهُ لَيۡلًا طَوِيۡلًا‏"
                    },
                    {
                        "num": 27,
                        "text": "اِنَّ هٰٓؤُلَاۤءِ يُحِبُّوۡنَ الۡعَاجِلَةَ وَيَذَرُوۡنَ وَرَآءَهُمۡ يَوۡمًا ثَقِيۡلًا‏"
                    },
                    {
                        "num": 28,
                        "text": "نَحۡنُ خَلَقۡنٰهُمۡ وَشَدَدۡنَاۤ اَسۡرَهُمۡ​ۚ وَاِذَا شِئۡنَا بَدَّلۡنَاۤ اَمۡثَالَهُمۡ تَبۡدِيۡلًا‏"
                    },
                    {
                        "num": 29,
                        "text": "اِنَّ هٰذِهٖ تَذۡكِرَةٌ ​ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰى رَبِّهٖ سَبِيۡلًا‏ ﻿﻿"
                    },
                    {
                        "num": 30,
                        "text": "وَمَا تَشَآءُوۡنَ اِلَّاۤ اَنۡ يَّشَآءَ اللّٰهُ ​ؕ اِنَّ اللّٰهَ كَانَ عَلِيۡمًا حَكِيۡمًا  ۖ‏"
                    },
                    {
                        "num": 31,
                        "text": "يُّدۡخِلُ مَنۡ يَّشَآءُ فِىۡ رَحۡمَتِهٖ​ؕ وَالظّٰلِمِيۡنَ اَعَدَّ لَهُمۡ عَذَابًا اَلِيۡمًا‏"
                    }
                ]
            },
            {
                "surah": "Al-Mursalat",
                "number": 77,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالۡمُرۡسَلٰتِ عُرۡفًا ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "فَالۡعٰصِفٰتِ عَصۡفًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّالنّٰشِرٰتِ نَشۡرًا ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "فَالۡفٰرِقٰتِ فَرۡقًا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَالۡمُلۡقِيٰتِ ذِكۡرًا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "عُذۡرًا اَوۡ نُذۡرًا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِنَّمَا تُوۡعَدُوۡنَ لَوَاقِعٌ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَاِذَا النُّجُوۡمُ طُمِسَتۡۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَ اِذَا السَّمَآءُ فُرِجَتۡۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَاِذَا الۡجِبَالُ نُسِفَتۡۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَاِذَا الرُّسُلُ اُقِّتَتۡؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "لِاَىِّ يَوۡمٍ اُجِّلَتۡؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "لِيَوۡمِ الۡفَصۡلِ​ۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا يَوۡمُ الۡفَصۡلِؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 16,
                        "text": "اَلَمۡ نُهۡلِكِ الۡاَوَّلِيۡنَؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "ثُمَّ نُتۡبِعُهُمُ الۡاٰخِرِيۡنَ‏"
                    },
                    {
                        "num": 18,
                        "text": "كَذٰلِكَ نَفۡعَلُ بِالۡمُجۡرِمِيۡنَ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 20,
                        "text": "اَلَمۡ نَخۡلُقۡكُّمۡ مِّنۡ مَّآءٍ مَّهِيۡنٍۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَجَعَلۡنٰهُ فِىۡ قَرَارٍ مَّكِيۡنٍۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "اِلٰى قَدَرٍ مَّعۡلُوۡمٍۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "فَقَدَرۡنَا ۖ فَنِعۡمَ الۡقٰدِرُوۡنَ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 25,
                        "text": "اَلَمۡ نَجۡعَلِ الۡاَرۡضَ كِفَاتًا ۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "اَحۡيَآءً وَّاَمۡوَاتًا ۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَّجَعَلۡنَا فِيۡهَا رَوَاسِىَ شٰمِخٰتٍ وَّ اَسۡقَيۡنٰكُمۡ مَّآءً فُرَاتًا ؕ‏"
                    },
                    {
                        "num": 28,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 29,
                        "text": "اِنْطَلِقُوۡۤا اِلٰى مَا كُنۡتُمۡ بِهٖ تُكَذِّبُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 30,
                        "text": "اِنْطَلِقُوۡۤا اِلٰى ظِلٍّ ذِىۡ ثَلٰثِ شُعَبٍۙ‏"
                    },
                    {
                        "num": 31,
                        "text": "لَّا ظَلِيۡلٍ وَّلَا يُغۡنِىۡ مِنَ اللَّهَبِؕ‏"
                    },
                    {
                        "num": 32,
                        "text": "اِنَّهَا تَرۡمِىۡ بِشَرَرٍ كَالۡقَصۡرِ​ۚ‏"
                    },
                    {
                        "num": 33,
                        "text": "كَاَنَّهٗ جِمٰلَتٌ صُفۡرٌ ؕ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 35,
                        "text": "هٰذَا يَوۡمُ لَا يَنۡطِقُوۡنَۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "وَلَا يُؤۡذَنُ لَهُمۡ فَيَـعۡتَذِرُوۡنَ‏"
                    },
                    {
                        "num": 37,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 38,
                        "text": "هٰذَا يَوۡمُ الۡفَصۡلِ​ۚ جَمَعۡنٰكُمۡ وَالۡاَوَّلِيۡنَ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَاِنۡ كَانَ لَـكُمۡ كَيۡدٌ فَكِيۡدُوۡنِ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 41,
                        "text": "اِنَّ الۡمُتَّقِيۡنَ فِىۡ ظِلٰلٍ وَّعُيُوۡنٍۙ‏"
                    },
                    {
                        "num": 42,
                        "text": "وَّفَوَاكِهَ مِمَّا يَشۡتَهُوۡنَؕ‏"
                    },
                    {
                        "num": 43,
                        "text": "كُلُوۡا وَاشۡرَبُوۡا هَنِيْٓئًا ۢ بِمَا كُنۡتُمۡ تَعۡمَلُوۡنَ‏"
                    },
                    {
                        "num": 44,
                        "text": "اِنَّا كَذٰلِكَ نَجۡزِى الۡمُحۡسِنِيۡنَ‏"
                    },
                    {
                        "num": 45,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 46,
                        "text": "كُلُوۡا وَتَمَتَّعُوۡا قَلِيۡلًا اِنَّكُمۡ مُّجۡرِمُوۡنَ‏"
                    },
                    {
                        "num": 47,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 48,
                        "text": "وَاِذَا قِيۡلَ لَهُمُ ارۡكَعُوۡا لَا يَرۡكَعُوۡنَ‏"
                    },
                    {
                        "num": 49,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَ‏"
                    },
                    {
                        "num": 50,
                        "text": "فَبِاَىِّ حَدِيۡثٍۢ بَعۡدَهٗ يُؤۡمِنُوۡنَ‏"
                    }
                ]
            }
        ]
    },
    "30": {
        "name": "Juz 30",
        "surahs": [
            {
                "surah": "An-Naba'",
                "number": 78,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "عَمَّ يَتَسَآءَلُوۡنَ​ۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "عَنِ النَّبَاِ الۡعَظِيۡمِۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "الَّذِىۡ هُمۡ فِيۡهِ مُخۡتَلِفُوۡنَؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "كَلَّا سَيَعۡلَمُوۡنَۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "ثُمَّ كَلَّا سَيَعۡلَمُوۡنَ‏"
                    },
                    {
                        "num": 6,
                        "text": "اَلَمۡ نَجۡعَلِ الۡاَرۡضَ مِهٰدًا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَّالۡجِبَالَ اَوۡتَادًا ۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَّخَلَقۡنٰكُمۡ اَزۡوَاجًا ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَّجَعَلۡنَا نَوۡمَكُمۡ سُبَاتًا ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَّجَعَلۡنَا الَّيۡلَ لِبَاسًا ۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَّجَعَلۡنَا النَّهَارَ مَعَاشًا‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّبَنَيۡنَا فَوۡقَكُمۡ سَبۡعًا شِدَادًا ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَّ جَعَلۡنَا سِرَاجًا وَّهَّاجًا ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَّاَنۡزَلۡنَا مِنَ الۡمُعۡصِرٰتِ مَآءً ثَجَّاجًا ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "لِّـنُخۡرِجَ بِهٖ حَبًّا وَّنَبَاتًا ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَّجَنّٰتٍ اَلۡفَافًا ؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِنَّ يَوۡمَ الۡفَصۡلِ كَانَ مِيۡقَاتًا ۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "يَّوۡمَ يُنۡفَخُ فِى الصُّوۡرِ فَتَاۡتُوۡنَ اَفۡوَاجًا ۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَّفُتِحَتِ السَّمَآءُ فَكَانَتۡ اَبۡوَابًا ۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَّ سُيِّرَتِ الۡجِبَالُ فَكَانَتۡ سَرَابًا ؕ‏"
                    },
                    {
                        "num": 21,
                        "text": "اِنَّ جَهَنَّمَ كَانَتۡ مِرۡصَادًا ۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "لِّلطّٰغِيۡنَ مَاٰبًا ۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "لّٰبِثِيۡنَ فِيۡهَاۤ اَحۡقَابًا​ ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "لَا يَذُوۡقُوۡنَ فِيۡهَا بَرۡدًا وَّلَا شَرَابًا ۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "اِلَّا حَمِيۡمًا وَّغَسَّاقًا ۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "جَزَآءً وِّفَاقًا ؕ‏"
                    },
                    {
                        "num": 27,
                        "text": "اِنَّهُمۡ كَانُوۡا لَا يَرۡجُوۡنَ حِسَابًا ۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "وَّكَذَّبُوۡا بِاٰيٰتِنَا كِذَّابًا ؕ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَكُلَّ شَىۡءٍ اَحۡصَيۡنٰهُ كِتٰبًا ۙ‏"
                    },
                    {
                        "num": 30,
                        "text": "فَذُوۡقُوۡا فَلَنۡ نَّزِيۡدَكُمۡ اِلَّا عَذَابًا‏"
                    },
                    {
                        "num": 31,
                        "text": "اِنَّ لِلۡمُتَّقِيۡنَ مَفَازًا ۙ‏"
                    },
                    {
                        "num": 32,
                        "text": "حَدَآٮِٕقَ وَاَعۡنَابًا ۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "وَّكَوَاعِبَ اَتۡرَابًا ۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "وَّكَاۡسًا دِهَاقًا ؕ‏"
                    },
                    {
                        "num": 35,
                        "text": "لَا يَسۡمَعُوۡنَ فِيۡهَا لَـغۡوًا وَّلَا كِذّٰبًا​ ۚ‏"
                    },
                    {
                        "num": 36,
                        "text": "جَزَآءً مِّنۡ رَّبِّكَ عَطَآءً حِسَابًا ۙ‏"
                    },
                    {
                        "num": 37,
                        "text": "رَّبِّ السَّمٰوٰتِ وَالۡاَرۡضِ وَمَا بَيۡنَهُمَا الرَّحۡمٰنِ​ لَا يَمۡلِكُوۡنَ مِنۡهُ خِطَابًا​ ۚ‏"
                    },
                    {
                        "num": 38,
                        "text": "يَوۡمَ يَقُوۡمُ الرُّوۡحُ وَالۡمَلٰٓٮِٕكَةُ صَفًّا ؕۙ لَّا يَتَكَلَّمُوۡنَ اِلَّا مَنۡ اَذِنَ لَهُ الرَّحۡمٰنُ وَقَالَ صَوَابًا​‏"
                    },
                    {
                        "num": 39,
                        "text": "ذٰلِكَ الۡيَوۡمُ الۡحَـقُّ​ ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰى رَبِّهٖ مَاٰبًا‏ ﻿﻿"
                    },
                    {
                        "num": 40,
                        "text": "اِنَّاۤ اَنۡذَرۡنٰـكُمۡ عَذَابًا قَرِيۡبًا ۖۚ  يَّوۡمَ يَنۡظُرُ الۡمَرۡءُ مَا قَدَّمَتۡ يَدٰهُ وَيَقُوۡلُ الۡـكٰفِرُ يٰلَيۡتَنِىۡ كُنۡتُ تُرٰبًا‏"
                    }
                ]
            },
            {
                "surah": "An-Nazi'at",
                "number": 79,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالنّٰزِعٰتِ غَرۡقًا ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَّالنّٰشِطٰتِ نَشۡطًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّالسّٰبِحٰتِ سَبۡحًا ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "فَالسّٰبِقٰتِ سَبۡقًا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَالۡمُدَبِّرٰتِ اَمۡرًا​ ۘ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَوۡمَ تَرۡجُفُ الرَّاجِفَةُ ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "تَتۡبَعُهَا الرَّادِفَةُ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "قُلُوۡبٌ يَّوۡمَٮِٕذٍ وَّاجِفَةٌ ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "اَبۡصَارُهَا خَاشِعَةٌ​ ۘ‏"
                    },
                    {
                        "num": 10,
                        "text": "يَقُوۡلُوۡنَ ءَاِنَّا لَمَرۡدُوۡدُوۡنَ فِى الۡحَـافِرَةِ ؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "ءَاِذَا كُنَّا عِظَامًا نَّخِرَةً ؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "قَالُوۡا تِلۡكَ اِذًا كَرَّةٌ خَاسِرَةٌ​ ۘ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَاِنَّمَا هِىَ زَجۡرَةٌ وَّاحِدَةٌ ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "فَاِذَا هُمۡ بِالسَّاهِرَةِ ؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "هَلۡ اَتٰٮكَ حَدِيۡثُ مُوۡسٰى​ۘ‏"
                    },
                    {
                        "num": 16,
                        "text": "اِذۡ نَادٰٮهُ رَبُّهٗ بِالۡوَادِ الۡمُقَدَّسِ طُوًى​ۚ‏"
                    },
                    {
                        "num": 17,
                        "text": "اِذۡهَبۡ اِلٰى فِرۡعَوۡنَ اِنَّهٗ طَغٰى ۖ‏"
                    },
                    {
                        "num": 18,
                        "text": "فَقُلۡ هَلۡ لَّكَ اِلٰٓى اَنۡ تَزَكّٰى ۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَاَهۡدِيَكَ اِلٰى رَبِّكَ فَتَخۡشٰى​ۚ‏"
                    },
                    {
                        "num": 20,
                        "text": "فَاَرٰٮهُ الۡاٰيَةَ الۡكُبۡرٰى ۖ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَكَذَّبَ وَعَصٰى ۖ‏"
                    },
                    {
                        "num": 22,
                        "text": "ثُمَّ اَدۡبَرَ يَسۡعٰىۖ‏"
                    },
                    {
                        "num": 23,
                        "text": "فَحَشَرَ فَنَادٰىۖ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَقَالَ اَنَا رَبُّكُمُ الۡاَعۡلٰى ۖ‏"
                    },
                    {
                        "num": 25,
                        "text": "فَاَخَذَهُ اللّٰهُ نَڪَالَ الۡاٰخِرَةِ وَالۡاُوۡلٰى ؕ‏"
                    },
                    {
                        "num": 26,
                        "text": "اِنَّ فِىۡ ذٰلِكَ لَعِبۡرَةً لِّمَنۡ يَّخۡشٰىؕ‏"
                    },
                    {
                        "num": 27,
                        "text": "ءَاَنۡتُمۡ اَشَدُّ خَلۡقًا اَمِ السَّمَآءُ​ ؕ بَنٰٮهَا‏"
                    },
                    {
                        "num": 28,
                        "text": "رَفَعَ سَمۡكَهَا فَسَوَّٮهَا ۙ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَ اَغۡطَشَ لَيۡلَهَا وَاَخۡرَجَ ضُحٰٮهَا‏"
                    },
                    {
                        "num": 30,
                        "text": "وَالۡاَرۡضَ بَعۡدَ ذٰلِكَ دَحٰٮهَا ؕ‏"
                    },
                    {
                        "num": 31,
                        "text": "اَخۡرَجَ مِنۡهَا مَآءَهَا وَمَرۡعٰٮهَا‏"
                    },
                    {
                        "num": 32,
                        "text": "وَالۡجِبَالَ اَرۡسٰٮهَا ۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "مَتَاعًا لَّـكُمۡ وَلِاَنۡعَامِكُمۡؕ‏"
                    },
                    {
                        "num": 34,
                        "text": "فَاِذَا جَآءَتِ الطَّآمَّةُ الۡكُبۡرٰى ۖ‏"
                    },
                    {
                        "num": 35,
                        "text": "يَوۡمَ يَتَذَكَّرُ الۡاِنۡسَانُ مَا سَعٰىۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "وَبُرِّزَتِ الۡجَحِيۡمُ لِمَنۡ يَّرٰى‏"
                    },
                    {
                        "num": 37,
                        "text": "فَاَمَّا مَنۡ طَغٰىۙ‏"
                    },
                    {
                        "num": 38,
                        "text": "وَاٰثَرَ الۡحَيٰوةَ الدُّنۡيَا ۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "فَاِنَّ الۡجَحِيۡمَ هِىَ الۡمَاۡوٰىؕ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَاَمَّا مَنۡ خَافَ مَقَامَ رَبِّهٖ وَ نَهَى النَّفۡسَ عَنِ الۡهَوٰىۙ‏"
                    },
                    {
                        "num": 41,
                        "text": "فَاِنَّ الۡجَـنَّةَ هِىَ الۡمَاۡوٰىؕ‏"
                    },
                    {
                        "num": 42,
                        "text": "يَسۡـــَٔلُوۡنَكَ عَنِ السَّاعَةِ اَيَّانَ مُرۡسٰٮهَا ؕ‏"
                    },
                    {
                        "num": 43,
                        "text": "فِيۡمَ اَنۡتَ مِنۡ ذِكۡرٰٮهَاؕ‏"
                    },
                    {
                        "num": 44,
                        "text": "اِلٰى رَبِّكَ مُنۡتَهٰٮهَاؕ‏"
                    },
                    {
                        "num": 45,
                        "text": "اِنَّمَاۤ اَنۡتَ مُنۡذِرُ مَنۡ يَّخۡشٰٮهَاؕ‏"
                    },
                    {
                        "num": 46,
                        "text": "كَاَنَّهُمۡ يَوۡمَ يَرَوۡنَهَا لَمۡ يَلۡبَثُوۡۤا اِلَّا عَشِيَّةً اَوۡ ضُحٰٮهَا‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "'Abasa",
                "number": 80,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "عَبَسَ وَتَوَلّٰٓىۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "اَنۡ جَآءَهُ الۡاَعۡمٰىؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمَا يُدۡرِيۡكَ لَعَلَّهٗ يَزَّكّٰٓىۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "اَوۡ يَذَّكَّرُ فَتَنۡفَعَهُ الذِّكۡرٰىؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "اَمَّا مَنِ اسۡتَغۡنٰىۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "فَاَنۡتَ لَهٗ تَصَدّٰىؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَمَا عَلَيۡكَ اَلَّا يَزَّكّٰٓىؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاَمَّا مَنۡ جَآءَكَ يَسۡعٰىۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَهُوَ يَخۡشٰىۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَاَنۡتَ عَنۡهُ تَلَهّٰى​ۚ‏"
                    },
                    {
                        "num": 11,
                        "text": "كَلَّاۤ اِنَّهَا تَذۡكِرَةٌ ۚ‏"
                    },
                    {
                        "num": 12,
                        "text": "فَمَنۡ شَآءَ ذَكَرَهٗ​ۘ‏"
                    },
                    {
                        "num": 13,
                        "text": "فِىۡ صُحُفٍ مُّكَرَّمَةٍۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "مَّرۡفُوۡعَةٍ مُّطَهَّرَةٍ ۭۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "بِاَيۡدِىۡ سَفَرَةٍۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "كِرَامٍۢ بَرَرَةٍؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "قُتِلَ الۡاِنۡسَانُ مَاۤ اَكۡفَرَهٗؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "مِنۡ اَىِّ شَىۡءٍ خَلَقَهٗؕ‏"
                    },
                    {
                        "num": 19,
                        "text": "مِنۡ نُّطۡفَةٍؕ خَلَقَهٗ فَقَدَّرَهٗ ۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "ثُمَّ السَّبِيۡلَ يَسَّرَهٗۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "ثُمَّ اَمَاتَهٗ فَاَقۡبَرَهٗۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "ثُمَّ اِذَا شَآءَ اَنۡشَرَهٗؕ‏"
                    },
                    {
                        "num": 23,
                        "text": "كَلَّا لَـمَّا يَقۡضِ مَاۤ اَمَرَهٗؕ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَلۡيَنۡظُرِ الۡاِنۡسَانُ اِلٰى طَعَامِهٖۤۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "اَنَّا صَبَبۡنَا الۡمَآءَ صَبًّا ۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "ثُمَّ شَقَقۡنَا الۡاَرۡضَ شَقًّا ۙ‏"
                    },
                    {
                        "num": 27,
                        "text": "فَاَنۡۢبَتۡنَا فِيۡهَا حَبًّا ۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "وَّ عِنَبًا وَّقَضۡبًا ۙ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَّزَيۡتُوۡنًا وَّنَخۡلًا ؕ‏"
                    },
                    {
                        "num": 30,
                        "text": "وَحَدَآٮِٕقَ غُلۡبًا ۙ‏"
                    },
                    {
                        "num": 31,
                        "text": "وَّفَاكِهَةً وَّاَبًّا ۙ‏"
                    },
                    {
                        "num": 32,
                        "text": "مَّتَاعًا لَّـكُمۡ وَلِاَنۡعَامِكُمۡؕ‏"
                    },
                    {
                        "num": 33,
                        "text": "فَاِذَا جَآءَتِ الصَّآخَّةُ‏"
                    },
                    {
                        "num": 34,
                        "text": "يَوۡمَ يَفِرُّ الۡمَرۡءُ مِنۡ اَخِيۡهِۙ‏"
                    },
                    {
                        "num": 35,
                        "text": "وَاُمِّهٖ وَاَبِيۡهِۙ‏"
                    },
                    {
                        "num": 36,
                        "text": "وَصَاحِبَتِهٖ وَبَنِيۡهِؕ‏"
                    },
                    {
                        "num": 37,
                        "text": "لِكُلِّ امۡرِیءٍ مِّنۡهُمۡ يَوۡمَٮِٕذٍ شَاۡنٌ يُّغۡنِيۡهِؕ‏"
                    },
                    {
                        "num": 38,
                        "text": "وُجُوۡهٌ يَّوۡمَٮِٕذٍ مُّسۡفِرَةٌ ۙ‏"
                    },
                    {
                        "num": 39,
                        "text": "ضَاحِكَةٌ مُّسۡتَبۡشِرَةٌ ۚ‏"
                    },
                    {
                        "num": 40,
                        "text": "وَوُجُوۡهٌ يَّوۡمَٮِٕذٍ عَلَيۡهَا غَبَرَةٌ ۙ‏"
                    },
                    {
                        "num": 41,
                        "text": "تَرۡهَقُهَا قَتَرَةٌ ؕ‏"
                    },
                    {
                        "num": 42,
                        "text": "اُولٰٓٮِٕكَ هُمُ الۡكَفَرَةُ الۡفَجَرَةُ‏"
                    }
                ]
            },
            {
                "surah": "At-Takwir",
                "number": 81,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا الشَّمۡسُ كُوِّرَتۡۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاِذَا النُّجُوۡمُ انْكَدَرَتۡۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِذَا الۡجِبَالُ سُيِّرَتۡۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاِذَا الۡعِشَارُ عُطِّلَتۡۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَاِذَا الۡوُحُوۡشُ حُشِرَتۡۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَاِذَا الۡبِحَارُ سُجِّرَتۡۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَاِذَا النُّفُوۡسُ زُوِّجَتۡۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاِذَا الۡمَوۡءٗدَةُ سُٮِٕلَتۡۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "بِاَىِّ ذَنۡۢبٍ قُتِلَتۡ​ۚ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَاِذَا الصُّحُفُ نُشِرَتۡۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَاِذَا السَّمَآءُ كُشِطَتۡۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَاِذَا الۡجَحِيۡمُ سُعِّرَتۡۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَاِذَا الۡجَـنَّةُ اُزۡلِفَتۡۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "عَلِمَتۡ نَفۡسٌ مَّاۤ اَحۡضَرَتۡؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "فَلَاۤ اُقۡسِمُ بِالۡخُنَّسِۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "الۡجَوَارِ الۡكُنَّسِۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَالَّيۡلِ اِذَا عَسۡعَسَۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَالصُّبۡحِ اِذَا تَنَفَّسَۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "اِنَّهٗ لَقَوۡلُ رَسُوۡلٍ كَرِيۡمٍۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "ذِىۡ قُوَّةٍ عِنۡدَ ذِى الۡعَرۡشِ مَكِيۡنٍۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "مُّطَاعٍ ثَمَّ اَمِيۡنٍؕ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَ مَا صَاحِبُكُمۡ بِمَجۡنُوۡنٍ​ۚ‏"
                    },
                    {
                        "num": 23,
                        "text": "وَلَقَدۡ رَاٰهُ بِالۡاُفُقِ الۡمُبِيۡنِ​ۚ‏"
                    },
                    {
                        "num": 24,
                        "text": "وَمَا هُوَ عَلَى الۡغَيۡبِ بِضَنِيۡنٍ​ۚ‏"
                    },
                    {
                        "num": 25,
                        "text": "وَمَا هُوَ بِقَوۡلِ شَيۡطٰنٍ رَّجِيۡمٍۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "فَاَيۡنَ تَذۡهَبُوۡنَؕ‏"
                    },
                    {
                        "num": 27,
                        "text": "اِنۡ هُوَ اِلَّا ذِكۡرٌ لِّلۡعٰلَمِيۡنَۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "لِمَنۡ شَآءَ مِنۡكُمۡ اَنۡ يَّسۡتَقِيۡمَؕ‏"
                    },
                    {
                        "num": 29,
                        "text": "وَمَا تَشَآءُوۡنَ اِلَّاۤ اَنۡ يَّشَآءَ اللّٰهُ رَبُّ الۡعٰلَمِيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Infithar",
                "number": 82,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا السَّمَآءُ انْفَطَرَتۡۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاِذَا الۡكَوَاكِبُ انْتَثَرَتۡۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِذَا الۡبِحَارُ فُجِّرَتۡۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاِذَا الۡقُبُوۡرُ بُعۡثِرَتۡۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "عَلِمَتۡ نَفۡسٌ مَّا قَدَّمَتۡ وَاَخَّرَتۡؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "يٰۤاَيُّهَا الۡاِنۡسَانُ مَا غَرَّكَ بِرَبِّكَ الۡكَرِيۡمِۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "الَّذِىۡ خَلَقَكَ فَسَوّٰٮكَ فَعَدَلَـكَۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "فِىۡۤ اَىِّ صُوۡرَةٍ مَّا شَآءَ رَكَّبَكَؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "كَلَّا بَلۡ تُكَذِّبُوۡنَ بِالدِّيۡنِۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَاِنَّ عَلَيۡكُمۡ لَحٰـفِظِيۡنَۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "كِرَامًا كَاتِبِيۡنَۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "يَعۡلَمُوۡنَ مَا تَفۡعَلُوۡنَ‏"
                    },
                    {
                        "num": 13,
                        "text": "اِنَّ الۡاَبۡرَارَ لَفِىۡ نَعِيۡمٍۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَاِنَّ الۡفُجَّارَ لَفِىۡ جَحِيۡمٍ ۚۖ‏"
                    },
                    {
                        "num": 15,
                        "text": "يَّصۡلَوۡنَهَا يَوۡمَ الدِّيۡنِ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَمَا هُمۡ عَنۡهَا بِغَآٮِٕبِيۡنَؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا يَوۡمُ الدِّيۡنِۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "ثُمَّ مَاۤ اَدۡرٰٮكَ مَا يَوۡمُ الدِّيۡنِؕ‏"
                    },
                    {
                        "num": 19,
                        "text": "يَوۡمَ لَا تَمۡلِكُ نَفۡسٌ لِّنَفۡسٍ شَيۡـــًٔا​ ؕ وَالۡاَمۡرُ يَوۡمَٮِٕذٍ لِّلَّهِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Mutaffifin",
                "number": 83,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَيۡلٌ لِّلۡمُطَفِّفِيۡنَۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "الَّذِيۡنَ اِذَا اكۡتَالُوۡا عَلَى النَّاسِ يَسۡتَوۡفُوۡنَۖ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِذَا كَالُوۡهُمۡ اَوْ وَّزَنُوۡهُمۡ يُخۡسِرُوۡنَؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "اَلَا يَظُنُّ اُولٰٓٮِٕكَ اَنَّهُمۡ مَّبۡعُوۡثُوۡنَۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "لِيَوۡمٍ عَظِيۡمٍۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَّوۡمَ يَقُوۡمُ النَّاسُ لِرَبِّ الۡعٰلَمِيۡنَؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "كَلَّاۤ اِنَّ كِتٰبَ الۡفُجَّارِ لَفِىۡ سِجِّيۡنٍؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا سِجِّيۡنٌؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "كِتٰبٌ مَّرۡقُوۡمٌؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَيۡلٌ يَّوۡمَٮِٕذٍ لِّلۡمُكَذِّبِيۡنَۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "الَّذِيۡنَ يُكَذِّبُوۡنَ بِيَوۡمِ الدِّيۡنِؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَمَا يُكَذِّبُ بِهٖۤ اِلَّا كُلُّ مُعۡتَدٍ اَثِيۡمٍۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "اِذَا تُتۡلٰى عَلَيۡهِ اٰيٰتُنَا قَالَ اَسَاطِيۡرُ الۡاَوَّلِيۡنَؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "كَلَّا​ بَلۡ رَانَ عَلٰى قُلُوۡبِهِمۡ مَّا كَانُوۡا يَكۡسِبُوۡنَ‏"
                    },
                    {
                        "num": 15,
                        "text": "كَلَّاۤ اِنَّهُمۡ عَنۡ رَّبِّهِمۡ يَوۡمَٮِٕذٍ لَّمَحۡجُوۡبُوۡنَ​ؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "ثُمَّ اِنَّهُمۡ لَصَالُوا الۡجَحِيۡمِؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "ثُمَّ يُقَالُ هٰذَا الَّذِىۡ كُنۡتُمۡ بِهٖ تُكَذِّبُوۡنَؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "كَلَّاۤ اِنَّ كِتٰبَ الۡاَبۡرَارِ لَفِىۡ عِلِّيِّيۡنَؕ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا عِلِّيُّوۡنَؕ‏"
                    },
                    {
                        "num": 20,
                        "text": "كِتٰبٌ مَّرۡقُوۡمٌۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "يَّشۡهَدُهُ الۡمُقَرَّبُوۡنَؕ‏"
                    },
                    {
                        "num": 22,
                        "text": "اِنَّ الۡاَبۡرَارَ لَفِىۡ نَعِيۡمٍۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "عَلَى الۡاَرَآٮِٕكِ يَنۡظُرُوۡنَۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "تَعۡرِفُ فِىۡ وُجُوۡهِهِمۡ نَضۡرَةَ النَّعِيۡمِ​ۚ‏"
                    },
                    {
                        "num": 25,
                        "text": "يُسۡقَوۡنَ مِنۡ رَّحِيۡقٍ مَّخۡتُوۡمٍۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "خِتٰمُهٗ مِسۡكٌ ​ؕ وَفِىۡ ذٰلِكَ فَلۡيَتَنَافَسِ الۡمُتَنــَافِسُوۡنَؕ‏"
                    },
                    {
                        "num": 27,
                        "text": "وَ مِزَاجُهٗ مِنۡ تَسۡنِيۡمٍۙ‏"
                    },
                    {
                        "num": 28,
                        "text": "عَيۡنًا يَّشۡرَبُ بِهَا الۡمُقَرَّبُوۡنَؕ‏"
                    },
                    {
                        "num": 29,
                        "text": "اِنَّ الَّذِيۡنَ اَجۡرَمُوۡا كَانُوۡا مِنَ الَّذِيۡنَ اٰمَنُوۡا يَضۡحَكُوۡنَ  ۖ‏"
                    },
                    {
                        "num": 30,
                        "text": "وَاِذَا مَرُّوۡا بِهِمۡ يَتَغَامَزُوۡنَ  ۖ‏"
                    },
                    {
                        "num": 31,
                        "text": "وَاِذَا انۡقَلَبُوۡۤا اِلٰٓى اَهۡلِهِمُ انْقَلَبُوۡا فَكِهِيۡنَ  ۖ‏"
                    },
                    {
                        "num": 32,
                        "text": "وَاِذَا رَاَوۡهُمۡ قَالُوۡۤا اِنَّ هٰٓؤُلَاۤءِ لَـضَآلُّوۡنَۙ‏"
                    },
                    {
                        "num": 33,
                        "text": "وَمَاۤ اُرۡسِلُوۡا عَلَيۡهِمۡ حٰفِظِيۡنَۙ‏"
                    },
                    {
                        "num": 34,
                        "text": "فَالۡيَوۡمَ الَّذِيۡنَ اٰمَنُوۡا مِنَ الۡكُفَّارِ يَضۡحَكُوۡنَۙ‏"
                    },
                    {
                        "num": 35,
                        "text": "عَلَى الۡاَرَآٮِٕكِۙ يَنۡظُرُوۡنَؕ‏"
                    },
                    {
                        "num": 36,
                        "text": "هَلۡ ثُوِّبَ الۡكُفَّارُ مَا كَانُوۡا يَفۡعَلُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Insyiqaq",
                "number": 84,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا السَّمَآءُ انْشَقَّتۡۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاَذِنَتۡ لِرَبِّهَا وَحُقَّتۡۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَاِذَا الۡاَرۡضُ مُدَّتۡؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَاَلۡقَتۡ مَا فِيۡهَا وَتَخَلَّتۡۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَاَذِنَتۡ لِرَبِّهَا وَحُقَّتۡؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "يٰۤاَيُّهَا الۡاِنۡسَانُ اِنَّكَ كَادِحٌ اِلٰى رَبِّكَ كَدۡحًا فَمُلٰقِيۡهِ​ۚ‏ ﻿﻿"
                    },
                    {
                        "num": 7,
                        "text": "فَاَمَّا مَنۡ اُوۡتِىَ كِتٰبَهٗ بِيَمِيۡنِهٖۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَسَوۡفَ يُحَاسَبُ حِسَابًا يَّسِيۡرًا ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَّيَنۡقَلِبُ اِلٰٓى اَهۡلِهٖ مَسۡرُوۡرًا ؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَاَمَّا مَنۡ اُوۡتِىَ كِتٰبَهٗ وَرَآءَ ظَهۡرِهٖۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "فَسَوۡفَ يَدۡعُوۡا ثُبُوۡرًا ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَّيَصۡلٰى سَعِيۡرًا ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "اِنَّهٗ كَانَ فِىۡۤ اَهۡلِهٖ مَسۡرُوۡرًا ؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "اِنَّهٗ ظَنَّ اَنۡ لَّنۡ يَّحُوۡرَ ۛۚ‏"
                    },
                    {
                        "num": 15,
                        "text": "بَلٰٓى ۛۚ اِنَّ رَبَّهٗ كَانَ بِهٖ بَصِيۡرًا ؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَلَاۤ اُقۡسِمُ بِالشَّفَقِۙ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَالَّيۡلِ وَمَا وَسَقَۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَالۡقَمَرِ اِذَا اتَّسَقَۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "لَتَرۡكَبُنَّ طَبَقًا عَنۡ طَبَقٍؕ‏"
                    },
                    {
                        "num": 20,
                        "text": "فَمَا لَهُمۡ لَا يُؤۡمِنُوۡنَۙ‏"
                    },
                    {
                        "num": 21,
                        "text": "وَاِذَا قُرِئَ عَلَيۡهِمُ الۡقُرۡاٰنُ لَا يَسۡجُدُوۡنَ ؕ ۩‏"
                    },
                    {
                        "num": 22,
                        "text": "بَلِ الَّذِيۡنَ كَفَرُوۡا يُكَذِّبُوۡنَ ۖ‏"
                    },
                    {
                        "num": 23,
                        "text": "وَاللّٰهُ اَعۡلَمُ بِمَا يُوۡعُوۡنَ ۖ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَبَشِّرۡهُمۡ بِعَذَابٍ اَلِيۡمٍۙ‏"
                    },
                    {
                        "num": 25,
                        "text": "اِلَّا الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ لَهُمۡ اَجۡرٌ غَيۡرُ مَمۡنُوۡنٍ‏ ﻿﻿"
                    }
                ]
            },
            {
                "surah": "Al-Buruj",
                "number": 85,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالسَّمَآءِ ذَاتِ الۡبُرُوۡجِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَالۡيَوۡمِ الۡمَوۡعُوۡدِۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَشَاهِدٍ وَّمَشۡهُوۡدٍؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "قُتِلَ اَصۡحٰبُ الۡاُخۡدُوۡدِۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "النَّارِ ذَاتِ الۡوَقُوۡدِۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِذۡ هُمۡ عَلَيۡهَا قُعُوۡدٌ ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَّهُمۡ عَلٰى مَا يَفۡعَلُوۡنَ بِالۡمُؤۡمِنِيۡنَ شُهُوۡدٌ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَمَا نَقَمُوۡا مِنۡهُمۡ اِلَّاۤ اَنۡ يُّؤۡمِنُوۡا بِاللّٰهِ الۡعَزِيۡزِ الۡحَمِيۡدِۙ‏ ﻿﻿"
                    },
                    {
                        "num": 9,
                        "text": "الَّذِىۡ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اللّٰهُ عَلٰى كُلِّ شَىۡءٍ شَهِيۡدٌ ؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "اِنَّ الَّذِيۡنَ فَتَـنُوا الۡمُؤۡمِنِيۡنَ وَ الۡمُؤۡمِنٰتِ ثُمَّ لَمۡ يَتُوۡبُوۡا فَلَهُمۡ عَذَابُ جَهَنَّمَ وَلَهُمۡ عَذَابُ الۡحَرِيۡقِؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ لَهُمۡ جَنّٰتٌ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ ؕ ذٰلِكَ الۡفَوۡزُ الۡكَبِيۡرُؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "اِنَّ بَطۡشَ رَبِّكَ لَشَدِيۡدٌ ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "اِنَّهٗ هُوَ يُبۡدِئُ وَيُعِيۡدُ​ ۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَهُوَ الۡغَفُوۡرُ الۡوَدُوۡدُۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "ذُو الۡعَرۡشِ الۡمَجِيۡدُ ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "فَعَّالٌ لِّمَا يُرِيۡدُ ؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "هَلۡ اَتٰٮكَ حَدِيۡثُ الۡجُـنُوۡدِۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "فِرۡعَوۡنَ وَثَمُوۡدَؕ‏"
                    },
                    {
                        "num": 19,
                        "text": "بَلِ الَّذِيۡنَ كَفَرُوۡا فِىۡ تَكۡذِيۡبٍۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَّاللّٰهُ مِنۡ وَّرَآٮِٕهِمۡ مُّحِيۡطٌۚ‏"
                    },
                    {
                        "num": 21,
                        "text": "بَلۡ هُوَ قُرۡاٰنٌ مَّجِيۡدٌ ۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "فِىۡ لَوۡحٍ مَّحۡفُوۡظٍ‏"
                    }
                ]
            },
            {
                "surah": "At-Tariq",
                "number": 86,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالسَّمَآءِ وَالطَّارِقِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا الطَّارِقُۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "النَّجۡمُ الثَّاقِبُۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنۡ كُلُّ نَفۡسٍ لَّمَّا عَلَيۡهَا حَافِظٌؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَلۡيَنۡظُرِ الۡاِنۡسَانُ مِمَّ خُلِقَؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "خُلِقَ مِنۡ مَّآءٍ دَافِقٍۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "يَّخۡرُجُ مِنۡۢ بَيۡنِ الصُّلۡبِ وَالتَّرَآٮِٕبِؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "اِنَّهٗ عَلٰى رَجۡعِهٖ لَقَادِرٌؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "يَوۡمَ تُبۡلَى السَّرَآٮِٕرُۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَمَا لَهٗ مِنۡ قُوَّةٍ وَّلَا نَاصِرٍؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَالسَّمَآءِ ذَاتِ الرَّجۡعِۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَالۡاَرۡضِ ذَاتِ الصَّدۡعِۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "اِنَّهٗ لَقَوۡلٌ فَصۡلٌۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَّمَا هُوَ بِالۡهَزۡلِؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "اِنَّهُمۡ يَكِيۡدُوۡنَ كَيۡدًا ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَّاَكِيۡدُ كَيۡدًا ۚۖ‏"
                    },
                    {
                        "num": 17,
                        "text": "فَمَهِّلِ الۡكٰفِرِيۡنَ اَمۡهِلۡهُمۡ رُوَيۡدًا‏"
                    }
                ]
            },
            {
                "surah": "Al-A'la",
                "number": 87,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "سَبِّحِ اسۡمَ رَبِّكَ الۡاَعۡلَىۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "الَّذِىۡ خَلَقَ فَسَوّٰى ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَالَّذِىۡ قَدَّرَ فَهَدٰى ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالَّذِىۡۤ اَخۡرَجَ الۡمَرۡعٰى ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَجَعَلَهٗ غُثَآءً اَحۡوٰىؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "سَنُقۡرِئُكَ فَلَا تَنۡسٰٓىۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِلَّا مَا شَآءَ اللّٰهُ​ؕ اِنَّهٗ يَعۡلَمُ الۡجَهۡرَ وَمَا يَخۡفٰىؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَنُيَسِّرُكَ لِلۡيُسۡرٰى ​ۖ​ۚ‏"
                    },
                    {
                        "num": 9,
                        "text": "فَذَكِّرۡ اِنۡ نَّفَعَتِ الذِّكۡرٰىؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "سَيَذَّكَّرُ مَنۡ يَّخۡشٰىۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَيَتَجَنَّبُهَا الۡاَشۡقَىۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "الَّذِىۡ يَصۡلَى النَّارَ الۡكُبۡرٰى​ۚ‏"
                    },
                    {
                        "num": 13,
                        "text": "ثُمَّ لَا يَمُوۡتُ فِيۡهَا وَلَا يَحۡيٰىؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "قَدۡ اَفۡلَحَ مَنۡ تَزَكّٰىۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَذَكَرَ اسۡمَ رَبِّهٖ فَصَلّٰى​ ؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "بَلۡ تُؤۡثِرُوۡنَ الۡحَيٰوةَ الدُّنۡيَا ۖ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَالۡاٰخِرَةُ خَيۡرٌ وَّ اَبۡقٰىؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "اِنَّ هٰذَا لَفِى الصُّحُفِ الۡاُوۡلٰىۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "صُحُفِ اِبۡرٰهِيۡمَ وَمُوۡسٰى‏"
                    }
                ]
            },
            {
                "surah": "Al-Ghasyiyah",
                "number": 88,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "هَلۡ اَتٰٮكَ حَدِيۡثُ الۡغَاشِيَةِؕ‏"
                    },
                    {
                        "num": 2,
                        "text": "وُجُوۡهٌ يَّوۡمَٮِٕذٍ خَاشِعَةٌ ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "عَامِلَةٌ نَّاصِبَةٌ ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "تَصۡلٰى نَارًا حَامِيَةً ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "تُسۡقٰى مِنۡ عَيۡنٍ اٰنِيَةٍؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "لَـيۡسَ لَهُمۡ طَعَامٌ اِلَّا مِنۡ ضَرِيۡعٍۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "لَّا يُسۡمِنُ وَلَا يُغۡنِىۡ مِنۡ جُوۡعٍؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وُجُوۡهٌ يَّوۡمَٮِٕذٍ نَّاعِمَةٌ ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "لِّسَعۡيِهَا رَاضِيَةٌ ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "فِىۡ جَنَّةٍ عَالِيَةٍۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "لَّا تَسۡمَعُ فِيۡهَا لَاغِيَةً ؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "فِيۡهَا عَيۡنٌ جَارِيَةٌ​ ۘ‏"
                    },
                    {
                        "num": 13,
                        "text": "فِيۡهَا سُرُرٌ مَّرۡفُوۡعَةٌ ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "وَّاَكۡوَابٌ مَّوۡضُوۡعَةٌ ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَّنَمَارِقُ مَصۡفُوۡفَةٌ ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَّزَرَابِىُّ مَبۡثُوۡثَةٌ ؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "اَفَلَا يَنۡظُرُوۡنَ اِلَى الۡاِ بِلِ كَيۡفَ خُلِقَتۡ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَاِلَى السَّمَآءِ كَيۡفَ رُفِعَتۡ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَاِلَى الۡجِبَالِ كَيۡفَ نُصِبَتۡ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَاِلَى الۡاَرۡضِ كَيۡفَ سُطِحَتۡ‏"
                    },
                    {
                        "num": 21,
                        "text": "فَذَكِّرۡ ؕ اِنَّمَاۤ اَنۡتَ مُذَكِّرٌ ؕ‏"
                    },
                    {
                        "num": 22,
                        "text": "لَـسۡتَ عَلَيۡهِمۡ بِمُصَۜيۡطِرٍۙ‏"
                    },
                    {
                        "num": 23,
                        "text": "اِلَّا مَنۡ تَوَلّٰى وَكَفَرَۙ‏"
                    },
                    {
                        "num": 24,
                        "text": "فَيُعَذِّبُهُ اللّٰهُ الۡعَذَابَ الۡاَكۡبَرَؕ‏"
                    },
                    {
                        "num": 25,
                        "text": "اِنَّ اِلَيۡنَاۤ اِيَابَهُمۡۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "ثُمَّ اِنَّ عَلَيۡنَا حِسَابَهُمْ‏"
                    }
                ]
            },
            {
                "surah": "Al-Fajr",
                "number": 89,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالۡفَجۡرِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَلَيَالٍ عَشۡرٍۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّالشَّفۡعِ وَالۡوَتۡرِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالَّيۡلِ اِذَا يَسۡرِ​ۚ‏"
                    },
                    {
                        "num": 5,
                        "text": "هَلۡ فِىۡ ذٰلِكَ قَسَمٌ لِّذِىۡ حِجۡرٍؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "اَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِعَادٍۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِرَمَ ذَاتِ الۡعِمَادِۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "الَّتِىۡ لَمۡ يُخۡلَقۡ مِثۡلُهَا فِى الۡبِلَادِۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَثَمُوۡدَ الَّذِيۡنَ جَابُوا الصَّخۡرَ بِالۡوَادِۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَفِرۡعَوۡنَ ذِى الۡاَوۡتَادِۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "الَّذِيۡنَ طَغَوۡا فِى الۡبِلَادِۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "فَاَكۡثَرُوۡا فِيۡهَا الۡفَسَادَۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَصَبَّ عَلَيۡهِمۡ رَبُّكَ سَوۡطَ عَذَابٍ ۙۚ‏"
                    },
                    {
                        "num": 14,
                        "text": "اِنَّ رَبَّكَ لَبِالۡمِرۡصَادِؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "فَاَمَّا الۡاِنۡسَانُ اِذَا مَا ابۡتَلٰٮهُ رَبُّهٗ فَاَكۡرَمَهٗ وَنَعَّمَهٗ  ۙ فَيَقُوۡلُ رَبِّىۡۤ اَكۡرَمَنِؕ‏"
                    },
                    {
                        "num": 16,
                        "text": "وَاَمَّاۤ اِذَا مَا ابۡتَلٰٮهُ فَقَدَرَ عَلَيۡهِ رِزۡقَهٗ ۙ فَيَقُوۡلُ رَبِّىۡۤ اَهَانَنِ​ۚ‏"
                    },
                    {
                        "num": 17,
                        "text": "كَلَّا​ بَلۡ لَّا تُكۡرِمُوۡنَ الۡيَتِيۡمَۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "وَلَا تَحٰٓضُّوۡنَ عَلٰى طَعَامِ الۡمِسۡكِيۡنِۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَتَاۡكُلُوۡنَ التُّرَاثَ اَكۡلًا لَّـمًّا ۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "وَّتُحِبُّوۡنَ الۡمَالَ حُبًّا جَمًّا ؕ‏"
                    },
                    {
                        "num": 21,
                        "text": "كَلَّاۤ اِذَا دُكَّتِ الۡاَرۡضُ دَكًّا دَكًّا ۙ‏"
                    },
                    {
                        "num": 22,
                        "text": "وَّجَآءَ رَبُّكَ وَالۡمَلَكُ صَفًّا صَفًّا ۚ‏"
                    },
                    {
                        "num": 23,
                        "text": "وَجِاىْٓءَ يَوۡمَٮِٕذٍۢ بِجَهَنَّمَ  ۙ​ يَوۡمَٮِٕذٍ يَّتَذَكَّرُ الۡاِنۡسَانُ وَاَنّٰى لَـهُ الذِّكۡرٰىؕ‏"
                    },
                    {
                        "num": 24,
                        "text": "يَقُوۡلُ يٰلَيۡتَنِىۡ قَدَّمۡتُ لِحَـيَاتِى​ۚ‏"
                    },
                    {
                        "num": 25,
                        "text": "فَيَوۡمَٮِٕذٍ لَّا يُعَذِّبُ عَذَابَهٗۤ اَحَدٌ ۙ‏"
                    },
                    {
                        "num": 26,
                        "text": "وَّلَا يُوۡثِقُ وَثَاقَهٗۤ اَحَدٌ ؕ‏"
                    },
                    {
                        "num": 27,
                        "text": "يٰۤاَيَّتُهَا النَّفۡسُ الۡمُطۡمَٮِٕنَّةُ  ۖ‏"
                    },
                    {
                        "num": 28,
                        "text": "ارۡجِعِىۡۤ اِلٰى رَبِّكِ رَاضِيَةً مَّرۡضِيَّةً​ ۚ‏"
                    },
                    {
                        "num": 29,
                        "text": "فَادۡخُلِىۡ فِىۡ عِبٰدِىۙ‏"
                    },
                    {
                        "num": 30,
                        "text": "وَادۡخُلِىۡ جَنَّتِى‏"
                    }
                ]
            },
            {
                "surah": "Al-Balad",
                "number": 90,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "لَاۤ اُقۡسِمُ بِهٰذَا الۡبَلَدِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاَنۡتَ حِلٌّ ۢ بِهٰذَا الۡبَلَدِۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَوَالِدٍ وَّمَا وَلَدَ ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ فِىۡ كَبَدٍؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "اَيَحۡسَبُ اَنۡ لَّنۡ يَّقۡدِرَ عَلَيۡهِ اَحَدٌ​ ۘ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَقُوۡلُ اَهۡلَكۡتُ مَالًا لُّبَدًا ؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "اَيَحۡسَبُ اَنۡ لَّمۡ يَرَهٗۤ اَحَدٌ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "اَلَمۡ نَجۡعَلۡ لَّهٗ عَيۡنَيۡنِۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَلِسَانًا وَّشَفَتَيۡنِۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَهَدَيۡنٰهُ النَّجۡدَيۡنِ​ۚ‏"
                    },
                    {
                        "num": 11,
                        "text": "فَلَا اقۡتَحَمَ الۡعَقَبَةَ ۖ‏"
                    },
                    {
                        "num": 12,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا الۡعَقَبَةُ ؕ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَكُّ رَقَبَةٍ ۙ‏"
                    },
                    {
                        "num": 14,
                        "text": "اَوۡ اِطۡعٰمٌ فِىۡ يَوۡمٍ ذِىۡ مَسۡغَبَةٍ ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "يَّتِيۡمًا ذَا مَقۡرَبَةٍ ۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "اَوۡ مِسۡكِيۡنًا ذَا مَتۡرَبَةٍ ؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "ثُمَّ كَانَ مِنَ الَّذِيۡنَ اٰمَنُوۡا وَتَوَاصَوۡا بِالصَّبۡرِ وَتَوَاصَوۡا بِالۡمَرۡحَمَةِ ؕ‏"
                    },
                    {
                        "num": 18,
                        "text": "اُولٰٓٮِٕكَ اَصۡحٰبُ الۡمَيۡمَنَةِ ؕ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَالَّذِيۡنَ كَفَرُوۡا بِاٰيٰتِنَا هُمۡ اَصۡحٰبُ الۡمَشۡـَٔـمَةِ ؕ‏"
                    },
                    {
                        "num": 20,
                        "text": "عَلَيۡهِمۡ نَارٌ مُّؤۡصَدَةٌ‏"
                    }
                ]
            },
            {
                "surah": "Ash-Shams",
                "number": 91,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالشَّمۡسِ وَضُحٰٮهَا  ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَالۡقَمَرِ اِذَا تَلٰٮهَا  ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَالنَّهَارِ اِذَا جَلّٰٮهَا ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَالَّيۡلِ اِذَا يَغۡشٰٮهَا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَالسَّمَآءِ وَمَا بَنٰٮهَا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَالۡاَرۡضِ وَمَا طَحٰٮهَا ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَنَفۡسٍ وَّمَا سَوّٰٮهَا ۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "فَاَلۡهَمَهَا فُجُوۡرَهَا وَتَقۡوٰٮهَا ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "قَدۡ اَفۡلَحَ مَنۡ زَكّٰٮهَا ۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَقَدۡ خَابَ مَنۡ دَسّٰٮهَا ؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "كَذَّبَتۡ ثَمُوۡدُ بِطَغۡوٰٮهَآ  ۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "اِذِ انۡۢبَعَثَ اَشۡقٰٮهَا  ۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "فَقَالَ لَهُمۡ رَسُوۡلُ اللّٰهِ نَاقَةَ اللّٰهِ وَسُقۡيٰهَا ؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "فَكَذَّبُوۡهُ فَعَقَرُوۡهَا   ۙفَدَمۡدَمَ عَلَيۡهِمۡ رَبُّهُمۡ بِذَنۡۢبِهِمۡ فَسَوّٰٮهَا  ۙ‏"
                    },
                    {
                        "num": 15,
                        "text": "وَلَا يَخَافُ عُقۡبٰهَا‏"
                    }
                ]
            },
            {
                "surah": "Al-Lail",
                "number": 92,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالَّيۡلِ اِذَا يَغۡشٰىۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَالنَّهَارِ اِذَا تَجَلّٰىۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمَا خَلَقَ الذَّكَرَ وَالۡاُنۡثٰٓىۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "اِنَّ سَعۡيَكُمۡ لَشَتّٰىؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَاَمَّا مَنۡ اَعۡطٰى وَاتَّقٰىۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "وَصَدَّقَ بِالۡحُسۡنٰىۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "فَسَنُيَسِّرُهٗ لِلۡيُسۡرٰىؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاَمَّا مَنۡۢ بَخِلَ وَاسۡتَغۡنٰىۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "وَكَذَّبَ بِالۡحُسۡنٰىۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "فَسَنُيَسِّرُهٗ لِلۡعُسۡرٰىؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَمَا يُغۡنِىۡ عَنۡهُ مَالُهٗۤ اِذَا تَرَدّٰىؕ‏"
                    },
                    {
                        "num": 12,
                        "text": "اِنَّ عَلَيۡنَا لَـلۡهُدٰىۖ‏"
                    },
                    {
                        "num": 13,
                        "text": "وَاِنَّ لَـنَا لَـلۡاٰخِرَةَ وَالۡاُوۡلٰى‏"
                    },
                    {
                        "num": 14,
                        "text": "فَاَنۡذَرۡتُكُمۡ نَارًا تَلَظّٰى​ۚ‏"
                    },
                    {
                        "num": 15,
                        "text": "لَا يَصۡلٰٮهَاۤ اِلَّا الۡاَشۡقَىۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "الَّذِىۡ كَذَّبَ وَتَوَلّٰىؕ‏"
                    },
                    {
                        "num": 17,
                        "text": "وَسَيُجَنَّبُهَا الۡاَتۡقَىۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "الَّذِىۡ يُؤۡتِىۡ مَالَهٗ يَتَزَكّٰى​ۚ‏"
                    },
                    {
                        "num": 19,
                        "text": "وَمَا لِاَحَدٍ عِنۡدَهٗ مِنۡ نِّعۡمَةٍ تُجۡزٰٓىۙ‏"
                    },
                    {
                        "num": 20,
                        "text": "اِلَّا ابۡتِغَآءَ وَجۡهِ رَبِّهِ الۡاَعۡلٰى​ۚ‏"
                    },
                    {
                        "num": 21,
                        "text": "وَلَسَوۡفَ يَرۡضٰى‏"
                    }
                ]
            },
            {
                "surah": "Adh-Dhuha",
                "number": 93,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالضُّحٰىۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَالَّيۡلِ اِذَا سَجٰىۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلٰىؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَلَـلۡاٰخِرَةُ خَيۡرٌ لَّكَ مِنَ الۡاُوۡلٰىؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَلَسَوۡفَ يُعۡطِيۡكَ رَبُّكَ فَتَرۡضٰىؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "اَلَمۡ يَجِدۡكَ يَتِيۡمًا فَاٰوٰى‏"
                    },
                    {
                        "num": 7,
                        "text": "وَوَجَدَكَ ضَآ لًّا فَهَدٰى‏"
                    },
                    {
                        "num": 8,
                        "text": "وَوَجَدَكَ عَآٮِٕلًا فَاَغۡنٰىؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "فَاَمَّا الۡيَتِيۡمَ فَلَا تَقۡهَرۡؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَاَمَّا السَّآٮِٕلَ فَلَا تَنۡهَرۡؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "وَاَمَّا بِنِعۡمَةِ رَبِّكَ فَحَدِّثۡ‏"
                    }
                ]
            },
            {
                "surah": "Asy-Syarh",
                "number": 94,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلَمۡ نَشۡرَحۡ لَـكَ صَدۡرَكَۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَوَضَعۡنَا عَنۡكَ وِزۡرَكَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "الَّذِىۡۤ اَنۡقَضَ ظَهۡرَكَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَرَفَعۡنَا لَـكَ ذِكۡرَكَؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَاِنَّ مَعَ الۡعُسۡرِ يُسۡرًا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّ مَعَ الۡعُسۡرِ يُسۡرًا ؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "فَاِذَا فَرَغۡتَ فَانۡصَبۡۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاِلٰى رَبِّكَ فَارۡغَب‏"
                    }
                ]
            },
            {
                "surah": "At-Tin",
                "number": 95,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالتِّيۡنِ وَالزَّيۡتُوۡنِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَطُوۡرِ سِيۡنِيۡنَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَهٰذَا الۡبَلَدِ الۡاَمِيۡنِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ فِىۡۤ اَحۡسَنِ تَقۡوِيۡمٍ‏"
                    },
                    {
                        "num": 5,
                        "text": "ثُمَّ رَدَدۡنٰهُ اَسۡفَلَ سَافِلِيۡنَۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِلَّا الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ فَلَهُمۡ اَجۡرٌ غَيۡرُ مَمۡنُوۡنٍؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "فَمَا يُكَذِّبُكَ بَعۡدُ بِالدِّيۡنِ‏"
                    },
                    {
                        "num": 8,
                        "text": "اَلَيۡسَ اللّٰهُ بِاَحۡكَمِ الۡحٰكِمِيۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-'Alaq",
                "number": 96,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِقۡرَاۡ بِاسۡمِ رَبِّكَ الَّذِىۡ خَلَقَ​ۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "خَلَقَ الۡاِنۡسَانَ مِنۡ عَلَقٍ​ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "اِقۡرَاۡ وَرَبُّكَ الۡاَكۡرَمُۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "الَّذِىۡ عَلَّمَ بِالۡقَلَمِۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "عَلَّمَ الۡاِنۡسَانَ مَا لَمۡ يَعۡلَمۡؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "كَلَّاۤ اِنَّ الۡاِنۡسَانَ لَيَطۡغٰٓىۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "اَنۡ رَّاٰهُ اسۡتَغۡنٰىؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "اِنَّ اِلٰى رَبِّكَ الرُّجۡعٰىؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "اَرَءَيۡتَ الَّذِىۡ يَنۡهٰىؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "عَبۡدًا اِذَا صَلّٰىؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "اَرَءَيۡتَ اِنۡ كَانَ عَلَى الۡهُدٰٓىۙ‏"
                    },
                    {
                        "num": 12,
                        "text": "اَوۡ اَمَرَ بِالتَّقۡوٰىۙ‏"
                    },
                    {
                        "num": 13,
                        "text": "اَرَءَيۡتَ اِنۡ كَذَّبَ وَتَوَلّٰىؕ‏"
                    },
                    {
                        "num": 14,
                        "text": "اَلَمۡ يَعۡلَمۡ بِاَنَّ اللّٰهَ يَرٰىؕ‏"
                    },
                    {
                        "num": 15,
                        "text": "كَلَّا لَٮِٕنۡ لَّمۡ يَنۡتَهِ  ۙ لَنَسۡفَعًۢا بِالنَّاصِيَةِۙ‏"
                    },
                    {
                        "num": 16,
                        "text": "نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ​ ۚ‏"
                    },
                    {
                        "num": 17,
                        "text": "فَلۡيَدۡعُ نَادِيَهٗ ۙ‏"
                    },
                    {
                        "num": 18,
                        "text": "سَنَدۡعُ الزَّبَانِيَةَ ۙ‏"
                    },
                    {
                        "num": 19,
                        "text": "كَلَّا ؕ لَا تُطِعۡهُ وَاسۡجُدۡ وَاقۡتَرِبْ۩‏"
                    }
                ]
            },
            {
                "surah": "Al-Qadr",
                "number": 97,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِنَّاۤ اَنۡزَلۡنٰهُ فِىۡ لَيۡلَةِ الۡقَدۡرِ ۖ ۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا لَيۡلَةُ الۡقَدۡرِؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "لَيۡلَةُ الۡقَدۡرِ  ۙ خَيۡرٌ مِّنۡ اَلۡفِ شَهۡرٍؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "تَنَزَّلُ الۡمَلٰٓٮِٕكَةُ وَالرُّوۡحُ فِيۡهَا بِاِذۡنِ رَبِّهِمۡ​ۚ مِّنۡ كُلِّ اَمۡرٍ ۛۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "سَلٰمٌ   ۛهِىَ حَتّٰى مَطۡلَعِ الۡفَجۡرِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Bayyinah",
                "number": 98,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "لَمۡ يَكُنِ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَالۡمُشۡرِكِيۡنَ مُنۡفَكِّيۡنَ حَتّٰى تَاۡتِيَهُمُ الۡبَيِّنَةُ ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "رَسُوۡلٌ مِّنَ اللّٰهِ يَتۡلُوۡا صُحُفًا مُّطَهَّرَةً ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "فِيۡهَا كُتُبٌ قَيِّمَةٌ ؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَمَا تَفَرَّقَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ اِلَّا مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنَةُ ؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَمَاۤ اُمِرُوۡۤا اِلَّا لِيَعۡبُدُوا اللّٰهَ مُخۡلِصِيۡنَ لَـهُ الدِّيۡنَ  ۙ حُنَفَآءَ وَيُقِيۡمُوا الصَّلٰوةَ وَيُؤۡتُوا الزَّكٰوةَ​ وَذٰلِكَ دِيۡنُ الۡقَيِّمَةِ ؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَ الۡمُشۡرِكِيۡنَ فِىۡ نَارِ جَهَنَّمَ خٰلِدِيۡنَ فِيۡهَا ​ؕ اُولٰٓٮِٕكَ هُمۡ شَرُّ الۡبَرِيَّةِ ؕ‏"
                    },
                    {
                        "num": 7,
                        "text": "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِۙ اُولٰٓٮِٕكَ هُمۡ خَيۡرُ الۡبَرِيَّةِ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "جَزَآؤُهُمۡ عِنۡدَ رَبِّهِمۡ جَنّٰتُ عَدۡنٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ خٰلِدِيۡنَ فِيۡهَاۤ اَبَدًا ​ؕ رَضِىَ اللّٰهُ عَنۡهُمۡ وَرَضُوۡا عَنۡهُ ​ؕ ذٰلِكَ لِمَنۡ خَشِىَ رَبَّهٗ‏"
                    }
                ]
            },
            {
                "surah": "Az-Zalzalah",
                "number": 99,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا زُلۡزِلَتِ الۡاَرۡضُ زِلۡزَالَهَا ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَاَخۡرَجَتِ الۡاَرۡضُ اَثۡقَالَهَا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَقَالَ الۡاِنۡسَانُ مَا لَهَا​ ۚ‏"
                    },
                    {
                        "num": 4,
                        "text": "يَوۡمَٮِٕذٍ تُحَدِّثُ اَخۡبَارَهَا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "بِاَنَّ رَبَّكَ اَوۡحٰى لَهَا ؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "يَوۡمَٮِٕذٍ يَّصۡدُرُ النَّاسُ اَشۡتَاتًا  ۙ لِّيُرَوۡا اَعۡمَالَهُمۡؕ‏ ﻿﻿"
                    },
                    {
                        "num": 7,
                        "text": "فَمَنۡ يَّعۡمَلۡ مِثۡقَالَ ذَرَّةٍ خَيۡرًا يَّرَهٗ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَمَنۡ يَّعۡمَلۡ مِثۡقَالَ ذَرَّةٍ شَرًّا يَّرَهٗ‏"
                    }
                ]
            },
            {
                "surah": "Al-'Adiyat",
                "number": 100,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالۡعٰدِيٰتِ ضَبۡحًا ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "فَالۡمُوۡرِيٰتِ قَدۡحًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "فَالۡمُغِيۡرٰتِ صُبۡحًا ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "فَاَثَرۡنَ بِهٖ نَقۡعًا ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَوَسَطۡنَ بِهٖ جَمۡعًا ۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "اِنَّ الۡاِنۡسَانَ لِرَبِّهٖ لَـكَنُوۡدٌ ۚ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَاِنَّهٗ عَلٰى ذٰلِكَ لَشَهِيۡدٌ ۚ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاِنَّهٗ لِحُبِّ الۡخَيۡرِ لَشَدِيۡدٌ ؕ‏"
                    },
                    {
                        "num": 9,
                        "text": "اَفَلَا يَعۡلَمُ اِذَا بُعۡثِرَ مَا فِى الۡقُبُوۡرِۙ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَحُصِّلَ مَا فِى الصُّدُوۡرِۙ‏"
                    },
                    {
                        "num": 11,
                        "text": "اِنَّ رَبَّهُمۡ بِهِمۡ يَوۡمَٮِٕذٍ لَّخَبِيۡرٌ‏"
                    }
                ]
            },
            {
                "surah": "Al-Qari'ah",
                "number": 101,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلۡقَارِعَةُ ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَا الۡقَارِعَةُ​ ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا الۡقَارِعَةُ ؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "يَوۡمَ يَكُوۡنُ النَّاسُ كَالۡفَرَاشِ الۡمَبۡثُوۡثِۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَتَكُوۡنُ الۡجِبَالُ كَالۡعِهۡنِ الۡمَنۡفُوۡشِؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "فَاَمَّا مَنۡ ثَقُلَتۡ مَوَازِيۡنُهٗ ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "فَهُوَ فِىۡ عِيۡشَةٍ رَّاضِيَةٍ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "وَاَمَّا مَنۡ خَفَّتۡ مَوَازِيۡنُهٗ ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "فَاُمُّهٗ هَاوِيَةٌ ؕ‏"
                    },
                    {
                        "num": 10,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا هِيَهۡ ؕ‏"
                    },
                    {
                        "num": 11,
                        "text": "نَارٌ حَامِيَةٌ‏"
                    }
                ]
            },
            {
                "surah": "At-Takatsur",
                "number": 102,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلۡهٰٮكُمُ التَّكَاثُرُۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "حَتّٰى زُرۡتُمُ الۡمَقَابِرَؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "كَلَّا سَوۡفَ تَعۡلَمُوۡنَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "ثُمَّ كَلَّا سَوۡفَ تَعۡلَمُوۡنَؕ‏"
                    },
                    {
                        "num": 5,
                        "text": "كَلَّا لَوۡ تَعۡلَمُوۡنَ عِلۡمَ الۡيَقِيۡنِؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "لَتَرَوُنَّ الۡجَحِيۡمَۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "ثُمَّ لَتَرَوُنَّهَا عَيۡنَ الۡيَقِيۡنِۙ‏"
                    },
                    {
                        "num": 8,
                        "text": "ثُمَّ لَـتُسۡـَٔـلُنَّ يَوۡمَٮِٕذٍ عَنِ النَّعِيۡمِ‏"
                    }
                ]
            },
            {
                "surah": "Al-'Asr",
                "number": 103,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَالۡعَصۡرِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "اِنَّ الۡاِنۡسَانَ لَفِىۡ خُسۡرٍۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "اِلَّا الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَتَوَاصَوۡا بِالۡحَقِّ   ۙ وَتَوَاصَوۡا بِالصَّبۡرِ‏"
                    }
                ]
            },
            {
                "surah": "Al-Humazah",
                "number": 104,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "وَيۡلٌ لِّـكُلِّ هُمَزَةٍ لُّمَزَةِ ۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "اۨلَّذِىۡ جَمَعَ مَالًا وَّعَدَّدَهٗ ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "يَحۡسَبُ اَنَّ مَالَهٗۤ اَخۡلَدَهٗ​ ۚ‏"
                    },
                    {
                        "num": 4,
                        "text": "كَلَّا​ لَيُنۡۢبَذَنَّ فِى الۡحُطَمَةِ  ۖ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَمَاۤ اَدۡرٰٮكَ مَا الۡحُطَمَةُ ؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "نَارُ اللّٰهِ الۡمُوۡقَدَةُ ۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "الَّتِىۡ تَطَّلِعُ عَلَى الۡاَفۡـــِٕدَةِ ؕ‏"
                    },
                    {
                        "num": 8,
                        "text": "اِنَّهَا عَلَيۡهِمۡ مُّؤۡصَدَةٌ ۙ‏"
                    },
                    {
                        "num": 9,
                        "text": "فِىۡ عَمَدٍ مُّمَدَّدَةٍ‏"
                    }
                ]
            },
            {
                "surah": "Al-Fil",
                "number": 105,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِاَصۡحٰبِ الۡفِيۡلِؕ‏"
                    },
                    {
                        "num": 2,
                        "text": "اَلَمۡ يَجۡعَلۡ كَيۡدَهُمۡ فِىۡ تَضۡلِيۡلٍۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَّاَرۡسَلَ عَلَيۡهِمۡ طَيۡرًا اَبَابِيۡلَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "تَرۡمِيۡهِمۡ بِحِجَارَةٍ مِّنۡ سِجِّيۡلٍۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "فَجَعَلَهُمۡ كَعَصۡفٍ مَّاۡكُوۡلٍ‏"
                    }
                ]
            },
            {
                "surah": "Quraisy",
                "number": 106,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "لِاِيۡلٰفِ قُرَيۡشٍۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "اٖلٰفِهِمۡ رِحۡلَةَ الشِّتَآءِ وَالصَّيۡفِ​ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "فَلۡيَـعۡبُدُوۡا رَبَّ هٰذَا الۡبَيۡتِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "الَّذِىۡۤ اَطۡعَمَهُمۡ مِّنۡ جُوۡعٍ   ۙ وَّاٰمَنَهُمۡ مِّنۡ خَوۡفٍ‏"
                    }
                ]
            },
            {
                "surah": "Al-Ma'un",
                "number": 107,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اَرَءَيۡتَ الَّذِىۡ يُكَذِّبُ بِالدِّيۡنِؕ‏"
                    },
                    {
                        "num": 2,
                        "text": "فَذٰلِكَ الَّذِىۡ يَدُعُّ الۡيَتِيۡمَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَ لَا يَحُضُّ عَلٰى طَعَامِ الۡمِسۡكِيۡنِؕ‏"
                    },
                    {
                        "num": 4,
                        "text": "فَوَيۡلٌ لِّلۡمُصَلِّيۡنَۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "الَّذِيۡنَ هُمۡ عَنۡ صَلَاتِهِمۡ سَاهُوۡنَۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "الَّذِيۡنَ هُمۡ يُرَآءُوۡنَۙ‏"
                    },
                    {
                        "num": 7,
                        "text": "وَيَمۡنَعُوۡنَ الۡمَاعُوۡنَ‏"
                    }
                ]
            },
            {
                "surah": "Al-Kautsar",
                "number": 108,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِنَّاۤ اَعۡطَيۡنٰكَ الۡكَوۡثَرَؕ‏"
                    },
                    {
                        "num": 2,
                        "text": "فَصَلِّ لِرَبِّكَ وَانۡحَرۡ ؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "اِنَّ شَانِئَكَ هُوَ الۡاَبۡتَرُ‏"
                    }
                ]
            },
            {
                "surah": "Al-Kafirun",
                "number": 109,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قُلۡ يٰۤاَيُّهَا الۡكٰفِرُوۡنَۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "لَاۤ اَعۡبُدُ مَا تَعۡبُدُوۡنَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَلَاۤ اَنۡـتُمۡ عٰبِدُوۡنَ مَاۤ اَعۡبُدُ​ ۚ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَلَاۤ اَنَا عَابِدٌ مَّا عَبَدۡتُّمۡۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَ لَاۤ اَنۡـتُمۡ عٰبِدُوۡنَ مَاۤ اَعۡبُدُ ؕ‏"
                    },
                    {
                        "num": 6,
                        "text": "لَـكُمۡ دِيۡنُكُمۡ وَلِىَ دِيۡنِ‏"
                    }
                ]
            },
            {
                "surah": "An-Nasr",
                "number": 110,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "اِذَا جَآءَ نَصۡرُ اللّٰهِ وَالۡفَتۡحُۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "وَرَاَيۡتَ النَّاسَ يَدۡخُلُوۡنَ فِىۡ دِيۡنِ اللّٰهِ اَفۡوَاجًا ۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَاسۡتَغۡفِرۡهُ​ ؕ اِنَّهٗ كَانَ تَوَّابًا‏"
                    }
                ]
            },
            {
                "surah": "Al-Masad",
                "number": 111,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "تَبَّتۡ يَدَاۤ اَبِىۡ لَهَبٍ وَّتَبَّؕ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَاۤ اَغۡنٰى عَنۡهُ مَالُهٗ وَمَا كَسَبَؕ‏"
                    },
                    {
                        "num": 3,
                        "text": "سَيَصۡلٰى نَارًا ذَاتَ لَهَبٍ ۖۚ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَّامۡرَاَ تُهٗ ؕ حَمَّالَةَ الۡحَطَبِ​ۚ‏"
                    },
                    {
                        "num": 5,
                        "text": "فِىۡ جِيۡدِهَا حَبۡلٌ مِّنۡ مَّسَدٍ‏"
                    }
                ]
            },
            {
                "surah": "Al-Ikhlas",
                "number": 112,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قُلۡ هُوَ اللّٰهُ اَحَدٌ​ ۚ‏"
                    },
                    {
                        "num": 2,
                        "text": "اَللّٰهُ الصَّمَدُ​ ۚ‏"
                    },
                    {
                        "num": 3,
                        "text": "لَمۡ يَلِدۡ   ۙ وَلَمۡ يُوۡلَدۡ ۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَلَمۡ يَكُنۡ لَّهٗ كُفُوًا اَحَدٌ‏"
                    }
                ]
            },
            {
                "surah": "Al-Falaq",
                "number": 113,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قُلۡ اَعُوۡذُ بِرَبِّ الۡفَلَقِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مِنۡ شَرِّ مَا خَلَقَۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "وَمِنۡ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "وَمِنۡ شَرِّ النَّفّٰثٰتِ فِى الۡعُقَدِۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "وَمِنۡ شَرِّ حَاسِدٍ اِذَا حَسَدَ‏"
                    }
                ]
            },
            {
                "surah": "An-Nas",
                "number": 114,
                "ayahs": [
                    {
                        "num": 1,
                        "text": "قُلۡ اَعُوۡذُ بِرَبِّ النَّاسِۙ‏"
                    },
                    {
                        "num": 2,
                        "text": "مَلِكِ النَّاسِۙ‏"
                    },
                    {
                        "num": 3,
                        "text": "اِلٰهِ النَّاسِۙ‏"
                    },
                    {
                        "num": 4,
                        "text": "مِنۡ شَرِّ الۡوَسۡوَاسِ  ۙ الۡخَـنَّاسِ ۙ‏"
                    },
                    {
                        "num": 5,
                        "text": "الَّذِىۡ يُوَسۡوِسُ فِىۡ صُدُوۡرِ النَّاسِۙ‏"
                    },
                    {
                        "num": 6,
                        "text": "مِنَ الۡجِنَّةِ وَالنَّاسِ‏"
                    }
                ]
            }
        ]
    }
};

if (typeof module !== 'undefined') module.exports = quranData;